[
  {
    "uid": "006668",
    "code": "PLPA1001",
    "subject": "PLPA",
    "number": "1001",
    "honors": false,
    "writing": false,
    "name": "Microbes, Plants & People",
    "fullname": "Microbes, Plants, and People: The Social and Economic Impact of Plant Disease",
    "info": "The positive and negative effects of microorganisms on plants and their ultimate effects on human history, economics, and society.",
    "prereq": {}
  },
  {
    "uid": "006960",
    "code": "PLPA1002",
    "subject": "PLPA",
    "number": "1002",
    "honors": false,
    "writing": false,
    "name": "Plant Diseases & Your Garden",
    "fullname": "Plant Diseases and Your Garden",
    "info": "Characteristics and causes of diseases that can affect the growth of plants with emphasis on flowers, small fruits, and vegetables. In-depth study of 18 different plant diseases that may appear in your garden, why they occur, and how to avoid them.",
    "prereq": {}
  },
  {
    "uid": "006912",
    "code": "PLPA1003",
    "subject": "PLPA",
    "number": "1003",
    "honors": false,
    "writing": false,
    "name": "All About Mushrooms",
    "fullname": "All About Mushrooms",
    "info": "Recognition of edible, poisonous, common, or conspicuous forms of mushrooms as well as mushroom folklore, art and recipes, and ecology. Field trip. For students with some elementary biology but no formal education in mycology.",
    "prereq": {}
  },
  {
    "uid": "016114",
    "code": "PLPA1004",
    "subject": "PLPA",
    "number": "1004",
    "honors": false,
    "writing": false,
    "name": "Diseases of Turfgrasses",
    "fullname": "Diseases of Turfgrasses",
    "info": "Turfgrass diseases, insect/nematode problems, role of turfgrass ecology in disease development. Tools to diagnose/provide recommended strategies for turfgrass diseases. Safe/effective pesticide strategies, integrated pest management plans for management.",
    "prereq": {}
  },
  {
    "uid": "793529",
    "code": "PLPA1005",
    "subject": "PLPA",
    "number": "1005",
    "honors": false,
    "writing": false,
    "name": "Plants Get Sick Too",
    "fullname": "Plants Get Sick Too",
    "info": "Biology of plant disease and plant-disease-causing organisms. Effects of plant disease on agriculture, human health/welfare, and the environment. Management/control of plant disease. Lecture, Internet, lab. ",
    "prereq": {}
  },
  {
    "uid": "817272",
    "code": "PLPA1901",
    "subject": "PLPA",
    "number": "1901",
    "honors": false,
    "writing": false,
    "name": "Antibiotics:Promise & Pitfalls",
    "fullname": "Antibiotics: Promise, Profits, and Pitfalls",
    "info": "The discovery and availability of antibiotics has fundamentally changed the treatment of human infectious diseases. However, the broad effectiveness of antibiotics in reducing bacterial infections has led to overuse in medicine and agriculture. Consequences of overuse include widespread resistance to common antibiotics as well as antibiotic contamination in the environment. Antibiotic resistance currently represents a significant threat to treatment of some infectious bacteria, yet profit incentives and patenting regulations have limited investments by pharmaceutical companies in development of new antimicrobials. This course will explore the intriguing biology, chemistry, ecology, and evolutionary biology of antimicrobial warfare; the history of antibiotic discovery; the broad uses for antibiotics in medicine and agriculture; the costs, profits, and patenting issues associated with antibiotic development and production; the ethics of antibiotic regulation in developed and developing countries; and the future of antibiotic therapies in medicine and agriculture.\n\nprereq: freshman",
    "prereq": {}
  },
  {
    "uid": "817021",
    "code": "PLPA1902",
    "subject": "PLPA",
    "number": "1902",
    "honors": false,
    "writing": false,
    "name": "Sqnce Plants, Pets, Pathogens",
    "fullname": "Sequencing Plants, Pets, and Pathogens: The Genomics of Non-Humans",
    "info": "Sequencing DNA enables powerful new insights into the biology of plants, animals, and microbes. This freshman seminar explores the discoveries, applications, and implications of DNA sequencing technology. Along the way, we learn about genomics, DNA testing, domestication, genome engineering, archaic hominids, de-extinction, microbiomes, and sequence-based tracking of epidemics – primarily through readings in the popular press, YouTube videos, in-class practicums, and debates. \n\nNevin Young is a genomicist and professor of plant pathology. His lab studies the genomic basis of symbiosis between legume plants and nitrogen-fixing bacteria. In the classroom, he teaches courses in genomics and biotechnology, exploring their impacts on public policy and environmental debates. \n",
    "prereq": {}
  },
  {
    "uid": "809608",
    "code": "PLPA1942",
    "subject": "PLPA",
    "number": "1942",
    "honors": false,
    "writing": false,
    "name": "Topics: Freshman Seminar",
    "fullname": "Topics: Freshman Seminar",
    "info": "Topics specified in class catalog.",
    "prereq": {}
  },
  {
    "uid": "006949",
    "code": "PLPA2001",
    "subject": "PLPA",
    "number": "2001",
    "honors": false,
    "writing": false,
    "name": "Intro to Plant Path",
    "fullname": "Introductory Plant Pathology",
    "info": "Biology of the major groups of plant pathogens, symptoms and signs of plant disease, plant disease diagnosis, and principles of disease management. Lecture and laboratory.\n\nprereq: BIOL 1009 or equiv",
    "prereq": {
      "or": [
        "005416"
      ]
    }
  },
  {
    "uid": "007743",
    "code": "PLPA2002",
    "subject": "PLPA",
    "number": "2002",
    "honors": false,
    "writing": false,
    "name": "Management Field Crop Dis.",
    "fullname": "Management and Control of Field Crop Diseases",
    "info": "Dynamics of plant pathogens, their control in plant disease. Crops discussed (i.e., small grain, corn, soybeans, potatoes, sugar beets, dry beans) are found in common rotations practiced in Minnesota.",
    "prereq": {}
  },
  {
    "uid": "809937",
    "code": "PLPA2003",
    "subject": "PLPA",
    "number": "2003",
    "honors": false,
    "writing": false,
    "name": "Plague, Famine, and Beer",
    "fullname": "Plague, Famine, and Beer: The Impact of Microscopic Organisms on Human Civilization",
    "info": "Impacts that microbes have made on course of human civilization. Negative influences of major human/plant infectious disease. Positive benefits attained by harnessing power of microbes. Scale of history includes prehistoric to present day. Projected future impacts. ",
    "prereq": {}
  },
  {
    "uid": "007774",
    "code": "PLPA3001",
    "subject": "PLPA",
    "number": "3001",
    "honors": false,
    "writing": false,
    "name": "Plant Disease Biology & Mgmt",
    "fullname": "Plant Disease Biology and Management",
    "info": "Introduction to organisms that cause plant diseases. Symptoms of plant diseases, economic losses due to plant diseases, and chemical and biological strategies for managing plant diseases will be discussed.",
    "prereq": {}
  },
  {
    "uid": "007254",
    "code": "PLPA3002",
    "subject": "PLPA",
    "number": "3002",
    "honors": false,
    "writing": false,
    "name": "Air Pollution, People & Plants",
    "fullname": "Air Pollution, People, and Plants: The Science and the Ethics",
    "info": "History of air pollution, its sources and types; global climate change; air pollution effects on human health, crops and forests; air pollution control and international perspective; risk perception and assessment; public ethics and decision making.",
    "prereq": {}
  },
  {
    "uid": "006935",
    "code": "PLPA3003",
    "subject": "PLPA",
    "number": "3003",
    "honors": false,
    "writing": false,
    "name": "Diseases: Forest & Shade Trees",
    "fullname": "Diseases of Forest and Shade Trees",
    "info": "This course provides an overview of tree diseases in urban and forested areas. It covers diseases that have had a significant impact on society such as Dutch Elm disease; oak wilt, chestnut blight, white pine blister rust, sudden oak death and many others. It also provides an overview of important cankers, leaf diseases, wilts, rusts, root rots and other tree problems. Laboratory sessions enable students to get hands-on experience identifying disease agents, examining symptoms and learning appropriate control procedures. Emphasis will also be placed on ecological processes, biological and cultural control, and host-parasite interactions. This course should be of value to anyone interested in biological sciences, natural resources or ecology. It is a must for individuals that will have a career in natural resources but should also be useful to those interested in maintaining healthy trees at home, in urban areas or woodlands. Alumni of the University working with trees or woody ornamentals indicate this is one of the most important courses you can take as a student.",
    "prereq": {}
  },
  {
    "uid": "827000",
    "code": "PLPA3004",
    "subject": "PLPA",
    "number": "3004",
    "honors": false,
    "writing": false,
    "name": "Microbes Sustain Crop Prod",
    "fullname": "Microbes for Sustainable Crop Production",
    "info": "Sustainable agricultural practices are crucial to address food security as climate change and the increasing world population continue to challenge food production. Several aspects of agricultural sustainability are important to achieve increased food production, including: maintaining soil fertility, managing water, and plant genetic resources, reducing the environmental impact of agriculture, and restoring degraded lands. To keep up with the growing food demand, there has been an increased use of fertilizers and pesticides in agriculture; however, these chemicals when used in large quantities harm the environment and limit the beneficial activities of plant-associated microbes. Millions of microorganisms live in soil and plants, and many of them have been shown to increase plant biomass without supplementary fertilizers or the use of pesticides to provide protection against plant pathogens. This course is designed for graduate and advanced undergraduate students interested in learning about beneficial soil microbes, how to identify such microbes, and how these microbes can be harnessed to improve the sustainability of our agricultural production systems.\n\nprereq: Knowledge of basic microbiology is required. Students enrolling for this course must complete, MICB 3301, BIOL 1961, or PLPA1005. Alternatively, students with junior standing with a completion of 60+ credits are also eligible. Graduate or undergraduate students who may have not taken either of the prerequisite courses listed above, but still wish to enroll, must talk to the instructor before enrolling.",
    "prereq": {}
  },
  {
    "uid": "015544",
    "code": "PLPA3090",
    "subject": "PLPA",
    "number": "3090",
    "honors": false,
    "writing": false,
    "name": "Research Plant Pathology",
    "fullname": "Research in Plant Pathology",
    "info": "Assignment of special problems to undergraduates desiring opportunity for independent research in plant pathology.",
    "prereq": {}
  },
  {
    "uid": "819503",
    "code": "PLPA3993",
    "subject": "PLPA",
    "number": "3993",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": " A course in which a student designs and carries out a directed study on selected topics or problems under the direction of a faculty member; eg, literature review. Directed study courses may be taken for variable credit and special permission is needed for enrollment.  Students enrolling in a directed study will be required to use the University-wide on-line directed study contract process in order to enroll.\n\nPrereq: department consent, instructor consent, no more than 6 credits of directed study counts towards CFANS major requirements.\n",
    "prereq": {}
  },
  {
    "uid": "006972",
    "code": "PLPA4000",
    "subject": "PLPA",
    "number": "4000",
    "honors": false,
    "writing": false,
    "name": "Plant Pathology Practicum",
    "fullname": "Plant Pathology Practicum",
    "info": "Analysis/identification of plant disease problems facing horticultural or agricultural enterprises. Developing procedures/practices that have the potential to improve existing programs for plant disease management in those businesses.",
    "prereq": {}
  },
  {
    "uid": "013163",
    "code": "PLPA4096",
    "subject": "PLPA",
    "number": "4096",
    "honors": false,
    "writing": false,
    "name": "PEP:Internship",
    "fullname": "Professional Experience Program: Internship",
    "info": "Supervised practicum with professional experience in plant pathology and related industries including the Plant Disease and \"Dial-U\" clinics. Evaluative reports and consultations with faculty advisers and employers.\n\nprereq: COAFES undergrad,  complete internship contract available in COAFES Career Services before registering; UC only",
    "prereq": {}
  },
  {
    "uid": "016116",
    "code": "PLPA5003",
    "subject": "PLPA",
    "number": "5003",
    "honors": false,
    "writing": false,
    "name": "Diseases of For & Shade Trees",
    "fullname": "Diseases of Forest and Shade Trees",
    "info": "This course provides an overview of tree diseases in urban and forested areas. It covers diseases that have had a significant impact on society such as Dutch Elm disease; oak wilt, chestnut blight, white pine blister rust, sudden oak death and many others. It also provides an overview of important cankers, leaf diseases, wilts, rusts, root rots and other tree problems. Laboratory sessions enable students to get hands-on experience identifying disease agents, examining symptoms and learning appropriate control procedures. Emphasis will also be placed on ecological processes, biological and cultural control, and host-parasite interactions. This course should be of value to anyone interested in biological sciences, natural resources or ecology. It is a must  or individuals that will have a career in natural resources but should also be useful to those interested in maintaining healthy trees at home, in urban areas or woodlands. Alumni of the University working with trees or woody ornamentals indicate this is one of the most important courses you can take as a student.",
    "prereq": {}
  },
  {
    "uid": "826608",
    "code": "PLPA5004",
    "subject": "PLPA",
    "number": "5004",
    "honors": false,
    "writing": false,
    "name": "Microbes Sustain Crop Prod",
    "fullname": "Microbes for Sustainable Crop Production",
    "info": "Sustainable agricultural practices are crucial to address food security as climate change and the increasing world population continue to challenge food production. Several aspects of agricultural sustainability are important to achieve increased food production, including; maintaining soil fertility, managing water, and plant genetic resources, reducing the environmental impact of agriculture, and restoring degraded lands. To keep up with the growing food demand, there has been an increased use of fertilizers and pesticides in agriculture; however, these chemicals when used in large quantities harm the environment and limit the beneficial activities of plant-associated microbes. Millions of microorganisms live in soil and plants, and many of them have been shown to increase plant biomass without supplementary fertilizers or the use of pesticides to provide protection against plant pathogens. This course is designed for graduate and advanced undergraduate students interested in learning about beneficial soil microbes, how to identify such microbes, and how these microbes can be harnessed to improve the sustainability of our agricultural production systems.",
    "prereq": {}
  },
  {
    "uid": "015545",
    "code": "PLPA5090",
    "subject": "PLPA",
    "number": "5090",
    "honors": false,
    "writing": false,
    "name": "Issues in Plant Pathology",
    "fullname": "Issues in Plant Pathology",
    "info": "See Class Schedule or department for current offerings.",
    "prereq": {}
  },
  {
    "uid": "818024",
    "code": "PLPA5100",
    "subject": "PLPA",
    "number": "5100",
    "honors": false,
    "writing": false,
    "name": "Topics in Plant Pathology",
    "fullname": "Topics in Plant Pathology",
    "info": "Topics in Plant Pathology",
    "prereq": {}
  },
  {
    "uid": "015862",
    "code": "PLPA5102",
    "subject": "PLPA",
    "number": "5102",
    "honors": false,
    "writing": false,
    "name": "Epid & Genetics Host-Parasite",
    "fullname": "Epidemiology and Genetics of Host-Parasite Interactions",
    "info": "Concepts/methodology in study of plant disease epidemics, host plant resistance, and host-parasite genetics. Disease assessment, epidemic progress models, environmental influences, crop loss assessment, disease forecasting, ecology of host-parasite. Environmentally sound management strategies. Use of resistance for disease control.",
    "prereq": {}
  },
  {
    "uid": "015929",
    "code": "PLPA5103",
    "subject": "PLPA",
    "number": "5103",
    "honors": false,
    "writing": false,
    "name": "Plant-Microbe Interactions",
    "fullname": "Plant-Microbe Interactions",
    "info": "Genetics, physiology, molecular biology of plant-microbe interactions. Communication between plant/microbes, signal transduction, control of gene expression, symbiosis/parasitism, plant host response mechanisms, plant disease physiology.\n\nprereq: Intro course in plant pathology or molecular biology or equiv",
    "prereq": {}
  },
  {
    "uid": "006605",
    "code": "PLPA5201",
    "subject": "PLPA",
    "number": "5201",
    "honors": false,
    "writing": false,
    "name": "Biology of Plant Diseases",
    "fullname": "Biology of Plant Diseases",
    "info": "Principles and concepts of plant disease caused by selected viruses, bacteria, fungi, nematodes, and environmental factors. Pathogen biology, interaction of pathogens and the environment; epidemiology and control measures appropriate to plant disease.  ",
    "prereq": {}
  },
  {
    "uid": "012701",
    "code": "PLPA5202",
    "subject": "PLPA",
    "number": "5202",
    "honors": false,
    "writing": false,
    "name": "Field Plant Pathology",
    "fullname": "Field Plant Pathology",
    "info": "Characteristics of a variety of plant diseases. Field trips to observe symptoms and effects of diseases and to learn about prevention and control of diseases in field, forest, golf course, greenhouse, nursery, orchard, and urban environments.",
    "prereq": {}
  },
  {
    "uid": "007042",
    "code": "PLPA5203",
    "subject": "PLPA",
    "number": "5203",
    "honors": false,
    "writing": false,
    "name": "Introduction to Fungal Biology",
    "fullname": "Introduction to Fungal Biology",
    "info": "Fungi are a critical component of the diversity and function of terrestrial ecosystems, affecting decomposition, plant nutrient uptake, and agricultural practices. Key components of fungal biology, including ecology, genetics, life cycles and diversity. Labs provide hands on experience with a diverse range of organisms.\n\nprereq: BIOL 1009 or equiv",
    "prereq": {
      "or": [
        "005416"
      ]
    }
  },
  {
    "uid": "789030",
    "code": "PLPA5204",
    "subject": "PLPA",
    "number": "5204",
    "honors": false,
    "writing": false,
    "name": "Plant Disease Management",
    "fullname": "Plant Disease Management",
    "info": "Principles of crop/pathogen biology, epidemiology, crop ecology, crop management practices that influence occurrence of plant disease. Interaction of crop management practices with plant disease. Strategies for controlling plant disease through management practices illustrated by examples from agronomic, horticultural, forest crops.",
    "prereq": {}
  },
  {
    "uid": "792713",
    "code": "PLPA5300",
    "subject": "PLPA",
    "number": "5300",
    "honors": false,
    "writing": false,
    "name": "Current Molec Plant Path",
    "fullname": "Current Topics in Molecular Plant Pathology",
    "info": "Current Topics in Molecular Plant Pathology is a highly interactive class in which students read, discuss, and critique pivotal publications in the field of molecular plant pathology. Specific topics will change from year to year, but will generally include subjects such as plant-microbe communication, diversity and evolution of plant-microbe associations, genomic analysis of pathogens (symbionts) and plant host responses, and mechanisms of pathogenicity. \n\nprereq: Introductory courses in plant pathology or microbiology; genetics; molecular biology or genomics; or consent of instructor",
    "prereq": {}
  },
  {
    "uid": "797183",
    "code": "PLPA5301",
    "subject": "PLPA",
    "number": "5301",
    "honors": false,
    "writing": false,
    "name": "Lg Scale Omic Data-Plant Bio",
    "fullname": "Large Scale Omic Data in Plant Biology",
    "info": "Introduction to large scale data in plant biology. Emphasizes model plants and important agricultural crops focusing on new approaches and technologies in the field. Fundamentals, acquisition, and analysis of high-throughput DNA and RNA sequencing, high-throughput plant phenotyping, functional and comparative genomics, epigenomics, proteomics, metabolomics, and microbiomics.\n\nprereq: Intro course in genetics or instr consent",
    "prereq": {}
  },
  {
    "uid": "792712",
    "code": "PLPA5302",
    "subject": "PLPA",
    "number": "5302",
    "honors": false,
    "writing": false,
    "name": "Genomics Plant-Assoc Micro",
    "fullname": "Genomics of Plant-Associated Microbes",
    "info": "Genomics research for plant-associated microbes. Journal articles, discussions, case studies. Identification/characterization of genes in plant-microbe interactions. Analysis of plant pathogens, research methodologies. Linkage/gene/physical mapping, candidate genes, sequencing, gene silencing, knock-out, ESTs, microarrays, bioinformatics. Online training modules, field trips, guest lectures, individual/group projects.",
    "prereq": {}
  },
  {
    "uid": "819020",
    "code": "PLPA5303",
    "subject": "PLPA",
    "number": "5303",
    "honors": false,
    "writing": false,
    "name": "Data Visualization",
    "fullname": "Data Visualization in Plant and Microbial Biology",
    "info": "Data Visualization in Plant and Microbial Biology is a course for graduate and advanced undergraduate students interested in developing skills to visualize common datasets in plant and microbial research. Students will learn fundamentals of data visualization and reproducibility that are common approaches to present plant and microbial biological data. The topics to be covered in the course are not limited to but can include fundamentals of proper data visualization techniques, principles of manuscript figure design, differences between manuscript, poster, presentation, and communication data visualizations, and how to ensure that analysis and visualizations are reproducible. The class will consist of lectures, discussions, group activities, and lots of hands-on learning and analysis. \n\nprereq: Limited experience with R software is recommended, but not required.",
    "prereq": {}
  },
  {
    "uid": "805130",
    "code": "PLPA5444",
    "subject": "PLPA",
    "number": "5444",
    "honors": false,
    "writing": false,
    "name": "Ecology of Plant-Microbe Inter",
    "fullname": "Ecology, Epidemiology, and Evolutionary Biology of Plant-Microbe Interactions",
    "info": "Microbes exist in close association with plants as pathogens, saprophytes, epiphytes, endophytes, and mutualists. This course will explore the intimate connections between the ecology, life history, evolutionary biology, and fitness of plants and their microbes. \nprereq: Intro plant pathology or advanced biology coursework recommended",
    "prereq": {}
  },
  {
    "uid": "805865",
    "code": "PLPA5480",
    "subject": "PLPA",
    "number": "5480",
    "honors": false,
    "writing": false,
    "name": "Principles of Plant Pathology",
    "fullname": "Principles of Plant Pathology",
    "info": "This course is intended for graduate students and undergraduate students in their third or fourth year that are interested in learning about principles of plant pathology, diseases that affect plants, microbiology and microbial and plant interactions.  In this course students will learn principles of plant pathology through lectures and demonstrations and exercises in laboratory.  Students will gain knowledge of mycology and select diseases caused by fungi within Ascomycota, Basidiomycota and the fungal-like Oomycota.  Diseases caused by bacteria, nematodes, viruses, parasitic plants and abiotic damage are also examined. Lectures will include information concerning the history and importance of plant pathology, mycology, bacteriology, nematology, virology, infection process, genetics of host and microorganism interactions, epidemiology of diseases and disease control strategies.  In the hands-on laboratory period the student will learn laboratory skills, gain experience using the microscope, work with microorganisms, learn diagnostic skills, and be able to recognize 30 plant diseases.    \n\nprereq: BIOL 1009 or equiv",
    "prereq": {
      "or": [
        "005416"
      ]
    }
  },
  {
    "uid": "807418",
    "code": "PLPA5660",
    "subject": "PLPA",
    "number": "5660",
    "honors": false,
    "writing": false,
    "name": "Plant Disease Resistance & App",
    "fullname": "Plant Disease Resistance and Applications",
    "info": "Fundamentals of disease resistance in plants and the genetics of host-parasite interactions as they relate to the sustainable control of plant diseases. Examples explored at the Mendelian, populational, and molecular level of organization.\n\nprereq: 2001, BIOL 4003",
    "prereq": {
      "and": [
        "006949",
        "009489"
      ]
    }
  },
  {
    "uid": "015543",
    "code": "PLPA5999",
    "subject": "PLPA",
    "number": "5999",
    "honors": false,
    "writing": false,
    "name": "Special Topics in Plant Pathol",
    "fullname": "Special Topics in Plant Pathology",
    "info": "Workshops on topics in plant pathology. See Class Schedule or department for current offerings.",
    "prereq": {}
  },
  {
    "uid": "797083",
    "code": "PLPA8005",
    "subject": "PLPA",
    "number": "8005",
    "honors": false,
    "writing": false,
    "name": "Supervised Teaching",
    "fullname": "Supervised Classroom or Extension Teaching Experience",
    "info": "Teaching experience in Plant Pathology. Discussions about effective teaching to strengthen skills and develop a personal teaching philosophy. \n\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "015546",
    "code": "PLPA8090",
    "subject": "PLPA",
    "number": "8090",
    "honors": false,
    "writing": false,
    "name": "Research and Internship",
    "fullname": "Research and Internship",
    "info": "Special assignment in lab or field problems in pathological research.  Opportunities to provide students with unique exposure to research in other environments, including private industries, federal agencies, other countries, or other universities. Because of their value to the graduate student experience, the Department of Plant Pathology will offer credit for internships of 3-12 weeks duration.\n",
    "prereq": {}
  },
  {
    "uid": "009187",
    "code": "PLPA8100",
    "subject": "PLPA",
    "number": "8100",
    "honors": false,
    "writing": false,
    "name": "Prof. Internship",
    "fullname": "Professional Internship Experience",
    "info": "Individually arranged internships in private industry, government agencies, or university outreach programs (including the University's Plant Disease Clinic).",
    "prereq": {}
  },
  {
    "uid": "009113",
    "code": "PLPA8101",
    "subject": "PLPA",
    "number": "8101",
    "honors": false,
    "writing": false,
    "name": "Causal Org  Pl Dis",
    "fullname": "Causal Organisms of Plant Disease",
    "info": "Laboratory-based intensive examination of bacteria, viruses, and nematodes as causal agents of plant disease.",
    "prereq": {}
  },
  {
    "uid": "009186",
    "code": "PLPA8102",
    "subject": "PLPA",
    "number": "8102",
    "honors": false,
    "writing": false,
    "name": "Epidem Genet Host-Par",
    "fullname": "Epidemiology and Genetics of Host-Parasite Interactions",
    "info": "Disease assessment, analysis in time/space, models for epidemic progress, environmental influences, crop loss assessment, disease forecasting, ecology of host-parasite interactions. Mendelian, populational, and molecular genetic aspects of host-parasite interactions. Modes of variability in pathogen populations, strategies for disease resistance.",
    "prereq": {}
  },
  {
    "uid": "010840",
    "code": "PLPA8103",
    "subject": "PLPA",
    "number": "8103",
    "honors": false,
    "writing": false,
    "name": "Plant-Microbe Interactions",
    "fullname": "Plant-Microbe Interactions",
    "info": "Genetics, physiology, and molecular biology of plant-microbe interactions. Communication between plants/microbes. Signal transduction, control of gene expression, symbiosis/parasitism, plant host response mechanisms, plant disease physiology.\n\nprereq: Intro course in plant pathology or molecular biology or equiv",
    "prereq": {}
  },
  {
    "uid": "806146",
    "code": "PLPA8104",
    "subject": "PLPA",
    "number": "8104",
    "honors": false,
    "writing": false,
    "name": "Plant Virology",
    "fullname": "Plant Virology",
    "info": "Characteristics, biology, epidemiology, and control of plant diseases caused by viruses.\n\nprereq: 5480",
    "prereq": {
      "and": [
        "805865"
      ]
    }
  },
  {
    "uid": "806147",
    "code": "PLPA8105",
    "subject": "PLPA",
    "number": "8105",
    "honors": false,
    "writing": false,
    "name": "Plant Bacteriology",
    "fullname": "Plant Bacteriology",
    "info": "Bacteria interact with plants in various ways depending upon environmental conditions, nutrient status, and host plant genotypes. The outcome of these interactions can result in the plant associated bacteria being pathogens, or mutualists. In the Plant Bacteriology course, we will examine several bacterial diseases in-depth to understand the disease cycles, epidemiology, mechanisms of pathogenesis, beneficial microbes, and means of disease control. The laboratory section will focus on techniques used to identify bacteria, for inoculating plants, isolating bacteria from plant material, and methods to understand the plant-bacterial interactions. The first hour of most class sessions will consist primarily of lectures by the instructor followed by group discussion of assigned readings. Laboratory sessions will occur for 90 minutes and are designed to illustrate concepts presented during the lecture/discussion sessions. \n\nprereq: 5480",
    "prereq": {
      "and": [
        "805865"
      ]
    }
  },
  {
    "uid": "792815",
    "code": "PLPA8123",
    "subject": "PLPA",
    "number": "8123",
    "honors": false,
    "writing": false,
    "name": "Ethics Training",
    "fullname": "Research Ethics in Plant and Environmental Sciences",
    "info": "Ethics training to graduate students enrolled in plant/environmental graduate research programs and fulfill requirement for training in responsible conduct of research. prereq: Enrolled in a plant/environmental grad research program",
    "prereq": {}
  },
  {
    "uid": "009185",
    "code": "PLPA8200",
    "subject": "PLPA",
    "number": "8200",
    "honors": false,
    "writing": false,
    "name": "Plant Pathology Seminar",
    "fullname": "Plant Pathology Seminar",
    "info": "Students enrolled in PlPa 8200 will gain experience and expertise in the area of oral scientific communication.  Through participation in a regular departmental seminar series, students will be exposed to a variety of seminar preparation and presentation techniques.  Working one-on-one with a Seminar Advisor and the course Instructor, students will select and appropriately define a seminar topic, identify pertinent literature, prepare an effective abstract, and prepare and present a public seminar on the selected topic.  Students will further interact with classmates and other participants in the departmental seminar series through public question and answer periods and by moderating individual seminar sessions.  PlPA 8200 will be conducted in hybrid format, providing opportunities for in person and online (Zoom) participation in a synchronous manner.",
    "prereq": {}
  },
  {
    "uid": "009184",
    "code": "PLPA8300",
    "subject": "PLPA",
    "number": "8300",
    "honors": false,
    "writing": false,
    "name": "Plant Path Proj.",
    "fullname": "Plant Pathology Project",
    "info": "Laboratory or library projects for Plan B master's students in plant pathology.",
    "prereq": {}
  },
  {
    "uid": "792816",
    "code": "PLPA8302",
    "subject": "PLPA",
    "number": "8302",
    "honors": false,
    "writing": false,
    "name": "Genomics Plant-Assoc Micro",
    "fullname": "Genomics of Plant-associated Microbes",
    "info": "Identification/characterization of genes involved in plant-microbe interactions. Genome analysis of plant pathogens. Innovative research methodologies. Linkage/gene/physical mapping. Identification of candidate genes. Genome sequencing, gene silencing, knock-out, ESTs/microarrays, bioinformatics. Online training modules. Field trips. Guest lectures. Individual/group projects. Journal articles, case studies.",
    "prereq": {}
  },
  {
    "uid": "788262",
    "code": "PLPA8333",
    "subject": "PLPA",
    "number": "8333",
    "honors": false,
    "writing": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)\n\nprereq: Master's student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "009188",
    "code": "PLPA8400",
    "subject": "PLPA",
    "number": "8400",
    "honors": false,
    "writing": false,
    "name": "Case Studies PlPath",
    "fullname": "Case Studies in Plant Pathology",
    "info": "Students develop case study of recent or historical plant disease epidemic; research scientific, economic, regulatory, social, and environmental issues associated with the epidemic; and prepare written paper and present final case summary to the department.",
    "prereq": {}
  },
  {
    "uid": "788402",
    "code": "PLPA8444",
    "subject": "PLPA",
    "number": "8444",
    "honors": false,
    "writing": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)\n\nprereq: Doctoral student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "009183",
    "code": "PLPA8500",
    "subject": "PLPA",
    "number": "8500",
    "honors": false,
    "writing": false,
    "name": "Perspectives PlPath",
    "fullname": "Perspectives in Plant Pathology",
    "info": "Integrative overview of the field. For Ph.D. students nearing end of formal classroom experience.",
    "prereq": {}
  },
  {
    "uid": "788515",
    "code": "PLPA8666",
    "subject": "PLPA",
    "number": "8666",
    "honors": false,
    "writing": false,
    "name": "Doct Pre-Thesis Cr",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "TBD\n\nprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": {}
  },
  {
    "uid": "788643",
    "code": "PLPA8777",
    "subject": "PLPA",
    "number": "8777",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": {}
  },
  {
    "uid": "787923",
    "code": "PLPA8888",
    "subject": "PLPA",
    "number": "8888",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": {}
  }
]