[
  {
    "uid": "827226",
    "code": "PLSC1914",
    "subject": "PLSC",
    "number": "1914",
    "honors": false,
    "writing": false,
    "name": "Norman Borlaug",
    "fullname": "Seeds of Innovation: Norman Borlaug's Nobel-Winning Impact on World Hunger",
    "info": "In this course, students will examine the life and accomplishments of one of CFANS most notable and impactful alumni, Dr. Norman Borlaug, who was awarded the Nobel Peace Prize in 1970. He is credited with saving more than one billion people from starvation through the development of semi-dwarf, stem rust resistant wheat varieties as part of what became known as the Green Revolution. He later was awarded the Presidential Medal of Freedom, and the Congressional Gold Medal, making him one of only five people to receive all these awards, the others being Martin Luther King, Jr., Nelson Mandela, Elie Wiesel, and Mother Teresa. In addition to learning about his extraordinary accomplishments in his fields of science, namely plant breeding and plant pathology, students will learn of his many struggles and the perseverance required to achieve his vision of food security. You will explore the roles of the fields of agronomy, plant breeding, plant pathology, agricultural economics, food policy, and politics in achieving Dr. Borlaug’s vision and the role of these disciplines in feeding the world today. In addition, you’ll have the opportunity to interact with individuals from around the world who have been inspired by his work and continue his efforts through their own research and discovery.",
    "prereq": {}
  },
  {
    "uid": "818054",
    "code": "PLSC3002",
    "subject": "PLSC",
    "number": "3002",
    "honors": false,
    "writing": false,
    "name": "Seed Sci, Technology, Society",
    "fullname": "Seed Science, Technology, and Society",
    "info": "Cultivate an understanding of seed and appreciation for seed with respect to agriculture. Focus of this course will be on agronomic crop seeds produced in the upper Midwest.\n\nprereq: HORT 1001 or BIOL 1009 or BIOL 2002 or consent of the instructor",
    "prereq": {
      "or": [
        "007885",
        "005416",
        "800456"
      ]
    }
  },
  {
    "uid": "007662",
    "code": "PLSC3005W",
    "subject": "PLSC",
    "number": "3005",
    "honors": false,
    "writing": true,
    "name": "Intro to Plant Physiology",
    "fullname": "Introduction to Plant Physiology",
    "info": "Introduction to physiological basis for effects of environment on plant growth/development. How to produce optimal plant growth. Experimental technique, data analysis, scientific writing. Lecture, readings, lab. \n\nprereq: [Biol 1009 or Hort 1001] and [HORT 2121 or BioC 3021 or BioC 2011]",
    "prereq": {
      "and": [
        {
          "or": [
            "005416",
            "007885"
          ]
        },
        {
          "or": [
            "801927",
            "014290",
            "788203"
          ]
        }
      ]
    }
  },
  {
    "uid": "819501",
    "code": "PLSC3093",
    "subject": "PLSC",
    "number": "3093",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "A course in which a student designs and carries out a directed study on selected topics or problems under the direction of a faculty member, e.g., literature review. Directed study courses may be taken for variable credit, and special permission is needed for enrollment.  Students enrolling in a directed study will be required to use the University-wide on-line directed study contract process in order to enroll.\n \nInstructor consent required. For more information, see the Directed Studies Information on the Horticultural Science website. No more than 6 credits of directed study counts towards CFANS major requirements.",
    "prereq": {}
  },
  {
    "uid": "819502",
    "code": "PLSC3094",
    "subject": "PLSC",
    "number": "3094",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "An opportunity in which a student designs and carries out a directed research project under the direction of a faculty member. Directed research may be taken for variable credit and special permission is needed for enrollment. Students enrolling in a directed research will be required to use the\nUniversity-wide online directed research contract process in order to enroll.\n \nInstructor consent required. For more information, see the Directed Studies Information on the Horticultural Science website. No more than 6 credits of directed study counts towards CFANS major requirements.",
    "prereq": {}
  },
  {
    "uid": "817103",
    "code": "PLSC3401",
    "subject": "PLSC",
    "number": "3401",
    "honors": false,
    "writing": false,
    "name": "Plant Genetics and Breeding",
    "fullname": "Plant Genetics and Breeding",
    "info": "Principles of plant genetics and environmental variation. Applications of genetics to crop evolution and breeding of self-pollinated, cross-pollinated, and asexually propagated crops. Investigation of hybridization, variation, and selection.",
    "prereq": {}
  },
  {
    "uid": "826789",
    "code": "PLSC4096W",
    "subject": "PLSC",
    "number": "4096",
    "honors": false,
    "writing": true,
    "name": "Professional Exp Internship",
    "fullname": "Professional Experience Internship",
    "info": "Supervised professional experience with a private company, public agency, or non-profit organization involved in plant production or food systems. Reflective analysis of professional experience and technical communication on a topic related to the internship. There will be several scheduled meetings on campus, along with asynchronous meetings, coursework, and activities.",
    "prereq": {}
  }
]