[
  {
    "uid": "004602",
    "code": "PMB1212",
    "subject": "PMB",
    "number": "1212",
    "honors": false,
    "writing": false,
    "name": "Plant Biotechnology & Society",
    "fullname": "Plant Biotechnology and Society",
    "info": "Importance of plants to humans. How human interaction with plants has profoundly affected human societies, how human technology has changed our interaction with plants and affected the environment. Development of transgenic plants. Biofuels.",
    "prereq": {}
  },
  {
    "uid": "005418",
    "code": "PMB2022",
    "subject": "PMB",
    "number": "2022",
    "honors": false,
    "writing": false,
    "name": "General Botany",
    "fullname": "General Botany",
    "info": "Introduction to the biology of plants, algae, and fungi. Structure, growth, development, reproduction, diversity, and aspects of their ecology. Includes laboratory that focuses on structures in photosynthetic organisms and fungi as well as an introduction to physiology. This course has no prerequisites, however one semester of college biology will be helpful for understanding the course content.",
    "prereq": {}
  },
  {
    "uid": "014292",
    "code": "PMB3002",
    "subject": "PMB",
    "number": "3002",
    "honors": false,
    "writing": false,
    "name": "Plant Function",
    "fullname": "Plant Biology: Function",
    "info": "This course explores a range of plant physiological processes, including how plants make and use food; acquire and use minerals; transport water and nutrients; and regulate growth and development in response to hormones and environmental cues, such as light quality.\n\nWhile this course is paired with the PMB 3005W Plant Function Laboratory, the courses do not need to be taken together or in a specific order.\n\nprereq: [1002 or 1009 or 2003 or equiv], [CHEM 1011 or one semester chemistry with some organic content]",
    "prereq": {
      "and": [
        {
          "or": [
            "002383"
          ]
        }
      ]
    }
  },
  {
    "uid": "014293",
    "code": "PMB3005W",
    "subject": "PMB",
    "number": "3005",
    "honors": false,
    "writing": true,
    "name": "Plant Function Laboratory",
    "fullname": "Plant Function Laboratory",
    "info": "In this lab course, students will use a variety of biological techniques to study plant structure and anatomy, plant physiology, cell biology, and plant growth. This includes topics related to climate change, plant adaptation, crop domestication, and genetic engineering. Includes hands-on laboratory activities and writing focus. While this course is paired with the PMB3002 lecture course, the courses do not need to be taken together or in a specific order. \n\nPrereq: BIOL 1009, BIOL 2003, or equiv.",
    "prereq": {}
  },
  {
    "uid": "014291",
    "code": "PMB3007W",
    "subject": "PMB",
    "number": "3007",
    "honors": false,
    "writing": true,
    "name": "Plant, Algal, Fungal Diversity",
    "fullname": "Plant, Algal, and Fungal Diversity and Adaptation",
    "info": "Evolution/Ecology/Diversity of plants, fungi, and algae. Lectures highlight phylogenetic diversity among and within multiple eukaryotic groups as well as adaptations and strategies for survival in varied environments. Includes both hands-on laboratory activities and writing focus.\n\nprereq: One semester college biology",
    "prereq": {}
  },
  {
    "uid": "818555",
    "code": "PMB3212",
    "subject": "PMB",
    "number": "3212",
    "honors": false,
    "writing": false,
    "name": "Fungi - A Kingdom of Their Own",
    "fullname": "Fungi - A Kingdom of Their Own",
    "info": "No matter how you classify life on Earth, the fungi are in a Kingdom of their own. Latest estimates of the number of fungal species on our planet are between 2.2 and 3.8 million species. The diversity of single-celled and multi-cellular fungi is staggering, the result of divergence within a group of aquatic eukaryotes one billion years ago (± 500 million years). That divergence ultimately gave rise to animals and fungi, but the diversification within the fungal lineages is unrivaled. They can be found in aerobic and anaerobic environments. They are found on every Continent, recycling and reallocating vast amounts of nutrients in every Biome. They cause problems in crops but are also used to make food, with ancient processes such as fermentation and mushroom cultivation. For these reasons, mycology (study of fungi) is increasingly popular among students with interests as diverse as their fungal subjects. With the advent of high-throughput DNA sequencing to sample entire communities, we are seeing fungi in all of these places where they were previously invisible. The fungal role in Earth's most critical processes is, right now, coming into light. It is an exciting time to study Kingdom Fungi.\n\nThis course uses a format of lecture, discussion, and field trips to provide undergraduate and graduate students with a solid foundation in the fungi, primarily through an environmental lens. Undergraduate and graduate students will learn the basics of fungi in three core sections: 1) Phylogeny, taxonomy, and diagnostics (Who are the fungi?); 2) Morphology and physiology (How do fungi work?); 3) Ecology and Biotechnology (What are fungal implications and applications?). Within each core section, there will be one class period devoted to a discussion of the environment, the role of fungi, and the human dimensions of conservation and management. This discussion will be used by the class to vote for an environmental theme used to frame writing assignments, one per unit. Using this theme, all students will create a \"Fungus in Focus\" one-page \"brief\" focused on this environmental issue. This is a creative way to connect \"dots\" for students linking microbial processes to environment, in our case harnessing connections to fungi that often have visible characters (e.g. mushrooms) that make those connections easier for students. We will also go on two field trips, one to a mushroom cultivation facility, and one into the field in April, all depending on class size and weather.\n\nprereq: Introductory Biology course ",
    "prereq": {}
  },
  {
    "uid": "817590",
    "code": "PMB3500",
    "subject": "PMB",
    "number": "3500",
    "honors": false,
    "writing": false,
    "name": "Topics in Plant Biology",
    "fullname": "Special Topics in Plant Biology",
    "info": "Special Topics in Plant Biology - This is a topics shell",
    "prereq": {}
  },
  {
    "uid": "818681",
    "code": "PMB3701",
    "subject": "PMB",
    "number": "3701",
    "honors": false,
    "writing": false,
    "name": "PMB Seminar",
    "fullname": "PMB Seminar",
    "info": "Develop professional oral communication skills through the attendance and evaluation of biological science public seminars, the construction and presentation of a professional public seminar, and the introduction of a student seminar speaker. prereq: BIOL 3004/3004H.",
    "prereq": {
      "or": [
        "802140"
      ]
    }
  },
  {
    "uid": "818685",
    "code": "PMB3802",
    "subject": "PMB",
    "number": "3802",
    "honors": false,
    "writing": false,
    "name": "Field Microbiology",
    "fullname": "Field Microbiology at Itasca Biological Research Station",
    "info": "The microbial world is incredibly diverse: there are estimated to be more microbial cells on Earth than stars in the entire universe. Much of our understanding in microbiology derives from studies of pure cultures; organisms that can easily be grown in the lab. However, it is now clear that the vast majority of microorganisms in nearly every environment are not\nreadily grown under laboratory conditions. We must therefore go to them. Field Microbiology will be a three-week intensive course where students will be taught methods of environmental microbiology in both lecture and laboratory format. The goal is to not only quantify who is in a given sample, but also to understand something about the conditions\nthey live in (temperature, nutrient availability, etc.). Ecological data and microbial community structure will be generated using Oxford Nanopore sequencing technology – a cutting edge method to generate large sequencing datasets in real-time. Analyses will be integrated with an in situ set of field instrumentation that includes an eddy covariance system for quantifying fluxes of methane and carbon dioxide from Lake Itasca and Elk Lake, as well as in-lake measurements of solar radiation, dissolved organic matter, pH, conductivity, temperature, dissolved oxygen and chlorophyll. A series of field trips will be scheduled to locations in and around Itasca State Park including Elk Lake, Arco Lake, Iron Springs Bog and Lake Alice Spring. Students will also develop an independent research project that will apply methods learned during the first 1.5 weeks of the course.",
    "prereq": {}
  },
  {
    "uid": "818717",
    "code": "PMB3812",
    "subject": "PMB",
    "number": "3812",
    "honors": false,
    "writing": false,
    "name": "Field Mycology",
    "fullname": "Field Mycology",
    "info": "This class focuses on learning about how to study fungi. Students will gain experience identifying mushrooms and other samples collected during course field trips using macromorphological, microscopic, and molecular techniques. In addition, students will isolate fungi from environmental samples and maintain cultures as well as assess fungal community abundance and composition using both traditional (e.g., root tip colonization) and DNA-based methods (e.g., next-generation sequencing, bioinformatics, and ecological statistics). Course lectures highlight different aspects of fungal diversity (taxonomic, physiological, and ecological) and lab exercises provide hands-on practice. Course writing assignments and presentations emphasize exploring the natural history of fungi as well as critically assessing primary research literature. Permission is required for undergraduates to enroll in the graduate level of this course (PMB 5812); inquire with the instructor.",
    "prereq": {}
  },
  {
    "uid": "008660",
    "code": "PMB4111",
    "subject": "PMB",
    "number": "4111",
    "honors": false,
    "writing": false,
    "name": "Microbial Physiology/Diversity",
    "fullname": "Microbial Physiology and Diversity",
    "info": "Structural/functional organization of bacteria/archaea. Energy metabolism utilizing light, inorganic/organic chemicals. Cell morphologies, roles/assembly of surface structures. Growth/survival mechanisms in various extreme environments. Adaptation to changing conditions by development of specialized cells/structures, altering metabolic patterns. prereq: MicB 3301 or MicB 3303 required; BioC 3021 or BioC 4331 recommended",
    "prereq": {
      "or": [
        "008659",
        "805299",
        "014290",
        "002945"
      ]
    }
  },
  {
    "uid": "792282",
    "code": "PMB4121",
    "subject": "PMB",
    "number": "4121",
    "honors": false,
    "writing": false,
    "name": "Microbial Ecology & Appl Micro",
    "fullname": "Microbial Ecology and Applied Microbiology",
    "info": "Evolution/structure of microbial communities. Population interaction within ecosystems. Quantitative/habitat ecology. Biogeochemical cycling. Molecular microbial ecology, gene transfer in the environment. Molecular phylogeny of microorganisms. Application of microbes in agriculture. Production of commodity chemicals, drugs, and other high-value products. \n\nprereq: BIOL 1009, BIOL 1951 or equivalent.",
    "prereq": {
      "or": [
        "005416",
        "817196"
      ]
    }
  },
  {
    "uid": "819125",
    "code": "PMB4131",
    "subject": "PMB",
    "number": "4131",
    "honors": false,
    "writing": false,
    "name": "Prokaryotic Genetics",
    "fullname": "Prokaryotic Genetics",
    "info": "Genetics is the application of abstractions to understand biological function. Much of our understanding at the molecular level of the natural world is derived from genetic work in model microbial systems like Escherichia coli, Salmonella, and Saccharomyces. Prokaryotic Genetics will focus on a molecular understanding of bacteria, with a smattering of archaea and phage genetics, covering both classic (transposons, mutant/suppressors) and modern (sequencing, metagenomics, synthetic biology) genetic approaches.",
    "prereq": {}
  },
  {
    "uid": "010632",
    "code": "PMB4321",
    "subject": "PMB",
    "number": "4321",
    "honors": false,
    "writing": false,
    "name": "Minnesota Flora",
    "fullname": "Minnesota Flora",
    "info": "Practical skills for identifying plant species/surveying Minnesota vegetation to students of biology, environmental sciences, resource management, horticulture. Integrates botany, ecology, evolution, earth history, climate, global change in context of local plant communities. Labs/Saturday field trips explore Minnesota plants/plant communities.\n\nprereq: One semester college biology",
    "prereq": {}
  },
  {
    "uid": "005010",
    "code": "PMB4404",
    "subject": "PMB",
    "number": "4404",
    "honors": false,
    "writing": false,
    "name": "Plant Anatomy",
    "fullname": "Developmental Plant Anatomy",
    "info": "Introduction to the microscopic structure and development of plants at the cell, tissue, and organ level. Emphasis on relationships between anatomy and the ontogeny, phylogeny, and ecology of seed plants with some reference to lower vascular plants.\n\nprereq: Biol 2022 or Biol 3007",
    "prereq": {}
  },
  {
    "uid": "814244",
    "code": "PMB4412",
    "subject": "PMB",
    "number": "4412",
    "honors": false,
    "writing": false,
    "name": "Plant Physiology & Development",
    "fullname": "Plant Physiology and Development",
    "info": "Plant physiology and development is the study of how plant cells, tissues, and whole organisms grow and function in response to internal and external cues. PMB 4412/5412 covers the classic plant physiology and development processes including plant water relations, mineral nutrition, membrane transport, photosynthesis, respiration, vascular function, metabolism, growth and development, and hormone responses. The physics underlying our understanding of these physiological systems will also be addressed. Other areas of plant science such as plant genetics and biochemistry are covered in other courses and will not be emphasized this course. \n\nThere are no enforced prerequisites for this course. \n\nThe following preparation is recommended: PMB 2022 General Botany or PMB 3007W Plant Algal and Fungal Diversity; General Chemistry and Introductory Physics.",
    "prereq": {
      "or": [
        "005418",
        "014291"
      ]
    }
  },
  {
    "uid": "008803",
    "code": "PMB4511",
    "subject": "PMB",
    "number": "4511",
    "honors": false,
    "writing": false,
    "name": "Flowering Plant Diversity",
    "fullname": "Flowering Plant Diversity",
    "info": "Flowering plants occupy every continent on Earth and support us in countless ways. Observing plant diversity from around the world provides us powerful insights and practical tools to students in the natural sciences and humanities. This course has two main objectives: getting to know major groups of flowering plants and using the tools of comparative biology to learn from nature. Labs, tours, online learning, group exercises, and optional field trips emphasize hands-on experience in diverse settings. Ethnobotany, plant form & function, development, ecology, taxonomy and phytochemistry are presented in an evolutionary context. \n\nprereq: BIOL 1001 or BIOL 1001H or BIOL 1009 or BIOL 1009H or BIOL 1951 or BIOL 1951H or BIOL 2003 or BIOL 2003H.",
    "prereq": {
      "or": [
        "005419",
        "005416",
        "817196",
        "800457"
      ]
    }
  },
  {
    "uid": "794309",
    "code": "PMB4516W",
    "subject": "PMB",
    "number": "4516",
    "honors": false,
    "writing": true,
    "name": "Plant Cell Biology",
    "fullname": "Plant Cell Biology: Writing Intensive",
    "info": "In this course, we will cover current important research topics in plant cell biology. We will cover many plant-specific topics such as gravitropism, plant cell wall biosynthesis, structure and function, plasmodesmatal connections, signal transduction, tip growth, plant cytokinesis, cell energetics. We will also cover some topics that are important for both plant, fungal, and animal cell biology such as cell polarity, the cytoskeleton, protein sorting, and the secretory system. Since we will be using recent literature as the course text, some important and classic cell biology topics will not be covered. In the field of cell biology, new discoveries are often the result of improvements in technology especially in imaging, so we will cover some recent advances in methodology. This is also a writing class with the goal of helping students become familiar and comfortable with writing in a scientific style. There will be writing instruction and there will be some reading assignments on scientific writing. \n\nThere are no enforced prerequisites. Introductory courses on plants, genetics, and biochemistry are helpful.",
    "prereq": {}
  },
  {
    "uid": "798970",
    "code": "PMB4601",
    "subject": "PMB",
    "number": "4601",
    "honors": false,
    "writing": false,
    "name": "Topics in Plant Biochemistry",
    "fullname": "Topics in Plant Biochemistry",
    "info": "Biochemical analysis of processes unique to photosynthetic organisms. Photosynthesis and carbon dioxide fixation.  Synthesis of carbohydrates, lipids, and derivatives. Aromatic compounds such as lignin, other natural products.  Functions of natural products.\n\nprereq: [BIOL 1002 or BIOL 1009 or BIOL 2003], CHEM 2301",
    "prereq": {
      "and": [
        {
          "or": [
            "005420",
            "005416",
            "800457"
          ]
        },
        "002392"
      ]
    }
  },
  {
    "uid": "788856",
    "code": "PMB4793W",
    "subject": "PMB",
    "number": "4793",
    "honors": false,
    "writing": true,
    "name": "Directed Studies: WI",
    "fullname": "Directed Studies: Writing Intensive",
    "info": "Writing Intensive Directed Studies is an individual-study, literature-based investigation in which the student is mentored directly by a faculty member. One main feature of this course is that the student will receive writing instruction and the written output of the course will be revised during the semester. The project needs to be explained in a research/directed studies contract and agreed on by both the student and faculty mentor. The contract must be approved by the director of undergraduate studies (DUGS) for the major before the student is allowed to register. The contract includes a description of learning objectives for the course, how writing instruction will take place, a timeline for when student writing will be handed in and how it will be assessed, methodology to be used by the student, and how assessment of learning will be conducted by the mentor. Additional oversight is established for this course near the end of the semester the written output is submitted to the DUGS for the major. The DUGS is responsible to determine that the writing meets standards set by the CBS Education Policy Committee for quality of writing, appropriate citation of literature, well-constructed figures, tables, and legends (if present), appropriate use and interpretation of statistics (if present), conclusions that are supported by evidence, and well-formatted references. This course is graded S/N and approval of the DUGS is required before a grade of S can be given by the faculty mentor. prereq: department consent, instructor consent, no more than 7 credits of 4793W, 4794W, 4993, 4994 counts towards CBS major requirements.\n",
    "prereq": {
      "or": [
        "788856",
        "788857",
        "013642",
        "013643"
      ]
    }
  },
  {
    "uid": "788857",
    "code": "PMB4794W",
    "subject": "PMB",
    "number": "4794",
    "honors": false,
    "writing": true,
    "name": "Directed Research: WI",
    "fullname": "Directed Research: Writing Intensive",
    "info": "Writing Intensive Directed Research is an individual-study, laboratory or field research experience in which the student is mentored directly by a faculty member. This course is not for students starting out in research. It is intended for students who already have been working in the research group of the mentor and have developed an independent research project. In this course the student will receive writing instruction through a writing support course (corresponding to 1 credit in addition to the credits of directed research time) that will meet weekly throughout the semester. The written output usually is in the form of a scientific paper describing the results of the student's project. Written output of the course must be revised during the semester and a schedule for writing, assessment, and revision needs to be in place at the beginning of the semester. The project needs to be explained in the campus Directed Research contract and the project and participation in the writing support course agreed on by both the student and faculty mentor. The contract must be approved by the Director of Undergraduate Studies (DUGS) for the major before the student is allowed to register. The contract includes a description of learning objectives for the course, agreement about how writing instruction will take place, confirmation of understanding of the timeline for when student writing will be handed in and how it will be assessed, methodology to be used by the student, and how assessment of learning will be conducted by the mentor. Additional oversight is established for this course - near the end of the semester the written output is submitted to the DUGS for the major. The DUGS is responsible to determine that the writing meets standards set by the CBS Education Policy Committee for quality of writing, appropriate citation of literature, well-constructed figures, tables, and legends (if present), appropriate use and interpretation of statistics (if present), conclusions that are supported by evidence, and well-formatted references. The DUGS can call for a final revision before a grade is given. This course is graded S/N by the writing support course instructor, and approval of both the DUGS and the research mentor is required before a grade of S can be given by the writing support course instructor.\n\nThis course is for non-Honors students. Students should register for the number of research credits they intend to pursue plus 1 cr for the writing support component (for example: 2-4 cr of research + 1 cr writing support = 3-5 cr).\n\nprereq: department consent, instructor consent, no more than a total of 7 credits of 4793W, 4794W, 4993, 4994 combined can count towards CBS major requirements.\n",
    "prereq": {
      "or": [
        "788856",
        "788857",
        "013642",
        "013643"
      ]
    }
  },
  {
    "uid": "013642",
    "code": "PMB4993",
    "subject": "PMB",
    "number": "4993",
    "honors": false,
    "writing": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "Directed Studies is an individual-study, literature-based investigation in which the student is mentored directly by a faculty member. The topic for the course needs to be explained in a research/directed studies contract and agreed on by both the student and faculty mentor. The contract must be approved by the director of undergraduate studies (DUGS) for the major before the student is allowed to register. The contract includes a description of learning objectives for the course, methodology to be used, and how the assessment of learning will be conducted. prereq: department consent, instructor consent, no more than 7 credits of 4793W, 4794W, 4993, 4994 counts towards CBS major requirements.",
    "prereq": {
      "or": [
        "788856",
        "788857",
        "013642",
        "013643"
      ]
    }
  },
  {
    "uid": "013643",
    "code": "PMB4994",
    "subject": "PMB",
    "number": "4994",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "Directed Research is an individual-study, laboratory, or field investigation course. The research topic needs to be agreed on by both the student and the faculty mentor and explained in a research/directed studies contract. The contract must be approved by the director of undergraduate studies (DUGS) for the major before the student is allowed to register. The contract includes a description of learning objectives for the course, methodology to be used, and how the assessment of learning will be conducted. prereq: department consent, instructor consent, no more than 7 credits of 4793, 4794, 4993W, 4994W counts towards CBS major requirements.\n",
    "prereq": {
      "or": [
        "788856",
        "788857"
      ]
    }
  },
  {
    "uid": "013765",
    "code": "PMB5109",
    "subject": "PMB",
    "number": "5109",
    "honors": false,
    "writing": false,
    "name": "Fungal Biology",
    "fullname": "Current Questions in Fungal Biology",
    "info": "Diversity of fungi and their interactions with other organisms. Pathogenic/mutualistic interactions with animals/plants. Use of fungal systems for drug discovery and understanding pathogenicity, signal transduction, morphogenesis, and evolution. ",
    "prereq": {}
  },
  {
    "uid": "817117",
    "code": "PMB5111",
    "subject": "PMB",
    "number": "5111",
    "honors": false,
    "writing": false,
    "name": "Microbial Physiology/Diversity",
    "fullname": "Microbial Physiology and Diversity",
    "info": "Structural/functional organization of bacteria/archaea. Energy metabolism utilizing light, inorganic/organic chemicals. Cell morphologies, roles/assembly of surface structures. Growth/survival mechanisms in various extreme environments. Adaptation to changing conditions by development of specialized cells/structures, altering metabolic patterns.",
    "prereq": {}
  },
  {
    "uid": "820232",
    "code": "PMB5131",
    "subject": "PMB",
    "number": "5131",
    "honors": false,
    "writing": false,
    "name": "Prokaryotic Genetics",
    "fullname": "Prokaryotic Genetics",
    "info": "Genetics is the application of abstractions to understand biological function. Much of our understanding at the molecular level of the natural world is derived from genetic work in model microbial systems like Escherichia coli, Salmonella, and Saccharomyces. Prokaryotic Genetics will focus on a molecular understanding of bacteria, with a smattering of archaea and phage genetics, covering both classic (transposons, mutant/suppressors) and modern (sequencing, metagenomics, synthetic biology) genetic approaches. prereq.: Introductory microbiology course.",
    "prereq": {}
  },
  {
    "uid": "818289",
    "code": "PMB5212",
    "subject": "PMB",
    "number": "5212",
    "honors": false,
    "writing": false,
    "name": "Fungi - A Kingdom of Their Own",
    "fullname": "Fungi - A Kingdom of Their Own",
    "info": "No matter how you classify life on Earth, the fungi are in a Kingdom of their own. Latest estimates of the number of fungal species on our planet are between 2.2 and 3.8 million species. The diversity of single-celled and multi-cellular fungi is staggering, the result of divergence within a group of aquatic eukaryotes one billion years ago (± 500 million years). That divergence ultimately gave rise to animals and fungi, but the diversification within the fungal lineages is unrivaled. They can be found in aerobic and anaerobic environments. They are found on every Continent, recycling and reallocating vast amounts of nutrients in every Biome. They cause problems in crops but are also used to make food, with ancient processes such as fermentation and mushroom cultivation. For these reasons, mycology (study of fungi) is increasingly popular among students with interests as diverse as their fungal subjects. With the advent of high-throughput DNA sequencing to sample entire communities, we are seeing fungi in all of these places where they were previously invisible. The fungal role in Earth's most critical processes is, right now, coming into light. It is an exciting time to study Kingdom Fungi.\n\nThis course uses a format of lecture, discussion, and field trips to provide undergraduate and graduate students with a solid foundation in the fungi, primarily through an environmental lens. Undergraduate and graduate students will learn the basics of fungi in three core sections: 1) Phylogeny, taxonomy, and diagnostics (Who are the fungi?); 2) Morphology and physiology (How do fungi work?); 3) Ecology and Biotechnology (What are fungal implications and applications?). Within each core section, there will be one class period devoted to a discussion of the environment, the role of fungi, and the human dimensions of conservation and management. This discussion will be used by the class to vote for an environmental theme used to frame writing assignments, one per unit. Using this theme, all students will create a Fungus in Focus one-page brief focused on this environmental issue. This is a creative way to connect dots for students linking microbial processes to the environment, in our case harnessing connections to fungi that often have visible characters (e.g. mushrooms) that make those connections easier for students. We will also go on two field trips, one to a mushroom cultivation facility, and one into the field in April, all depending on class size and weather.\n",
    "prereq": {}
  },
  {
    "uid": "016162",
    "code": "PMB5301",
    "subject": "PMB",
    "number": "5301",
    "honors": false,
    "writing": false,
    "name": "Plant Genomics",
    "fullname": "Plant Genomics",
    "info": "Introduction to genomics. Emphasizes plants and relevant model organisms. DNA marker/sequencing technology, comparative genomics, whole genome sequencing, DNA chips/microarrays, EST libraries and SAGE analysis, gene-knockout systems, genome databases, sequence comparison/clustering algorithms, visualization tools.\n\nprereq: [Intro course in genetics, intro course in biochemistry] or instr consent\nprereq: [Intro course in genetics, intro course in biochemistry] or instr consent",
    "prereq": {}
  },
  {
    "uid": "016458",
    "code": "PMB5412",
    "subject": "PMB",
    "number": "5412",
    "honors": false,
    "writing": false,
    "name": "Plant Physiology & Development",
    "fullname": "Plant Physiology and Development",
    "info": "Plant physiology and development is the study of how plant cells, tissues and whole organisms grow and function in response to internal and external cues. PMB 4412/5412 covers the classic plant physiology and development processes including plant water relations, mineral nutrition, membrane transport, photosynthesis, respiration, vascular function, metabolism, growth and development, and hormone responses. The physics underlying our understanding of these physiological systems will also be addressed. Other areas of plant science such as plant genetics and biochemistry are covered in other courses and will not be emphasized this course. There are no enforced prerequisites for this course. The following preparation is recommended: PMB 2022 General Botany or PMB 3007W Plant Algal and Fungal Diversity; General Chemistry and Introductory Physics.",
    "prereq": {
      "or": [
        "005418",
        "014291"
      ]
    }
  },
  {
    "uid": "817589",
    "code": "PMB5500",
    "subject": "PMB",
    "number": "5500",
    "honors": false,
    "writing": false,
    "name": "Special Topics Plant Biology",
    "fullname": "Special Topics in Plant Biology",
    "info": "Topics Shell",
    "prereq": {}
  },
  {
    "uid": "794312",
    "code": "PMB5514",
    "subject": "PMB",
    "number": "5514",
    "honors": false,
    "writing": false,
    "name": "Plant Molecular Genetics & Dev",
    "fullname": "Plant Molecular Genetics and Development",
    "info": "Survey topics in plant molecular biology. How advances in molecular/genomic biology are used to understand plant physiology and developmental biology. Uses of transgenic plants in research/biotechnology.\n\nprereq: BIOC 3021 or BIOL 3021 or BIOL 4003 or BIOC 4332 or equiv",
    "prereq": {
      "or": [
        "014290",
        "009489",
        "003181"
      ]
    }
  },
  {
    "uid": "794311",
    "code": "PMB5516",
    "subject": "PMB",
    "number": "5516",
    "honors": false,
    "writing": false,
    "name": "Plant Cell Biology",
    "fullname": "Plant Cell Biology",
    "info": "In this course, we will cover current important research topics in plant cell biology. We will cover many plant-specific topics such as gravitropism, plant cell wall biosynthesis, structure and function, plasmodesmatal connections, signal transduction, tip growth, plant cytokinesis, cell energetics. We will also cover some topics that are important for both plant, fungal, and animal cell biology such as cell polarity, the cytoskeleton, protein sorting, and the secretory system. Since we will be using recent literature as the course text, some important and classic cell biology topics will not be covered. In the field of cell biology, new discoveries are often the result of improvements in technology especially in imaging, so we will cover some recent advances in methodology. This is also a writing class with the goal of helping students become familiar and comfortable with writing in a scientific style. There will be writing instruction and there will be some reading assignments on scientific writing. \n\nThere are no enforced prerequisites. Introductory courses on plants, genetics, and biochemistry are helpful.",
    "prereq": {}
  },
  {
    "uid": "806490",
    "code": "PMB5601",
    "subject": "PMB",
    "number": "5601",
    "honors": false,
    "writing": false,
    "name": "Topics in Plant Biochemistry",
    "fullname": "Topics in Plant Biochemistry",
    "info": "Biochemical analysis of processes unique to photosynthetic organisms. Photosynthesis and carbon dioxide fixation. Synthesis of carbohydrates, lipids, and derivatives. Aromatic compounds such as lignin, other natural products. Functions of natural products.\n\nprereq: [BIOL 1002 or BIOL 1009 or BIOL 2003], CHEM 2301",
    "prereq": {
      "and": [
        {
          "or": [
            "005420",
            "005416",
            "800457"
          ]
        },
        "002392"
      ]
    }
  },
  {
    "uid": "818727",
    "code": "PMB5802",
    "subject": "PMB",
    "number": "5802",
    "honors": false,
    "writing": false,
    "name": "Field Microbiology",
    "fullname": "Field Microbiology at Itasca Biological Research Station",
    "info": "The microbial world is incredibly diverse: there are estimated to be more microbial cells on Earth than stars in the entire universe. Much of our understanding in microbiology derives from studies of pure cultures; organisms that can easily be grown in the lab. However, it is now clear that the vast majority of microorganisms in nearly every environment are not readily grown under laboratory conditions. We must, therefore, go to them. Field Microbiology will be a three-week intensive course where students will be taught methods of environmental microbiology in both lecture and laboratory format. The goal is to not only quantify who is in a given sample but also to understand something about the conditions they live in (temperature, nutrient availability, etc.). Ecological data and microbial community structure will be generated using Oxford Nanopore sequencing technology - a cutting edge method to generate large sequencing datasets in real-time. Analyses will be integrated with an in situ set of field instrumentation that includes an eddy covariance system for quantifying fluxes of methane and carbon dioxide from Lake Itasca and Elk Lake, as well as in-lake measurements of solar radiation, dissolved organic matter, pH, conductivity, temperature, dissolved oxygen and chlorophyll. A series of field trips will be scheduled to locations in and around Itasca State Park including Elk Lake, Arco Lake, Iron Springs Bog and Lake Alice Spring. Students will also develop an independent research project that will apply methods learned during the first 1.5 weeks of the course.",
    "prereq": {}
  },
  {
    "uid": "818753",
    "code": "PMB5812",
    "subject": "PMB",
    "number": "5812",
    "honors": false,
    "writing": false,
    "name": "Field Mycology",
    "fullname": "Field Mycology",
    "info": "This class focuses on learning about how to study fungi. Students will gain experience identifying mushrooms and other samples collected during course field trips using macromorphological, microscopic, and molecular techniques. In addition, students will isolate fungi from environmental samples and maintain cultures as well as assess fungal community abundance and composition using both traditional (e.g., root tip colonization) and DNA-based methods (e.g., next-generation sequencing, bioinformatics, and ecological statistics). Course lectures highlight different aspects of fungal diversity (taxonomic, physiological, and ecological) and lab exercises provide hands-on practice. Course writing assignments and presentations emphasize exploring the natural history of fungi as well as critically assessing primary research literature.\n\nPermission is required for undergraduates to enroll in the graduate-level of this course (PMB 5812); inquire with the instructor.",
    "prereq": {}
  },
  {
    "uid": "013760",
    "code": "PMB5960",
    "subject": "PMB",
    "number": "5960",
    "honors": false,
    "writing": false,
    "name": "Special Topics",
    "fullname": "Special Topics",
    "info": "Topics vary, see Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "010400",
    "code": "PMB8081",
    "subject": "PMB",
    "number": "8081",
    "honors": false,
    "writing": false,
    "name": "Grad School Skills, Ethics",
    "fullname": "Succeeding in Graduate School: Skills, Ethics, and Beyond",
    "info": "What to expect and developing skills for succeeding in graduate school. Research ethics training. Reading/evaluating primary literature. Oral presentations. Exploring career options. prereq: Plant and Microbial Biology grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "010401",
    "code": "PMB8082",
    "subject": "PMB",
    "number": "8082",
    "honors": false,
    "writing": false,
    "name": "Struct-Evol-Ecol",
    "fullname": "Current Topics in Plant Biology: Structure-Evolution-Ecology",
    "info": "Background information and review of selected current literature. For first-year students in plant biological sciences and other biological science graduate programs.",
    "prereq": {}
  },
  {
    "uid": "792811",
    "code": "PMB8123",
    "subject": "PMB",
    "number": "8123",
    "honors": false,
    "writing": false,
    "name": "Research Ethics",
    "fullname": "Research Ethics in the Plant and Environmental Sciences",
    "info": "History/values relating to research/scholarship. Social responsibility/reporting misconduct. Authorship plagiarism. Peer review.\nCopyright/intellectual property. Conflicts of interest. Research data management. Fiscal responsibility/management. Environmental health/safety.\nResearch involving humans/animals. Mentorship presentations by faculty and invited speakers. Meets first seven weeks of spring semester.\n\nprereq: Grad student in [applied plant sciences or plant pathology or plant biological sciences or soil science]",
    "prereq": {}
  },
  {
    "uid": "788256",
    "code": "PMB8333",
    "subject": "PMB",
    "number": "8333",
    "honors": false,
    "writing": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "FTE: Master's\n\nprereq: Master's student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "788386",
    "code": "PMB8444",
    "subject": "PMB",
    "number": "8444",
    "honors": false,
    "writing": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)\n\nprereq: Doctoral student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "788508",
    "code": "PMB8666",
    "subject": "PMB",
    "number": "8666",
    "honors": false,
    "writing": false,
    "name": "Doct Pre-Thesis Cr",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "Doctoral Pre-Thesis Credits\n\nprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": {}
  },
  {
    "uid": "788637",
    "code": "PMB8777",
    "subject": "PMB",
    "number": "8777",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "Thesis Credits: Master's\n\nprereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": {}
  },
  {
    "uid": "787903",
    "code": "PMB8888",
    "subject": "PMB",
    "number": "8888",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit: Doctoral",
    "fullname": "Thesis Credit: Doctoral",
    "info": "Thesis credit: Doctoral.\n\nprereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": {}
  },
  {
    "uid": "013836",
    "code": "PMB8900",
    "subject": "PMB",
    "number": "8900",
    "honors": false,
    "writing": false,
    "name": "Seminar",
    "fullname": "Seminar",
    "info": "Current scientific research.",
    "prereq": {}
  },
  {
    "uid": "800650",
    "code": "PMB8901",
    "subject": "PMB",
    "number": "8901",
    "honors": false,
    "writing": false,
    "name": "Prep. of Research Proposals",
    "fullname": "Preparation of Research Proposals",
    "info": "Grant writing process. Strategies and ethical standards for research proposal preparation/review. Students prepare an original proposal and critique work of others.\n\nprereq: Plant biological sciences PhD student",
    "prereq": {}
  },
  {
    "uid": "013837",
    "code": "PMB8910",
    "subject": "PMB",
    "number": "8910",
    "honors": false,
    "writing": false,
    "name": "Journal Club",
    "fullname": "Journal Club",
    "info": "Critical evaluation of selected current literature. ",
    "prereq": {}
  },
  {
    "uid": "791850",
    "code": "PMB8993",
    "subject": "PMB",
    "number": "8993",
    "honors": false,
    "writing": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "Directed Studies\n\nprereq: PBio grad student, instr consent",
    "prereq": {}
  },
  {
    "uid": "791851",
    "code": "PMB8994",
    "subject": "PMB",
    "number": "8994",
    "honors": false,
    "writing": false,
    "name": "Research",
    "fullname": "Research",
    "info": "Independent research determined by student's interests, in consultation with faculty mentor.\n\nprereq: PBio grad student, instr consent",
    "prereq": {}
  }
]