[
  {
    "uid": "825185",
    "code": "POUL5001",
    "subject": "POUL",
    "number": "5001",
    "honors": false,
    "writing": false,
    "name": "Avian Anatomy and Physiology",
    "fullname": "Avian Anatomy and Physiology",
    "info": "This course provides an abbreviated overview of avian anatomy and physiology at the gross and cellular levels. Basic avian anatomy and physiology will be presented in the context of the commercial broiler chicken and turkey.",
    "prereq": {}
  },
  {
    "uid": "825186",
    "code": "POUL5002",
    "subject": "POUL",
    "number": "5002",
    "honors": false,
    "writing": false,
    "name": "Poultry Nutrition",
    "fullname": "Poultry Nutrition",
    "info": "The purpose of this course is to provide the principles of poultry nutrient metabolism, feed composition, and chemistry as it applies to commercial broiler chickens and turkeys.",
    "prereq": {}
  },
  {
    "uid": "825187",
    "code": "POUL5003",
    "subject": "POUL",
    "number": "5003",
    "honors": false,
    "writing": false,
    "name": "Poultry Diseases",
    "fullname": "Poultry Diseases",
    "info": "The purpose of this course is to provide introduction to common diseases of poultry, focusing on commercial broiler chicken and turkey production in the United States. We will start with an introduction to the principles of disease and the role of the host in susceptibility to disease. Then, specific diseases will be covered including viral, bacterial, fungal, and protozoal pathogens. Finally, non-infectious disease associated with nutrition, metabolism, and toxins will be covered. The student will gain understanding of the pathogen and host relative to each disease covered.",
    "prereq": {}
  },
  {
    "uid": "825243",
    "code": "POUL5013",
    "subject": "POUL",
    "number": "5013",
    "honors": false,
    "writing": false,
    "name": "Animal Welfare",
    "fullname": "Animal Welfare",
    "info": "This course will cover the basic principles, history, and application of animal welfare science for poultry. Students will learn to assess the welfare of poultry using science-based methods and reasoning. This course will provide background and application of animal welfare science.",
    "prereq": {}
  },
  {
    "uid": "827293",
    "code": "POUL5014",
    "subject": "POUL",
    "number": "5014",
    "honors": false,
    "writing": false,
    "name": "Disinfection Poultry Premises",
    "fullname": "Horizons in Chemistry: Microbial Disinfection for Poultry Premises",
    "info": "This online course will review the basic chemistry foundations needed to understand the chemical reactivity and assessment of common commercial disinfectants. You will become comfortable with applying chemical principles to disinfectant chemistry, learn to evaluate\ncommercial products, and develop a sound, efficacious, and safe disinfection program for a poultry setting using science-based methods and reasoning. This course will provide background and application of chemical disinfection science.",
    "prereq": {}
  },
  {
    "uid": "825188",
    "code": "POUL5015",
    "subject": "POUL",
    "number": "5015",
    "honors": false,
    "writing": false,
    "name": "Rotation",
    "fullname": "Broiler/Layer/Turkey Rotation",
    "info": "This course will serve as the capstone of the Applied/Production track of the Poultry Health Certificate. This one-week, in-person experience will be catered to the student's interest in one of three areas: commercial broiler chicken, chicken layer, or turkey production. The student will choose one of these three experiences and will learn core competencies in that area over a 1-week intensive hands-on course.",
    "prereq": {}
  },
  {
    "uid": "825189",
    "code": "POUL5016",
    "subject": "POUL",
    "number": "5016",
    "honors": false,
    "writing": false,
    "name": "Molecular Technologies",
    "fullname": "Capstone in Molecular Technologies",
    "info": "This course will serve as the capstone of the Research/Diagnostics track of the Poultry Health Certificate. This one-week, in-person experience will take place at the MCROC laboratory in Willmar, Minnesota. The student will learn about core molecular techniques and gain hands-on experience with these techniques over a 1-week intensive hands-on course.",
    "prereq": {}
  },
  {
    "uid": "820192",
    "code": "POUL5101",
    "subject": "POUL",
    "number": "5101",
    "honors": false,
    "writing": false,
    "name": "Lvg/Rsg Animals: Poultry",
    "fullname": "Living in a microbial world and raising animals: the poultry perspective",
    "info": "It’s a microbial world. We are just living in it.\nThis statement by Professor Mark Martin could not be more relevant than it is today. In every aspect of life, microbes play a role. This is particularly true in agricultural practices used to grow food for the human population. Good and bad, microbes are intricately linked to the practice of raising meat, fruits, and vegetables for human consumption.\n\nThe purpose of this online course is to emphasize the holobiont, which is the host itself plus the assemblage of microbes living inside and outside of it. This is different than your typical microbiology course. Yes, we will cover the basics of microbiology, and the role of the microbiome in the maintenance of health and disease. But we will also put this information in the context of ecology. Using the poultry production environment as an example, you will learn about the basics of poultry production and how microbes contribute to every aspect of the production chain - including the bird itself, the barns that birds are grown in, the ecosystem surrounding these barns, the processing plants that produce our meat, and even “us” as we interface with live production animals and consume their meat. In practical terms, this course will train you to appreciate and understand how normal “commensal” microbes in the animal and its surrounding environment are important for everyday life, health, and success. This course is suitable for upper-level undergraduate students, graduate students, and non-traditional industry professionals.",
    "prereq": {}
  },
  {
    "uid": "820193",
    "code": "POUL5102",
    "subject": "POUL",
    "number": "5102",
    "honors": false,
    "writing": false,
    "name": "How safe is your chicken?",
    "fullname": "How safe is your chicken? Food safety from a poultry perspective",
    "info": "The purpose of this course is to provide introduction to food safety with emphasis on poultry production. An emphasis will be given to understanding the major pathogens transmitted through live poultry and products and how they can be controlled or mitigated in live production and processing steps. After completing this course, you will have understanding of the basic food safety principles, major foodborne pathogens in poultry, principles of hazard analysis and critical control points (HACCP)-approach of food safety, meat and egg safety, and major preharvest and post-harvest approaches to safety of poultry foods. This course is suitable for upper-level undergraduate students, graduate students, and non-traditional industry professionals.",
    "prereq": {}
  },
  {
    "uid": "820194",
    "code": "POUL5103",
    "subject": "POUL",
    "number": "5103",
    "honors": false,
    "writing": false,
    "name": "Poultry biosecurity",
    "fullname": "Poultry biosecurity: framework for healthy production",
    "info": "In 2015, an avian influenza virus was introduced to poultry production in the upper Midwestern United States. This outbreak resulted in the destruction of more than 43 million chickens and turkeys raised for meat and egg production, devastating these poultry industries. This changed our view of biosecurity forever as it related to protecting the poultry supply. While this virus has subsided, we do not know where or when the next threat will emerge, and as such we need to be prepared for the unknown. The purpose of this course is to provide the principles of biosecurity, with an emphasis on poultry production. This course will cover the basics of biosecurity, and the role of everyone in the maintenance of biosecurity in commercial broiler chickens, turkeys, and egg layers. You will learn about biosecurity and will learn how to develop an effective biosecurity plan while navigating regulations and other logistical challenges. This online course is suitable for upper-level undergraduate students, graduate students, and non-traditional industry professionals.",
    "prereq": {}
  }
]