[
  {
    "uid": "006265",
    "code": "PSY1001",
    "subject": "PSY",
    "number": "1001",
    "honors": false,
    "writing": false,
    "name": "Intro Psych",
    "fullname": "Introduction to Psychology",
    "info": "Scientific study of human behavior. Problems, methods, findings of modern psychology.",
    "prereq": {}
  },
  {
    "uid": "820109",
    "code": "PSY1010",
    "subject": "PSY",
    "number": "1010",
    "honors": false,
    "writing": false,
    "name": "Topics in Psychology",
    "fullname": "Topics in Psychology",
    "info": "Introductory topics of current interest in Psychology.\n\n",
    "prereq": {}
  },
  {
    "uid": "805659",
    "code": "PSY1902",
    "subject": "PSY",
    "number": "1902",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: Fr",
    "prereq": {}
  },
  {
    "uid": "788560",
    "code": "PSY1905",
    "subject": "PSY",
    "number": "1905",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in class schedule.",
    "prereq": {}
  },
  {
    "uid": "793531",
    "code": "PSY1907W",
    "subject": "PSY",
    "number": "1907",
    "honors": false,
    "writing": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: freshman",
    "prereq": {}
  },
  {
    "uid": "793445",
    "code": "PSY1910W",
    "subject": "PSY",
    "number": "1910",
    "honors": false,
    "writing": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: Freshman",
    "prereq": {}
  },
  {
    "uid": "816968",
    "code": "PSY1911",
    "subject": "PSY",
    "number": "1911",
    "honors": false,
    "writing": false,
    "name": "Psy Perspectives Women & Work",
    "fullname": "Psychological Perspectives on Women and Work",
    "info": "Are you male or female? Your answer to this simple question will influence your experiences in the workplace. In this seminar, we will examine the empirical studies that document important gender differences in work. We will begin by learning about gender differences, with a focus on personality traits and cognitive abilities. Next, we will focus on specific issues such as the wage gap, prejudice and discrimination in the workplace, gender differences in leadership, the impact of motherhood on women's careers, and the influence of child care on psychological development. This seminar will provide all students with an important perspective on their upcoming experiences as members of the workforce.",
    "prereq": {}
  },
  {
    "uid": "816969",
    "code": "PSY1912",
    "subject": "PSY",
    "number": "1912",
    "honors": false,
    "writing": false,
    "name": "Drugs, Brains and Behavior",
    "fullname": "Drugs, Brains and Behavior",
    "info": "This course will examine substance use and misuse from the perspective of brain science. Mental health and societal issues surrounding drug and alcohol use will be covered including information from the popular media, government, and scientific research. Viewpoints surrounding each topic will be scrutinized through the lens of current brain and behavioral research. Students will gain a deeper ability to think critically and scientifically about popular beliefs regarding substance use. For instance, despite decades of study, existing research does not make clear whether brain deficits in human substance users are caused by misuse of substances, or caused by pre-existing factors (e.g., genetics, home environment) that predate substance use and predispose individuals to misuse in the first place. The course will draw from interesting new research conducted by faculty at the University of Minnesota and elsewhere to gain insight into this uncertainty. Although we will discuss these topics from a neurobiological standpoint, a background in neuroscience is not expected or necessary.",
    "prereq": {}
  },
  {
    "uid": "816970",
    "code": "PSY1913",
    "subject": "PSY",
    "number": "1913",
    "honors": false,
    "writing": false,
    "name": "The Psychology of Design",
    "fullname": "The Psychology of Design: Smart Products, Graphs, and Logos",
    "info": "This seminar will introduce students to the psychology of good design. We will focus on three areas: 1) How to design easily usable products, 2) How to design easily understandable charts, graphs, and presentations, and 3) How to design effective business logos. In each of these areas experts have greatly improved designs by tailoring them to how people process information, the domain of cognitive psychology. These methods are what distinguish a usable computer interface or an elegant remote control, from the clunky, difficult-to-use devices we have all encountered. We will read and discuss classic texts on each topic and students will present their own critiques of designs that they have picked from the real world, analyzing strengths and suggesting improvements.",
    "prereq": {}
  },
  {
    "uid": "816971",
    "code": "PSY1914",
    "subject": "PSY",
    "number": "1914",
    "honors": false,
    "writing": false,
    "name": "What is the Human Mind?",
    "fullname": "What is the Human Mind?",
    "info": "You are reading the description of a seminar. That is, some part of you is capable of taking a series of shapes as visual input, abstracting intended meaning from them, organizing the information, and evaluating what you've organized (e.g. \"fascinating seminar!\"). Your mind accomplishes this task, not your lungs or heart, but what is this thing - \"mind\" - that is capable of such complex internal information processing? Is it just a flurry of activated brain cells? Is it something non-physical? When you think about it, one of the most intriguing aspects of the universe is that you can think, that minds operate as entities that appear to be crucially tied to physical brains but that are also importantly different. In this seminar, we will examine conceptions of the human mind from psychological, philosophical, and neuroscientific perspectives. Can science and critical analysis offer a concrete and compelling specification of the human mind?",
    "prereq": {}
  },
  {
    "uid": "816972",
    "code": "PSY1915",
    "subject": "PSY",
    "number": "1915",
    "honors": false,
    "writing": false,
    "name": "Psych of Eating and Body Image",
    "fullname": "Psychology of Eating and Body Image",
    "info": "This seminar covers the continuum of human eating behavior, from hunger, starvation, and restraint, to binge eating and obesity, as well as body image. I hope that during this seminar we can call into question several myths about eating and obesity that you may believe. We will discuss the media's influence on body image, as well as the development of body image concerns. We will read about the famous starvation study conducted on this very campus over 60 years ago, as well as the causes and consequences of obesity. We will learn about the effectiveness (or not!) of diets, and about the little things that may be influencing our eating without us realizing it. We will talk about solutions to these problems, and about what healthy eating really is.",
    "prereq": {}
  },
  {
    "uid": "817313",
    "code": "PSY1916",
    "subject": "PSY",
    "number": "1916",
    "honors": false,
    "writing": false,
    "name": "Race in Everyday Space",
    "fullname": "Race in Everyday Space",
    "info": "This seminar examines the nature and meaning of being racial and ethnic minorities in the United States, with a particular focus on immigrant, refugee, second-generation, and adoptee communities that are unique to Minnesota and the Midwest. Students will learn about the unique and common histories, struggles, and successes of Blacks, Asian Americans, Latinx, and American Indians. Drawing upon psychological theory and research, as well as interdisciplinary ethnic studies scholarship, the seminar engages students in a critical analysis of the ways in which race, ethnicity, and migration affect the everyday lives of racial/ethnic minority individuals and families.",
    "prereq": {}
  },
  {
    "uid": "817022",
    "code": "PSY1917",
    "subject": "PSY",
    "number": "1917",
    "honors": false,
    "writing": false,
    "name": "Community and Connectedness",
    "fullname": "The Changing Face of Community and Connectedness",
    "info": "What is community? What is connectedness? Conversely, what is isolation? What is loneliness? Why do they matter? How are they changing in the digital age? People find community and connectedness in all kinds of different groups and through all kinds of different mediums. Yet, some remain isolated and others feel alone despite seemingly being connected. Crucially, whether people find community and connectedness and with whom they find it has profound impacts on their lives. It impacts their work, leisure time, happiness, health, and even their identity. We will explore the effects of connection and the consequences of isolation as we examine topics such as finding connection on a college campus, the role of music and art in connection, the effect of national crises, and whether technologies like Facebook and Tinder have changed how we connect with one another with the aim of understanding the current state of community and connection.",
    "prereq": {}
  },
  {
    "uid": "817039",
    "code": "PSY1918",
    "subject": "PSY",
    "number": "1918",
    "honors": false,
    "writing": false,
    "name": "Psychology of College Life",
    "fullname": "Psychology of College Life",
    "info": "Why is college so stressful, and how can I better manage my stress? Why is sleep so important, and how can I get more of it? Why am I spending so much time on Snapchat instead of doing my homework? In this class, we will discuss issues relevant to the lives of college students. The goal of this course is to learn about basic principles in psychology, and how psychological research provides insight into some of these and other questions.",
    "prereq": {}
  },
  {
    "uid": "817654",
    "code": "PSY1919",
    "subject": "PSY",
    "number": "1919",
    "honors": false,
    "writing": false,
    "name": "Re-wired: Addiction & Brain",
    "fullname": "Re-wired: Addiction and the Brain",
    "info": "This course examines current research and theory on the role of the brain in drug addiction. What challenges do biopsychologists and neuroscientists face when investigating addiction? What opportunities for innovative therapies will these investigations make possible? Our path to address these questions will take us through: basic principles of neuroanatomy and neural function; experimental techniques used in brain studies; historical perspectives on drug abuse and treatment; discussions with experts in the field and visits to laboratories using cutting-edge research tools. No prior knowledge of the topic is required or assumed.",
    "prereq": {}
  },
  {
    "uid": "818230",
    "code": "PSY1921",
    "subject": "PSY",
    "number": "1921",
    "honors": false,
    "writing": false,
    "name": "Uncovering \"Fake\" News",
    "fullname": "Uncovering \"Fake\" News: Deciphering Science in the Media",
    "info": "Do four or more cups of coffee a day fight off cancer? Do men with beards make better boyfriends? Does eating more chocolate make you smarter? Does a lack of sleep literally eat away at your brain? In the age of “fake” news and information being constantly exchanged on social media outlets, it can difficult to separate fact from fiction (and clickbait) in regards to scientific findings. Throughout the semester, we will learn how to critically analyze scientific studies in the media by examining A) how research methods can influence the conclusions we draw from a study, B) common psychological biases in the media and ourselves that can affect the way we interpret the news, C) how bad (and good) statistics can influence the outcome of studies in social science and psychology, and D) what can go wrong in the process of communicating science, from the initial scientific publication to reporting. Through the semester, you will gain the necessary tools to celebrate the good science you see in the news and punch holes through the fiction as you continue onward into an ever more scientific and online world.",
    "prereq": {}
  },
  {
    "uid": "818853",
    "code": "PSY1922",
    "subject": "PSY",
    "number": "1922",
    "honors": false,
    "writing": false,
    "name": "The Anxious Brain",
    "fullname": "The Anxious Brain",
    "info": "Anxiety is core to human existence; all of us have experienced it to some degree. But what exactly is anxiety? Why does it affect some more than others? And why have recent decades been called “the age of anxiety?” Of the many approaches to answering these questions, in this course we will begin with the human brain. The purpose of this course is to use neuroscience to better understand the human experience of anxiety. By the end of the course, students should be able to: 1) define anxiety in terms of its mental, physiological, and behavioral components; 2) identify the brain processes involved in the expression and inhibition of anxiety; and 3) explain mechanisms by which existing treatments for anxiety are effective. In the long term, students will be able to make connections between neuroscience and real-world instances of anxiety. Previous knowledge of neuroscience or psychology is not required.",
    "prereq": {}
  },
  {
    "uid": "818854",
    "code": "PSY1923",
    "subject": "PSY",
    "number": "1923",
    "honors": false,
    "writing": false,
    "name": "The Freshman 15",
    "fullname": "The Freshman 15: Stress and Health Management for College Students",
    "info": "The start of college is a time of significant transition from family home to campus living. The changes across many domains of one's life can disrupt healthy habits and initiate unhealthy ones. Are your stress levels out of control? Are you worried about your college eating habits? Are you planning to catch up on sleep after you graduate? In this seminar we will use a biopsychosocial framework, popular in health psychology, to examine personal health influences and choices. This framework supports a holistic approach, in stark contrast to the erroneous and weight-focused \"freshman 15\" concept. You will gain insight into your own health and learn methods to improve and sustain health behaviors that will better support your life as a student and your life beyond college.",
    "prereq": {}
  },
  {
    "uid": "818855",
    "code": "PSY1924",
    "subject": "PSY",
    "number": "1924",
    "honors": false,
    "writing": false,
    "name": "Grappling with Behavior Change",
    "fullname": "Why would that policy ever work?: Grappling with the Challenge of Behavior Change",
    "info": "Many of the challenges facing society today in the areas of health and the environment are tied to patterns of human behavior.  Given this state of affairs, numerous policies and initiatives have emerged, designed to shape our behavior -- to help us eat better, be more active, drink responsibly, refrain from smoking, use fewer resources, recycle more, to name but a few.  And even a cursory review of these efforts reveals they can take many forms including the provision of incentives; the implementation of bans or mandates; supports for self-monitoring; the restructuring of behaviors to make them more accessible; the use of warning labels; or the dissemination of messages to heighten awareness, model behavior, or shape beliefs.  What determines which strategies are used for which problems?  Are these strategies effective?  If so, why?  If not, why not?  We will spend the semester grappling with challenge of trying to shape human behavior.  Together, we will examine policies and initiatives that are currently in place, think through how they are supposed to work, and try to determine whether (or when) they are effective.  Together we will form recommendations regarding best practices; recognizing where current efforts are succeeding and offer advice for where we can do better. ",
    "prereq": {}
  },
  {
    "uid": "825136",
    "code": "PSY1925",
    "subject": "PSY",
    "number": "1925",
    "honors": false,
    "writing": false,
    "name": "Neuroimaging in Psychology",
    "fullname": "Neuroimaging in Psychology: Why Do Psychologists Use Magnets & Electrodes to Look at People's Brains",
    "info": "This seminar explores how people use electricity and magnets to study brains. It seems almost magical that we can use magnets, radio antennae, and electrodes to figure out what people are thinking. But there’s no magic about it, and we will spend part of our time together learning about the basic physics and neuroscience that make functional magnetic resonance imaging (fMRI), magnetoencephalography (MEG), and electroencephalography (EEG) possible. We will spend the rest of the time talking about why people want to do this and whether or not they should. The central problem is that, once we’ve collected our data, we have to interpret it. In order to interpret our data, we have to make some assumptions about how things work. The goal of this seminar is to teach students to detect and question those assumptions. Students will use weekly writing assignments to sharpen their thinking on each topic. The midterm exam will be a debate on the topic “Can we read people’s minds?” and the final project will be to explain a popular neuroimaging paper to a stranger.",
    "prereq": {}
  },
  {
    "uid": "825875",
    "code": "PSY1926",
    "subject": "PSY",
    "number": "1926",
    "honors": false,
    "writing": false,
    "name": "Innovating Minds & Creativity",
    "fullname": "Our Innovating Minds:Introducing the Cognitive and Brain Sciences of Individual and Group Creativity",
    "info": "Creativity and innovation are essential to our ability to flexibly and positively make changes in our lives – both individually and collectively. How do our minds, brains, and environments together enable the generation and shaping of useful and influential novel ideas? This seminar course investigates this question, drawing on research and observations from the cognitive and brain sciences and other disciplines such as design, art, and computer science. Core parts of the course involve reading and discussing original research articles along with active hands-on/minds-on within-class collaborative activities. One integrative theme throughout the course is the ways in which creative thinking/making is boosted when we contextually vary the extent to which we deliberately exert cognitive control in the pursuit of creative goals. A second integrative theme is understanding how we need both concreteness and abstraction to best realize our making/creating endeavors.",
    "prereq": {}
  },
  {
    "uid": "826582",
    "code": "PSY1927",
    "subject": "PSY",
    "number": "1927",
    "honors": false,
    "writing": false,
    "name": "Asian American Experiences",
    "fullname": "Asian American Experiences",
    "info": "This seminar examines the nature and meaning of being Asian American in the United States, with a particular focus on immigrant, refugee, second-generation, and adoptee communities that are unique to Minnesota and the Midwest. Students will learn about the history, struggle, and success of Asian Americans. Drawing upon psychological theory and research, as well as interdisciplinary ethnic studies scholarship, the seminar engages students in a critical analysis of the ways in which race, ethnicity, and migration affect the everyday lives of Asian American individuals and families.",
    "prereq": {}
  },
  {
    "uid": "813970",
    "code": "PSY1942",
    "subject": "PSY",
    "number": "1942",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: Fr",
    "prereq": {}
  },
  {
    "uid": "789782",
    "code": "PSY1999",
    "subject": "PSY",
    "number": "1999",
    "honors": false,
    "writing": false,
    "name": "Special Exam",
    "fullname": "Special Exam",
    "info": "",
    "prereq": {}
  },
  {
    "uid": "799440",
    "code": "PSY3001W",
    "subject": "PSY",
    "number": "3001",
    "honors": false,
    "writing": true,
    "name": "Intro Research Methods",
    "fullname": "Introduction to Research Methods",
    "info": "Concepts/procedures used to conduct/evaluate research, especially in social sciences. Benefits/limitations of traditional research methods. Evaluating scientific claims.\n\nprereq: [1001, [2801 or 3801 or equiv]] or dept consent",
    "prereq": {
      "and": [
        "006265",
        {
          "or": [
            "798902"
          ]
        }
      ]
    }
  },
  {
    "uid": "006266",
    "code": "PSY3005W",
    "subject": "PSY",
    "number": "3005",
    "honors": false,
    "writing": true,
    "name": "Rsch Methds & Stats",
    "fullname": "Introduction to Research Methods and Statistics",
    "info": "Concepts/procedures used to conduct/evaluate research, especially in social sciences. Benefits/limitations of traditional research methods. Using statistics to describe/interpret research outcomes. Evaluating scientific claims.",
    "prereq": {}
  },
  {
    "uid": "006264",
    "code": "PSY3011",
    "subject": "PSY",
    "number": "3011",
    "honors": false,
    "writing": false,
    "name": "Intro to Learning",
    "fullname": "Introduction to Learning and Behavior",
    "info": "Methods/findings of research on learning and behavior change. Twentieth-century theoretical perspectives, including contemporary models. Emphasizes animal learning and behavioral psychology.\n\nprereq: 1001",
    "prereq": {
      "and": [
        "006265"
      ]
    }
  },
  {
    "uid": "006360",
    "code": "PSY3031",
    "subject": "PSY",
    "number": "3031",
    "honors": false,
    "writing": false,
    "name": "Intro Sensation and Perception",
    "fullname": "Introduction to Sensation and Perception",
    "info": "Psychological, biological, and physical bases of sensory experience in humans and animals. Emphasizes senses of vision/hearing.\n\nprereq: PSY 1001",
    "prereq": {
      "and": [
        "006265"
      ]
    }
  },
  {
    "uid": "006457",
    "code": "PSY3051",
    "subject": "PSY",
    "number": "3051",
    "honors": false,
    "writing": false,
    "name": "Intro to Cognitive",
    "fullname": "Introduction to Cognitive Psychology",
    "info": "Scientific study of the mind in terms of representation and processing of information. Research and theory on cognitive abilities such as perception, attention, memory, language, and reasoning. Aspects of computational modeling and neural systems.\n\nprereq: 1001",
    "prereq": {
      "and": [
        "006265"
      ]
    }
  },
  {
    "uid": "006460",
    "code": "PSY3061",
    "subject": "PSY",
    "number": "3061",
    "honors": false,
    "writing": false,
    "name": "Intro to Biopsych",
    "fullname": "Introduction to Biological Psychology",
    "info": "Neurophysiology/neuroanatomy, neural mechanisms of motivation, emotion, sleep-wakefulness cycle, learning/memory in animals/humans. Neural basis of abnormal behavior, drug abuse. \n\nPrereq: PSY 1001 or BIOL 1009 or NSCI 2001 OR NSCI 2101",
    "prereq": {}
  },
  {
    "uid": "006475",
    "code": "PSY3101",
    "subject": "PSY",
    "number": "3101",
    "honors": false,
    "writing": false,
    "name": "Introduction to Personality",
    "fullname": "Introduction to Personality",
    "info": "Covers the major issues in personality psychology, including personality traits, their assessment, and their roots in genetic and environmental influences; personality development and the effects of personality on life outcomes; psychological and biological processes related to personality; and the importance of goals, roles, and narrative identity. Various contemporary and historical perspectives are considered, including psychodynamic, humanistic, behaviorist, and evolutionary approaches.\n\nprereq: 1001",
    "prereq": {
      "and": [
        "006265"
      ]
    }
  },
  {
    "uid": "006519",
    "code": "PSY3121",
    "subject": "PSY",
    "number": "3121",
    "honors": false,
    "writing": false,
    "name": "History & Systems of Psych",
    "fullname": "History and Systems of Psychology",
    "info": "Survey of the history, methods, and content of modern psychological theory, research, and application. Schools of psychology (e.g., structuralism, functionalism, behaviorism, Gestalt psychology) and central theories of psychology reviewed in their historical and philosophical context.\n\nprereq: PSY 1001",
    "prereq": {
      "and": [
        "006265"
      ]
    }
  },
  {
    "uid": "006479",
    "code": "PSY3135",
    "subject": "PSY",
    "number": "3135",
    "honors": false,
    "writing": false,
    "name": "Intro to Individual Diffs",
    "fullname": "Introduction to Individual Differences",
    "info": "Differential methods in studying human behavior. Psychological traits. Influence of age, sex, heredity, environment in individual/group differences in ability, personality, interests, social attitudes.\n\nprereq: [1001, [3801 or equiv]] or instr consent",
    "prereq": {
      "and": [
        "006265",
        {
          "or": [
            "798902"
          ]
        }
      ]
    }
  },
  {
    "uid": "010859",
    "code": "PSY3137",
    "subject": "PSY",
    "number": "3137",
    "honors": false,
    "writing": false,
    "name": "Rdgs Beh Genet",
    "fullname": "Readings in Behavioral Genetics",
    "info": "This course may be taken as an optional supplement to lecture course in behavioral genetics (5137). Each week students will read one or two articles relevant to topics covered in the lecture and discuss the articles with the instructor during a one hour contact session.  Readings will not overlap those assigned in the lecture class.",
    "prereq": {}
  },
  {
    "uid": "006484",
    "code": "PSY3201",
    "subject": "PSY",
    "number": "3201",
    "honors": false,
    "writing": false,
    "name": "Intro to Soc Psy",
    "fullname": "Introduction to Social Psychology",
    "info": "Overview of theories/research in social psychology. Attitudes/persuasion, social judgment, the self, social influence, aggression, prejudice, helping, and applications.\n\nprereq: 1001 or instr consent",
    "prereq": {
      "or": [
        "006265"
      ]
    }
  },
  {
    "uid": "801367",
    "code": "PSY3206",
    "subject": "PSY",
    "number": "3206",
    "honors": false,
    "writing": false,
    "name": "Health Psychology",
    "fullname": "Introduction to Health Psychology",
    "info": "Theories/research in health psychology. Bi-directional relationships between psychological factors and physical health. Stress/coping, adjustment to chronic illness. Psychological factors in etiology/course of disease. Health behavior change.\n\nprereq: 1001",
    "prereq": {
      "and": [
        "006265"
      ]
    }
  },
  {
    "uid": "014459",
    "code": "PSY3301",
    "subject": "PSY",
    "number": "3301",
    "honors": false,
    "writing": false,
    "name": "Intro to Cultural Psychology",
    "fullname": "Introduction to Cultural Psychology",
    "info": "Theories/research on how culture influences basic psychological processes (e.g., emotion, cognition, psychopathology) in domains that span different areas of psychology (e.g., social, clinical, developmental, industrial-organizational) and of other disciplines (e.g., anthropology, public health, sociology).\n\nprereq: 1001",
    "prereq": {
      "and": [
        "006265"
      ]
    }
  },
  {
    "uid": "797294",
    "code": "PSY3511",
    "subject": "PSY",
    "number": "3511",
    "honors": false,
    "writing": false,
    "name": "Intro Counseling Psych",
    "fullname": "Introduction to Counseling Psychology",
    "info": "History, theories, and research related to counseling psychology. Development/application of counseling theories to diverse populations. Psychological research on counseling process. Psychological mechanisms that promote change in people's lives.\n\nprereq: 1001",
    "prereq": {
      "and": [
        "006265"
      ]
    }
  },
  {
    "uid": "006493",
    "code": "PSY3604",
    "subject": "PSY",
    "number": "3604",
    "honors": false,
    "writing": false,
    "name": "Intro to Psychopathology",
    "fullname": "Introduction to Psychopathology",
    "info": "Diagnosis, classification, etiologies of behavioral disorders.\n\nprereq: 1001",
    "prereq": {
      "and": [
        "006265"
      ]
    }
  },
  {
    "uid": "006497",
    "code": "PSY3617",
    "subject": "PSY",
    "number": "3617",
    "honors": false,
    "writing": false,
    "name": "Intro Clinical Psych",
    "fullname": "Introduction to Clinical Psychology",
    "info": "Historical developments, contemporary issues. Trends in psychological assessment methods, intervention strategies, and clinical psychology research. Theories behind, empirical evidence for, usefulness of psychological intervention strategies.\n\nprereq: 3604 or 5604H",
    "prereq": {
      "or": [
        "006493"
      ]
    }
  },
  {
    "uid": "818763",
    "code": "PSY3621",
    "subject": "PSY",
    "number": "3621",
    "honors": false,
    "writing": false,
    "name": "Japanese Traditions & Psych",
    "fullname": "Japanese Traditions & Psychology of Well-Being",
    "info": "During this class we will travel to the two main regions of Japan, Honshu, and Oki-Shoto. Students will deepen their knowledge of Japanese culture, consider lifespan development within the context of family and examine rituals and traditions within the context of family. To understand these traditions, students will apply their deepening knowledge of the culture. From a lifespan development perspective, we will plan to study some of the common developmental processes that occur, emphasizing individual and family development. Finally, we will explore family traditions and rituals in Japan including: (a) what function they serve; (b) what factors are associated with tradition adherence; and (c) influences outside (e.g., nuclear war) or inside (e.g., parental mental illness) the family that may promote or interfere with these traditions. No Japanese language knowledge is required.",
    "prereq": {}
  },
  {
    "uid": "801919",
    "code": "PSY3633",
    "subject": "PSY",
    "number": "3633",
    "honors": false,
    "writing": false,
    "name": "Happiness",
    "fullname": "Happiness: Integrating Research Across Psychological Sciences",
    "info": "Nature of human happiness/fulfillment. Insights from cognitive, personality, and social psychology, and from biology and economics. Integrative approach to feelings that make life worth living.\n\nprereq: 3001W or 3001V or instr consent",
    "prereq": {
      "or": [
        "799440"
      ]
    }
  },
  {
    "uid": "006373",
    "code": "PSY3666",
    "subject": "PSY",
    "number": "3666",
    "honors": false,
    "writing": false,
    "name": "Human Sexuality",
    "fullname": "Human Sexuality",
    "info": "Overview of theories, research, and contemporary issues in human sexual behavior from an interdisciplinary perspective. Sexual anatomy/physiology, hormones/sexual differentiation, cross-cultural perspectives on sexual development, social/health issues, and sexual dysfunction/therapy.\n\nprereq: 1001",
    "prereq": {
      "and": [
        "006265"
      ]
    }
  },
  {
    "uid": "009935",
    "code": "PSY3711",
    "subject": "PSY",
    "number": "3711",
    "honors": false,
    "writing": false,
    "name": "Psychology in the Workplace",
    "fullname": "Psychology in the Workplace",
    "info": "Application of psychological theory/research to recruitment, personnel selection, training/development, job design, work group design, work motivation, leadership, performance assessment, job satisfaction measurement.\n\nprereq: 1001, [2801/3801 or equiv] or SCO 2550 or instr consent",
    "prereq": {
      "or": [
        "006265",
        {
          "or": [
            "798902"
          ]
        }
      ]
    }
  },
  {
    "uid": "798902",
    "code": "PSY3801",
    "subject": "PSY",
    "number": "3801",
    "honors": false,
    "writing": false,
    "name": "Intro Psych Data Analysis",
    "fullname": "Introduction to Psychological Measurement and Data Analysis",
    "info": "Descriptive/basic inferential statistics used in psychology. Measures of central tendency, variability, t tests, one-way ANOVA, correlation, regression, confidence intervals, effect sizes. Psychological measurement. Graphical data presentation. Statistical software.\n\nprereq: High school algebra, [PSY 1001 or equiv]; intended for students who plan to major in psychology",
    "prereq": {
      "or": [
        "006265"
      ]
    }
  },
  {
    "uid": "818053",
    "code": "PSY3896",
    "subject": "PSY",
    "number": "3896",
    "honors": false,
    "writing": false,
    "name": "Internship in Psychology",
    "fullname": "Internship in Psychology",
    "info": "Students first need to secure an internship related to the field of Psychology. Support from Psychology Undergraduate Advising and CLA Career Services is available for this process. Corresponding online coursework includes written goals, journal entries, career development activities, and a culminating paper/project. Credits are variable based on hours at your site: - 1 credit - 45 hour minimum (average 3-4 hours per week) - 2 credit - 90 hour minimum (average 5-7 hours per week) - 3 credit - 135 hour minimum (average 8-9 hours per week) - 4 credit - 180 hour minimum (average 10-12 hours per week). The classwork (journal entries, final paper, etc.) required is increased relative to your credit registration. Students work with their site supervisors to submit a completed internship contract via Handshake in order to register. https://handshake.umn.edu/ -- \"Request an Experience\". Contact the psyadvis@umn.edu with any questions. A student may only earn credit for a given internship through one course at a time. \n\nprereq: Psychology BA or BS major, Department Permission",
    "prereq": {}
  },
  {
    "uid": "811904",
    "code": "PSY3901W",
    "subject": "PSY",
    "number": "3901",
    "honors": false,
    "writing": true,
    "name": "Capstone: Research Laboratory",
    "fullname": "Capstone in Psychology - Research Laboratory",
    "info": "\tThe capstone courses in Psychology synthesize knowledge gained throughout major and create pathways to post-graduation life. Students will reflect on the discipline of psychology and on their experiences in their degree program; class and small group discussions will support this reflection. Students will be provided with access to professionals who are alumni of the psychology program and will have the opportunity to hear these career professionals speak about their varied career paths and to network with them for advice and connections to other professionals. Students will also receive important information regarding graduate school and career preparation from the Psychology Advising Office and CLA Career Services.\n\nIn this course, you will draw from your experience in a faculty research lab (PSY 4/5993) to help develop the topic of your major project paper. Students complete a research paper based on activities in the lab, or a literature review if the lab did not complete empirical work. \n\nBefore class begins students must secure a laboratory research experience in a faculty member's lab for PSY 4/5993 credits or enroll in the PSY 5993 class, either the semester prior to or concurrently with your PSY 3901W enrollment. Because research lab positions are not guaranteed, we recommend BA students only select this option if they already have a PSY 4/5993 position secured. \n\nprereq: [3801 or equiv], 3001W, completion of five courses from three distribution areas, PSY major, senio",
    "prereq": {
      "or": [
        {
          "or": [
            "798902"
          ]
        },
        "799440"
      ]
    }
  },
  {
    "uid": "006500",
    "code": "PSY3902W",
    "subject": "PSY",
    "number": "3902",
    "honors": false,
    "writing": true,
    "name": "Capstone: Individual Interest",
    "fullname": "Capstone in Psychology - Individual Interests",
    "info": "The capstone courses in Psychology synthesize knowledge gained throughout major and create pathways to post-graduation life. Students will reflect on the discipline of psychology and on their experiences in their degree program; class and small group discussions will support this reflection. Students will be provided with access to professionals who are alumni of the psychology program and will have the opportunity to hear these career professionals speak about their varied career paths and to network with them for advice and connections to other professionals. Students will also receive important information regarding graduate school and career preparation from the Psychology Advising Office and CLA Career Services.\n\nIn this course, you will develop a project that relates to your personal or occupational interests. It includes extra reading or contact with people working in your area of interest. The most common way to satisfy this requirement is to read a book written by a psychologist for a general audience or to interview at least three professionals working in your area of interest. Other ideas may be discussed with the course instructor.\n\nprereq: [3801 or equiv], 3001W, completion of five courses from three distribution areas, PSY major, senior",
    "prereq": {
      "or": [
        {
          "or": [
            "798902"
          ]
        },
        "799440"
      ]
    }
  },
  {
    "uid": "811905",
    "code": "PSY3903W",
    "subject": "PSY",
    "number": "3903",
    "honors": false,
    "writing": true,
    "name": "Capstone: Community Engagement",
    "fullname": "Capstone in Psychology - Community Engagement",
    "info": "\tThe capstone courses in Psychology synthesize knowledge gained throughout major and create pathways to post-graduation life. Students will reflect on the discipline of psychology and on their experiences in their degree program; class and small group discussions will support this reflection. Students will be provided with access to professionals who are alumni of the psychology program and will have the opportunity to hear these career professionals speak about their varied career paths and to network with them for advice and connections to other professionals. Students will also receive important information regarding graduate school and career preparation from the Psychology Advising Office and CLA Career Services.\n\nIn this course, you will have the opportunity to connect your study of psychology to important issues in the local community. The Center for Community-Engaged Learning provides students with the opportunity to work onsite at a nearby community organization for approximately four hours each week throughout the semester. Students draw from this community experience to help identify the topic of their capstone paper.\n\nIn the first week of classes you will receive instructions from the Center for Community-Engaged Learning regarding community site placement.\n\nprereq: [3801 or equiv], 3001W, completion of five courses from three distribution areas, PSY major, senior",
    "prereq": {
      "or": [
        {
          "or": [
            "798902"
          ]
        },
        "799440"
      ]
    }
  },
  {
    "uid": "006502",
    "code": "PSY3960",
    "subject": "PSY",
    "number": "3960",
    "honors": false,
    "writing": false,
    "name": "Undergrad Seminar",
    "fullname": "Undergraduate Seminar in Psychology",
    "info": "Undergraduate seminars in subjects of current interest in psychology.\n\nprereq: 1001",
    "prereq": {
      "and": [
        "006265"
      ]
    }
  },
  {
    "uid": "006503",
    "code": "PSY3993",
    "subject": "PSY",
    "number": "3993",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Independent reading leading to paper or to oral or written exam.\nPrereq instr consent, dept consent, college consent.",
    "prereq": {}
  },
  {
    "uid": "006504",
    "code": "PSY3994",
    "subject": "PSY",
    "number": "3994",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "Individual empirical project leading to written report.",
    "prereq": {}
  },
  {
    "uid": "011025",
    "code": "PSY3996",
    "subject": "PSY",
    "number": "3996",
    "honors": false,
    "writing": false,
    "name": "Field Study/Internship Psych",
    "fullname": "Undergraduate Fieldwork and Internship in Psychology",
    "info": "Supervised fieldwork/internship in community/industry pertinent to formal academic training in psychology.\n\nprereq: 1001, instr consent, dept consent",
    "prereq": {
      "and": [
        "006265"
      ]
    }
  },
  {
    "uid": "006505",
    "code": "PSY4011",
    "subject": "PSY",
    "number": "4011",
    "honors": false,
    "writing": false,
    "name": "Applied Behavior Analysis",
    "fullname": "Applied Behavior Analysis",
    "info": "Psychology 4011/5011: Applied Behavior Analysis\nSpring Semester Only\nThis course focuses on the basic concepts of applied behavior analysis and their practical application to improving the human condition. Students learn how behavioral principles are applied to the development of the everyday behavior of both humans and nonhumans. Students also learn about the analysis and solution of the important behavior problems that can face all children and adults. The course illustrates why and how to collect and analyze behavioral data and how to design and implement behavior intervention programs. Issues in professional ethics and clients’ rights are also discussed. Psy 4011/5011 can serve as preparation for the exams of the international Behavior Analyst Certification Board (see www.bacb.com).\n\nprereq: 3011 or instr consent",
    "prereq": {
      "or": [
        "006264"
      ]
    }
  },
  {
    "uid": "792668",
    "code": "PSY4016",
    "subject": "PSY",
    "number": "4016",
    "honors": false,
    "writing": false,
    "name": "Behavior Analysis and Autism",
    "fullname": "Behavior Analysis and Autism",
    "info": "Psy 4016/5016: Behavior Analysis and Autism\nFall Semester Only\nThis practicum course is a special service-learning opportunity on current Applied Behavior Analysis (ABA) interventions for children who suffer from the challenges of autism. In this practicum, students gain substantial experience working with children in off-campus settings under the supervision of Board Certified Behavior Analysts who are engaged in the direct application of ABA and behavior therapy. This field experience involves a minimum of 7 hours per week for 12 weeks. Each week, the students participate in two 3-hour, one-on-one therapy sessions at either a home-based or center-based ABA program site, plus one 1-hour clinical review meeting at that site. Students also attend one 1.5-hour lecture/discussion session and complete weekly reading assignments. Students are introduced to the principles and methods currently employed to help young children with autism acquire functional language and appropriate social behavior, and control autistic behavior. Issues of professional ethics, social responsibility, and scientific and moral philosophy pertaining to the treatment of children with autism are also addressed. Grading is based on appropriate participation in the service-learning activities, competency evaluations at the service-learning site, and performance on a final exam. The prerequisite for the course is either Psy 4011/5011: Applied Behavior Analysis, or a comparable course or experience. Students who have prior mastery of the technical vocabulary of ABA are given preference.\n\nprereq: Individual auto transportation, instr consent",
    "prereq": {
      "or": [
        "006505",
        "817506"
      ]
    }
  },
  {
    "uid": "816554",
    "code": "PSY4021",
    "subject": "PSY",
    "number": "4021",
    "honors": false,
    "writing": false,
    "name": "Minds, Brains, and Innovation",
    "fullname": "Creativity Sciences: Minds, Brains, and Innovation",
    "info": "Creativity and innovation play a pivotal role in our individual and collective lives. How do our minds, brains, and environments together enable the generation of useful novel ideas?  \n\nThis course investigates this question, using empirical findings and methods from the cognitive and brain sciences and other disciplines. Both close readings of original empirical research articles and active hands-on/minds-on within-class experiments and collaborative activities are core parts of the course.  \n\nTwo integrative themes throughout the course are the need for dynamically adaptive (contextually sensitive) variation in both levels of cognitive control and goal guidance (deliberate to spontaneous to automatic) and our level of representational specificity (concrete and specific to mid-level to abstract).\n\nprereq: Psy 1001",
    "prereq": {
      "and": [
        "006265"
      ]
    }
  },
  {
    "uid": "801368",
    "code": "PSY4032",
    "subject": "PSY",
    "number": "4032",
    "honors": false,
    "writing": false,
    "name": "Psychology  of Music",
    "fullname": "Psychology of Music",
    "info": "Sound, hearing, music perception. Cognitive neuroscience of music appreciation/production. Concepts in perception/production of sound/music. Music psychology topics. Recent primary research.\n\nprereq: Grad or [[jr or sr], [3011 or 3031 or 3051 or 3061]] or instr consent",
    "prereq": {
      "and": [
        {
          "or": [
            "006264",
            "006360",
            "006457",
            "006460"
          ]
        }
      ]
    }
  },
  {
    "uid": "009988",
    "code": "PSY4036",
    "subject": "PSY",
    "number": "4036",
    "honors": false,
    "writing": false,
    "name": "Visual Impairment",
    "fullname": "Perceptual Issues in Visual Impairment",
    "info": "Challenges/capabilities of people who are blind or have low vision. Reading, space perception, mobility. Strengths/weaknesses of adaptive technology.\n\nprereq: 1001 or instr consent",
    "prereq": {
      "or": [
        "006265"
      ]
    }
  },
  {
    "uid": "016165",
    "code": "PSY4133",
    "subject": "PSY",
    "number": "4133",
    "honors": false,
    "writing": false,
    "name": "Testing",
    "fullname": "Psychological Testing and Assessment",
    "info": "Survey of psychological tests, assessment instruments. Methods for developing, administering, scoring tests. Criteria for evaluating test/assessment adequacy. Examples relevant to clinical psychology (e.g., abilities, personality, mental disorders). Hands-on opportunity to design/evaluate a psychological test. Small groups.",
    "prereq": {}
  },
  {
    "uid": "825607",
    "code": "PSY4206",
    "subject": "PSY",
    "number": "4206",
    "honors": false,
    "writing": false,
    "name": "Interventions for Health",
    "fullname": "Interventions for Health and Wellness",
    "info": "This course explores empirically-tested psychological interventions to increase health and happiness. In the first part of the course, the focus will be on interventions to increase happiness, and students will test different strategies on themselves each week (as well as read the research literature on the strategies) as they attempt to increase happiness. In the second part of the course, students will select a health behavior, and then read about and test interventions (again on themselves) to change health behaviors, aiming to maintain a new health goal. A group project will involve creating an intervention to increase happiness on campus. Course consists of lecture, discussion, group work, and intervention design and testing. PSY 3206 is recommended, but not required.",
    "prereq": {}
  },
  {
    "uid": "816376",
    "code": "PSY4207",
    "subject": "PSY",
    "number": "4207",
    "honors": false,
    "writing": false,
    "name": "Personality & Social Behavior",
    "fullname": "Personality and Social Behavior",
    "info": "Conceptual/methodological strategies for scientific study of individuals and their social worlds. Applications of theory/research to issues of self, identity, and social interaction.\n\nprereq: 3101 or 3201 or honors or grad student or instr consent",
    "prereq": {
      "or": [
        "006475",
        "006484"
      ]
    }
  },
  {
    "uid": "825677",
    "code": "PSY4301",
    "subject": "PSY",
    "number": "4301",
    "honors": false,
    "writing": false,
    "name": "Psychology & Diversity Science",
    "fullname": "Psychology & Diversity Science",
    "info": "This is an advanced course for undergraduate students interested in research, theory, history, and practice related to psychological perspectives in Diversity Science. Diversity Science broadly pertains to understanding causes, consequences, and correlates of human group-based variations, in terms of race, ethnicity, gender, and the like. Students will learn how to adopt a scientific, analytic perspective on current issues and debates related to diversity within both academic research and popular culture. The course consists of lecture, discussion, and a substantial amount of hands-on learning through use and analysis of relevant research data.\n\nPrerequisites: Psy 3001W or Psy 3001V and Psy 3801 or Psy 3801H. In addition, completion of Psy 3301 is strongly recommended.",
    "prereq": {}
  },
  {
    "uid": "006614",
    "code": "PSY4501",
    "subject": "PSY",
    "number": "4501",
    "honors": false,
    "writing": false,
    "name": "Psych of Women & Gender",
    "fullname": "Psychology of Women and Gender",
    "info": "Theory/research regarding psychology of women and psychological sex differences/similarities. Issues unique to women (e.g., pregnancy). Research comparing men/women in terms of personality, abilities, and behavior.\n\nprereq: [[Jr or sr], psych major] or instr consent",
    "prereq": {}
  },
  {
    "uid": "813973",
    "code": "PSY4521",
    "subject": "PSY",
    "number": "4521",
    "honors": false,
    "writing": false,
    "name": "Psychology of Stress & Trauma",
    "fullname": "Psychology of Stress and Trauma",
    "info": "This course covers the major theories and research findings related to stress and trauma, including the effects of stress and trauma on mental and physical health, factors related to more effective coping with stress/trauma and interventions designed to decrease the negative effects of stress and trauma. Course material will highlight research related to stress and coping with the COVID-19 pandemic. The course focuses on both research methods and personal application of research findings. \n\nprereq: PSY 1001 and 3001W or PSY 3001V or CPSY 3308W",
    "prereq": {
      "or": [
        "006265",
        "799440",
        "002365"
      ]
    }
  },
  {
    "uid": "006499",
    "code": "PSY4801",
    "subject": "PSY",
    "number": "4801",
    "honors": false,
    "writing": false,
    "name": "Intro Stat",
    "fullname": "Introduction to Statistics",
    "info": "Descriptive/inferential statistics, hypothesis testing, correlation, regression.",
    "prereq": {}
  },
  {
    "uid": "826644",
    "code": "PSY4802",
    "subject": "PSY",
    "number": "4802",
    "honors": false,
    "writing": false,
    "name": "R and Reproducible Research",
    "fullname": "Using R to Create Reproducible Research in Psychology",
    "info": "Conducting psychological research involves collecting data, but what happens next? Completing research projects involves more than just analyzing data. In this course, we will learn how to incorporate Open Science tools like R programming into the research process in order to generate reproducible and transparent analyses. Specifically, students will learn how to clean data, and create R Markdown files that contain statistics, data visualizations, and interpretations. Finally, students will learn how to share their code and data via GitHub and the Open Science Framework as well as how to use and evaluate each other’s code. A large component of this course will involve applying R skills and Open Science knowledge in a group secondary data analysis project that will culminate in a brief presentation. Completion of PSY 3801 is strongly recommended, but not required.",
    "prereq": {}
  },
  {
    "uid": "795234",
    "code": "PSY4960",
    "subject": "PSY",
    "number": "4960",
    "honors": false,
    "writing": false,
    "name": "Seminar in Psychology",
    "fullname": "Seminar in Psychology",
    "info": "Seminars in subjects of current interest in Psychology.\n\nprereq: [1001, psych major] or instr consent",
    "prereq": {
      "or": [
        "006265"
      ]
    }
  },
  {
    "uid": "787823",
    "code": "PSY4993",
    "subject": "PSY",
    "number": "4993",
    "honors": false,
    "writing": false,
    "name": "Directed Research in Psych",
    "fullname": "Directed Research: Special Areas of Psychology and Related Sciences",
    "info": "Directed research projects in psychology.\n\nprereq: instr consent, dept consent",
    "prereq": {}
  },
  {
    "uid": "817506",
    "code": "PSY5011",
    "subject": "PSY",
    "number": "5011",
    "honors": false,
    "writing": false,
    "name": "Applied Behavior Analysis",
    "fullname": "Applied Behavior Analysis",
    "info": "Psychology 4011/5011: Applied Behavior Analysis\nSpring Semester Only\nThis course focuses on the basic concepts of applied behavior analysis and their practical application to improving the human condition. Students learn how behavioral principles are applied to the development of the everyday behavior of both humans and nonhumans. Students also learn about the analysis and solution of the important behavior problems that can face all children and adults. The course illustrates why and how to collect and analyze behavioral data and how to design and implement behavior intervention programs. Issues in professional ethics and clients’ rights are also discussed. Psy 4011/5011 can serve as preparation for the exams of the international Behavior Analyst Certification Board (see www.bacb.com).",
    "prereq": {}
  },
  {
    "uid": "006508",
    "code": "PSY5012",
    "subject": "PSY",
    "number": "5012",
    "honors": false,
    "writing": false,
    "name": "Learning/Cognition in Animals",
    "fullname": "Learning and Cognition in Animals",
    "info": "Review/evaluation of key questions, methods, theories, and data about forms of learning and elementary cognitive processes. Emphasizes animal models. Implications for human learning/behavior.\n\nprereq: 3011 or 4011 or honors or grad student or instr consent",
    "prereq": {
      "or": [
        "006264",
        "006505"
      ]
    }
  },
  {
    "uid": "007340",
    "code": "PSY5013",
    "subject": "PSY",
    "number": "5013",
    "honors": false,
    "writing": false,
    "name": "Conditioning Lab",
    "fullname": "Laboratory in Conditioning and Learning",
    "info": "Exercises exploring forms of animal conditioning/learning. Combines prepared/independent exercises.",
    "prereq": {}
  },
  {
    "uid": "006509",
    "code": "PSY5014",
    "subject": "PSY",
    "number": "5014",
    "honors": false,
    "writing": false,
    "name": "Psy of Human Learning & Memory",
    "fullname": "Psychology of Human Learning and Memory",
    "info": "Human memory encoding/retrieval. How we adaptively use memory. Brain systems that support memory. Episodic/semantic memory. Working/short-term memory. Procedural memory. Repetition priming. Prospective remembering. Autobiographical memory.\n\nprereq: 3011 or 3051 or honors or grad student",
    "prereq": {
      "or": [
        "006264",
        "006457"
      ]
    }
  },
  {
    "uid": "006510",
    "code": "PSY5015",
    "subject": "PSY",
    "number": "5015",
    "honors": false,
    "writing": false,
    "name": "Cognit,Comput,Brain",
    "fullname": "Cognition, Computation, and Brain",
    "info": "Human cognitive abilities (perception, memory, attention) from different perspectives (e.g., cognitive psychological approach, cognitive neuroscience approach).\n\nprereq: [Honors or grad] or [[jr or sr], [3011 or 3031 or 3051 or 3061]] or instr consent",
    "prereq": {
      "or": [
        {
          "and": [
            {
              "or": [
                "006264",
                "006360",
                "006457",
                "006460"
              ]
            }
          ]
        }
      ]
    }
  },
  {
    "uid": "817519",
    "code": "PSY5016",
    "subject": "PSY",
    "number": "5016",
    "honors": false,
    "writing": false,
    "name": "Behavior Analysis and Autism",
    "fullname": "Behavior Analysis and Autism",
    "info": "Psy 4016/5016: Behavior Analysis and Autism\nFall Semester Only\nThis practicum course is a special service-learning opportunity on current Applied Behavior Analysis (ABA) interventions for children who suffer from the challenges of autism. In this practicum, students gain substantial experience working with children in off-campus settings under the supervision of Board Certified Behavior Analysts who are engaged in the direct application of ABA and behavior therapy. This field experience involves a minimum of 7 hours per week for 12 weeks. Each week, the students participate in two 3-hour, one-on-one therapy sessions at either a home-based or center-based ABA program site, plus one 1-hour clinical review meeting at that site. Students also attend one 1.5-hour lecture/discussion session and complete weekly reading assignments. Students are introduced to the principles and methods currently employed to help young children with autism acquire functional language and appropriate social behavior, and control autistic behavior. Issues of professional ethics, social responsibility, and scientific and moral philosophy pertaining to the treatment of children with autism are also addressed. Grading is based on appropriate participation in the service-learning activities, competency evaluations at the service-learning site, and performance on a final exam. The prerequisite for the course is either Psy 4011/5011: Applied Behavior Analysis, or a comparable course or experience. Students who have prior mastery of the technical vocabulary of ABA are given preference.\n\nprereq: Individual auto transportation, instr consent",
    "prereq": {
      "or": [
        "006505",
        "817506"
      ]
    }
  },
  {
    "uid": "006511",
    "code": "PSY5031W",
    "subject": "PSY",
    "number": "5031",
    "honors": false,
    "writing": true,
    "name": "Perception",
    "fullname": "Perception",
    "info": "Cognitive, computational, and neuroscience perspectives on visual perception. Topics include color vision, pattern vision, image formation in the eye, object recognition, reading, and impaired vision.\n\nprereq: 3031 or 3051 or instr consent",
    "prereq": {
      "or": [
        "006360",
        "006457"
      ]
    }
  },
  {
    "uid": "006512",
    "code": "PSY5034",
    "subject": "PSY",
    "number": "5034",
    "honors": false,
    "writing": false,
    "name": "Psychobiol Vision",
    "fullname": "Psychobiology of Vision",
    "info": "Analysis of the properties and biological bases of visual perception in humans and animals. Emphasis on color vision, visual sensitivity and adaptation, nerve cells and circuits in the eye, structure and function of the visual brain.",
    "prereq": {}
  },
  {
    "uid": "010278",
    "code": "PSY5036W",
    "subject": "PSY",
    "number": "5036",
    "honors": false,
    "writing": true,
    "name": "Computational Vision",
    "fullname": "Computational Vision",
    "info": "Applications of psychology, neuroscience, computer science to design principles underlying visual perception, visual cognition, action. Compares biological/physical processing of images with respect to image formation, perceptual organization, object perception, recognition, navigation, motor control.\n\nprereq: [[3031 or 3051], [Math 1272 or equiv]] or instr consent",
    "prereq": {
      "and": [
        {
          "or": [
            "006360",
            "006457"
          ]
        },
        {
          "or": [
            "000121"
          ]
        }
      ]
    }
  },
  {
    "uid": "006513",
    "code": "PSY5037",
    "subject": "PSY",
    "number": "5037",
    "honors": false,
    "writing": false,
    "name": "Psy of Hearing",
    "fullname": "Psychology of Hearing",
    "info": "Biological and physical aspects of hearing, auditory psychophysics, theories and models of hearing, perception of complex sounds including music and speech. Clinical/other applications.\n\nPrereq: Instructor permission",
    "prereq": {}
  },
  {
    "uid": "006514",
    "code": "PSY5038W",
    "subject": "PSY",
    "number": "5038",
    "honors": false,
    "writing": true,
    "name": "Neural Networks",
    "fullname": "Introduction to Neural Networks",
    "info": "Parallel distributed processing  models in neural/cognitive science. Linear models, Hebbian rules, self-organization, non-linear networks, optimization, representation of information. Applications to sensory processing, perception, learning, memory.\n\nprereq: [[3061 or NSC 3102], [MATH 1282 or 2243]] or  instr consent",
    "prereq": {
      "and": [
        {
          "or": [
            "006460"
          ]
        },
        {
          "or": [
            "016336",
            "000280"
          ]
        }
      ]
    }
  },
  {
    "uid": "006515",
    "code": "PSY5051W",
    "subject": "PSY",
    "number": "5051",
    "honors": false,
    "writing": true,
    "name": "Human-Mach Interact",
    "fullname": "Psychology of Human-Machine Interaction",
    "info": "Cognitive-science approach to human-machine interaction. Analysis of human errors, human-machine system evaluation, human-computer interaction, bionic interfaces, adaptive technology for visually impaired people.",
    "prereq": {}
  },
  {
    "uid": "819048",
    "code": "PSY5052",
    "subject": "PSY",
    "number": "5052",
    "honors": false,
    "writing": false,
    "name": "Psychology of Attention",
    "fullname": "Psychology of Attention",
    "info": "Is attention needed for perception? Are we more likely to attend to locations associated with reward? Does brain training work? Are attention deficits at the root of autism spectrum disorders? This course will introduce students to advanced topics in the psychology of attention. It will combine didactic lecturing, instructor-led discussions, and student-led discussions on core topics of attention and its neural substrates. Students will acquire familiarity with theories, phenomena, and experimental paradigms of attention. \n\nprereq: Psy 3051 or equivalent",
    "prereq": {
      "or": [
        "006457"
      ]
    }
  },
  {
    "uid": "006516",
    "code": "PSY5054",
    "subject": "PSY",
    "number": "5054",
    "honors": false,
    "writing": false,
    "name": "Psych of Language",
    "fullname": "Psychology of Language",
    "info": "Theories/experimental evidence in past/present conceptions of psychology of language.\n\nprereq: Grad or [[jr or sr], [3011 or 3031 or 3051 or 3061]] or instr consent",
    "prereq": {
      "and": [
        {
          "or": [
            "006264",
            "006360",
            "006457",
            "006460"
          ]
        }
      ]
    }
  },
  {
    "uid": "006517",
    "code": "PSY5061",
    "subject": "PSY",
    "number": "5061",
    "honors": false,
    "writing": false,
    "name": "Neurobiology of Behavior",
    "fullname": "Neurobiology of Behavior",
    "info": "Physiological/neuroanatomical mechanisms underlying behavior of animals, including humans. Neural basis of learning/memory, sleep, wakefulness, and attention processes. Effects of drugs on behavior.",
    "prereq": {}
  },
  {
    "uid": "014910",
    "code": "PSY5062",
    "subject": "PSY",
    "number": "5062",
    "honors": false,
    "writing": false,
    "name": "Cog Neuropsych",
    "fullname": "Cognitive Neuropsychology",
    "info": "Consequences of different types of brain damage on human perception/cognition. Neural mechanisms of normal perceptual/cognitive functions. Vision/attention disorders, split brain, language deficits, memory disorders, central planning deficits. Emphasizes function/phenomenology. Minimal amount of brain anatomy.\n\nprereq: Grad or [[jr or sr], [3011 or 3031 or 3051 or 3061]] or instr consent",
    "prereq": {
      "and": [
        {
          "or": [
            "006264",
            "006360",
            "006457",
            "006460"
          ]
        }
      ]
    }
  },
  {
    "uid": "806387",
    "code": "PSY5063",
    "subject": "PSY",
    "number": "5063",
    "honors": false,
    "writing": false,
    "name": "Introduction to Functional MRI",
    "fullname": "Introduction to Functional MRI",
    "info": "How to understand and perform a brain imaging experiment. Theory and practice of functional MRI experimental design, execution, and data analysis. Students develop experimental materials/acquire and analyze their own functional MRI data. Lectures/lab exercises.\n\nprereq: Jr or sr or grad or instr consent",
    "prereq": {}
  },
  {
    "uid": "789031",
    "code": "PSY5064",
    "subject": "PSY",
    "number": "5064",
    "honors": false,
    "writing": false,
    "name": "Brain and Emotion",
    "fullname": "Brain and Emotion",
    "info": "Introduction to affective neuroscience. How brain promotes emotional/motivated behavior in animals/humans. Biological theories of emotion in historical/current theoretical contexts. Fundamental brain motivational systems, including fear, pleasure, attachment, stress, and regulation of motivated behavior. Implications for emotional development, vulnerability to psychiatric disorders.\n\nprereq: 3061 or 5061 or instr consent",
    "prereq": {
      "or": [
        "006460",
        "006517"
      ]
    }
  },
  {
    "uid": "800226",
    "code": "PSY5065",
    "subject": "PSY",
    "number": "5065",
    "honors": false,
    "writing": false,
    "name": "Functional Imaging: Training",
    "fullname": "Functional Imaging: Hands-on Training",
    "info": "Basic neuroimaging techniques/functional magnetic resonance imaging (fMRI). First half of semester covers basic physical principles. Second half students design/execute fMRI experiment on Siemens 3 Tesla scanner.\n\nprereq: [3801 or equiv], [3061 or NSCI 3101], instr consent",
    "prereq": {
      "and": [
        {
          "or": [
            "798902"
          ]
        },
        {
          "or": [
            "006460",
            "790199"
          ]
        }
      ]
    }
  },
  {
    "uid": "816571",
    "code": "PSY5066",
    "subject": "PSY",
    "number": "5066",
    "honors": false,
    "writing": false,
    "name": "Neurosci, Philosophy & Ethics",
    "fullname": "Neuroscience, Philosophy and Ethics",
    "info": "Neuroscience increasingly allows us to explain the human experience in terms of mechanistic, electrochemical processes. The current course explores philosophical issues sparked by these developments in two modules. The first module examines the ways in which human neuroscience may shed new light on age-long philosophical quagmires such as mind-body dualism, free-will, and consciousness. For example, will neuroscience solve the mind-body problem by providing a wholly physical account of human nature? Is the neural view of decision making as a logical consequence of brain states incompatible with free-will? Can all of conscious experience (qualia) be reduced to neurobiology? The second module turns to neuro-ethical questions regarding the potential benefits and harms neuroscience might bring to the moral fabric of society.",
    "prereq": {}
  },
  {
    "uid": "006521",
    "code": "PSY5135",
    "subject": "PSY",
    "number": "5135",
    "honors": false,
    "writing": false,
    "name": "Individual Differences",
    "fullname": "Psychology of Individual Differences",
    "info": "Differential methods in study of human behavior. Psychological traits. Influence of age, sex, heredity, and environment in individual/group differences in ability, personality, interests, and social attitudes.\n\nprereq: [3001W or equiv] or [5862 or equiv] or  instr consent",
    "prereq": {
      "or": [
        {
          "or": [
            "799440"
          ]
        },
        {
          "or": [
            "006625"
          ]
        }
      ]
    }
  },
  {
    "uid": "006522",
    "code": "PSY5136",
    "subject": "PSY",
    "number": "5136",
    "honors": false,
    "writing": false,
    "name": "Human Abilities",
    "fullname": "Human Abilities",
    "info": "Theory, methods, and applications of research in human abilities. Intelligence, aptitude, achievement, specific abilities, information processing/learning and intelligence, aptitude/treatment interactions, and quantitative measurement issues.\n\nprereq: [3001W or 3001V], [3135 or 5135], [5862 or equiv] or instr consent",
    "prereq": {
      "or": [
        {
          "or": [
            "799440"
          ]
        },
        {
          "or": [
            "006479",
            "006521"
          ]
        },
        {
          "or": [
            "006625"
          ]
        }
      ]
    }
  },
  {
    "uid": "006520",
    "code": "PSY5137",
    "subject": "PSY",
    "number": "5137",
    "honors": false,
    "writing": false,
    "name": "Behav Genetics",
    "fullname": "Introduction to Behavioral Genetics",
    "info": "Genetic methods for studying human/animal behavior. Emphasizes nature/origin of individual differences in behavior. Twin and adoption methods. Cytogenetics, molecular genetics, linkage/association studies.\n\nprereq: 3001W or equiv or instr consent",
    "prereq": {
      "or": [
        "799440"
      ]
    }
  },
  {
    "uid": "006598",
    "code": "PSY5138",
    "subject": "PSY",
    "number": "5138",
    "honors": false,
    "writing": false,
    "name": "Adult Development and Aging",
    "fullname": "Adult Development and Aging",
    "info": "Theories/findings concerning age-related changes in mental health, personality, cognitive functioning, productivity are reviewed/interpreted within context of multiple biological, social, and psychological changes that accompany age.\n\nprereq: Junior, Senior or Graduate Student",
    "prereq": {}
  },
  {
    "uid": "006599",
    "code": "PSY5202",
    "subject": "PSY",
    "number": "5202",
    "honors": false,
    "writing": false,
    "name": "Attitudes and Social Behavior",
    "fullname": "Attitudes and Social Behavior",
    "info": "Theory/research on social psychology of beliefs/attitudes. Persuasion principles.\n\nprereq: 3201 or instr consent",
    "prereq": {
      "or": [
        "006484"
      ]
    }
  },
  {
    "uid": "006600",
    "code": "PSY5204",
    "subject": "PSY",
    "number": "5204",
    "honors": false,
    "writing": false,
    "name": "Interpersonal Relationships",
    "fullname": "Psychology of Interpersonal Relationships",
    "info": "Introduction to interpersonal relationship theory/research findings.\n\nprereq: Honors or grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "006603",
    "code": "PSY5205",
    "subject": "PSY",
    "number": "5205",
    "honors": false,
    "writing": false,
    "name": "Applied Soc Psy",
    "fullname": "Applied Social Psychology",
    "info": "Applications of social psychology research/theory to domains such as physical/mental health, education, the media, desegregation, the legal system, energy conservation, public policy.\n\nprereq: 3201 or grad student or instr consent",
    "prereq": {
      "or": [
        "006484"
      ]
    }
  },
  {
    "uid": "006608",
    "code": "PSY5206",
    "subject": "PSY",
    "number": "5206",
    "honors": false,
    "writing": false,
    "name": "Social Psych & Health Behavior",
    "fullname": "Social Psychology and Health Behavior",
    "info": "Survey of social psychological theory/research regarding the processes that shape people's beliefs about health and how these beliefs affect and are affected by their health behavior. Consideration of how theory and evidence regarding these processes informs the development and testing of intervention strategies to promote health behavior change.\n\nPrerequisite: Psy 3201",
    "prereq": {}
  },
  {
    "uid": "006610",
    "code": "PSY5207",
    "subject": "PSY",
    "number": "5207",
    "honors": false,
    "writing": false,
    "name": "Personality & Social Behavior",
    "fullname": "Personality and Social Behavior",
    "info": "Conceptual/methodological strategies for scientific study of individuals and their social worlds. Applications of theory/research to issues of self, identity, and social interaction.\n\nprereq: 3101 or 3201 or honors or grad student or instr consent",
    "prereq": {
      "or": [
        "006475",
        "006484"
      ]
    }
  },
  {
    "uid": "006612",
    "code": "PSY5501",
    "subject": "PSY",
    "number": "5501",
    "honors": false,
    "writing": false,
    "name": "Self, Society and Health",
    "fullname": "Self, Society and Health - What's Work Got To Do With It?",
    "info": "Survey of history, concepts, theories, methods, and findings of vocational/occupational health psychology. Burnout, personality, violence, stressors/stress-relations, counter productive behaviors, coping in workplace. Vocational development/assessment, career decision-making/counseling, person-environment fit.\n\nprereq: 3001W or equiv or instr consent",
    "prereq": {
      "or": [
        "799440"
      ]
    }
  },
  {
    "uid": "006619",
    "code": "PSY5606",
    "subject": "PSY",
    "number": "5606",
    "honors": false,
    "writing": false,
    "name": "Clin Psychophys",
    "fullname": "Clinical Psychophysiology",
    "info": "How psychophysiological methods such as autonomic/central nervous system recording are used in studying major psychopathological disorders.",
    "prereq": {}
  },
  {
    "uid": "009944",
    "code": "PSY5701",
    "subject": "PSY",
    "number": "5701",
    "honors": false,
    "writing": false,
    "name": "Employee Selection & Staffing",
    "fullname": "Employee Selection and Staffing",
    "info": "Application of psychological research/theory to issues in personnel recruitment/selection and to measurement of job performance. Applying principles of individual differences, psychological measurement to decision making in organizations (recruitment, selection, performance appraisal). Prerequisite: Psy 3001W, Psy 3711 or Instructor Permission",
    "prereq": {}
  },
  {
    "uid": "010605",
    "code": "PSY5702",
    "subject": "PSY",
    "number": "5702",
    "honors": false,
    "writing": false,
    "name": "Ind'l Beh in Orgs",
    "fullname": "Psychological Foundations of Individual Behavior in Organizations",
    "info": "Theory/research on human behavior/performance in organizations. Organizational socialization processes across career span, leadership styles/processes, work team structures/characteristics. Problem-solving, decision-making processes. Group dynamics, inter-group relations.",
    "prereq": {}
  },
  {
    "uid": "010613",
    "code": "PSY5703",
    "subject": "PSY",
    "number": "5703",
    "honors": false,
    "writing": false,
    "name": "Organizational Training & Dev",
    "fullname": "Psychology of Organizational Training and Development",
    "info": "Theories, methods, research, and practice of improving performance of individuals at work through adult learning and instruction, including needs analysis, learning philosophy, models of program and instructional design, theory of knowledge and training transfer, learning analytics, and training evaluation.\n\nPrerequisites:\tPSY 3801 or equivalent",
    "prereq": {}
  },
  {
    "uid": "010621",
    "code": "PSY5705",
    "subject": "PSY",
    "number": "5705",
    "honors": false,
    "writing": false,
    "name": "Work Motivation",
    "fullname": "Psychology of Work Motivation",
    "info": "Motivation issues related to the behavior and performance of individuals in organizational settings. Contemporary work motivation theories and practices that relate person factors and environmental factors  to skill acquisition, job performance, organizational citizenship behavior, and job satisfaction.",
    "prereq": {}
  },
  {
    "uid": "791379",
    "code": "PSY5707",
    "subject": "PSY",
    "number": "5707",
    "honors": false,
    "writing": false,
    "name": "Personnel Psychology",
    "fullname": "Personnel Psychology",
    "info": "Application of psychological research/theory regarding individual differences, psychological measurement, decision making, and learning to personnel selection, performance assessment, and occupational training. Job analysis, recruitment, selection decisions, performance appraisals, and training design, evaluation, and practice.\n\nprereq: [[3001W or equiv], 3711] or instr consent",
    "prereq": {
      "and": [
        {
          "or": [
            "799440"
          ]
        },
        "009935"
      ]
    }
  },
  {
    "uid": "791409",
    "code": "PSY5708",
    "subject": "PSY",
    "number": "5708",
    "honors": false,
    "writing": false,
    "name": "Organizational Psychology",
    "fullname": "Organizational Psychology",
    "info": "Psychological causes of behavior in work organizations. Consequences for individual fulfillment and organizational effectiveness. Individual differences, social perception, motivation, stress, job design, leadership, job satisfaction, teamwork, organizational culture.\n\nPrereq: Psy 3001W or 3001V and 3711 OR Psy grad",
    "prereq": {}
  },
  {
    "uid": "006625",
    "code": "PSY5862",
    "subject": "PSY",
    "number": "5862",
    "honors": false,
    "writing": false,
    "name": "Psy Measurement",
    "fullname": "Psychological Measurement: Theory and Methods",
    "info": "Types of measurements (tests, scales, inventories) and their construction. Theory/measurement of reliability/validity.\n\nprereq: 3801H or MATH 1271 or grad student",
    "prereq": {
      "or": [
        "000120"
      ]
    }
  },
  {
    "uid": "006627",
    "code": "PSY5865",
    "subject": "PSY",
    "number": "5865",
    "honors": false,
    "writing": false,
    "name": "Measurement of Latent Traits",
    "fullname": "Measurement of Latent Traits",
    "info": "Virtually all psychological variables are latent, i.e., not directly observable.  Consequently, they are measured by observing manifestations of them that are assumed to adequately reflect the underlying latent variables.  These observables are typically test questions that have predetermined correct and incorrect options for ability, achievement, and other cognitive variables. For personality, attitudes, and other variables the test questions are based on self report. Two general types of theories are in use for measuring both types of these variables—classical test theory (CTT) and item response theory (IRT).  Both theories address measurement issues for both types of variables differently. Taking a practical approach, this course compares both theories in terms of the methods for constructing, refining, scoring, interpretation, applications, and criteria for evaluating the adequacy of measuring instruments developed by both CTT and IRT. Topics include methods of item analysis, special problems of the two types of methods that are unique to the two general types of variables, and special topics including equating, differential item functioning, and multidimensionality. Advantages and limitations of both CTT and IRT will also be discussed.\t",
    "prereq": {}
  },
  {
    "uid": "010882",
    "code": "PSY5960",
    "subject": "PSY",
    "number": "5960",
    "honors": false,
    "writing": false,
    "name": "Topics in Psychology",
    "fullname": "Topics in Psychology",
    "info": "Special course or seminar. Topics listed in Class Schedule.\n\nprereq: PSY 1001, [jr or sr or grad student]",
    "prereq": {
      "and": [
        "006265"
      ]
    }
  },
  {
    "uid": "799891",
    "code": "PSY5993",
    "subject": "PSY",
    "number": "5993",
    "honors": false,
    "writing": false,
    "name": "Research Lab in Psychology",
    "fullname": "Research Laboratory in Psychology",
    "info": "Laboratory instruction and seminars in faculty research areas.\n\nprereq: instr consent, dept consent",
    "prereq": {}
  },
  {
    "uid": "006630",
    "code": "PSY5994",
    "subject": "PSY",
    "number": "5994",
    "honors": false,
    "writing": false,
    "name": "Dir Rsrch: Psy Honors Thesis",
    "fullname": "Directed Research: Psy Honors Thesis",
    "info": "Individual research/writing of departmental honors thesis. \n\nPre-req: PSY 4994V\n\n",
    "prereq": {}
  },
  {
    "uid": "010436",
    "code": "PSY8004",
    "subject": "PSY",
    "number": "8004",
    "honors": false,
    "writing": false,
    "name": "Philosophical Psychology",
    "fullname": "Philosophical Psychology",
    "info": "Selected philosophical/methodological problems.\n\nprereq: Grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "010626",
    "code": "PSY8010",
    "subject": "PSY",
    "number": "8010",
    "honors": false,
    "writing": false,
    "name": "Topics in Learning",
    "fullname": "Advanced Topics in Learning",
    "info": "Contemporary topics in learning and behavior theory.\n\nprereq: 5012 or instr consent",
    "prereq": {
      "or": [
        "006508"
      ]
    }
  },
  {
    "uid": "010629",
    "code": "PSY8020",
    "subject": "PSY",
    "number": "8020",
    "honors": false,
    "writing": false,
    "name": "Sem Condtng & Learn",
    "fullname": "Seminar in Conditioning and Learning",
    "info": "Review and discussion of ongoing research and prospectives on future research.",
    "prereq": {}
  },
  {
    "uid": "791326",
    "code": "PSY8026",
    "subject": "PSY",
    "number": "8026",
    "honors": false,
    "writing": false,
    "name": "Neuro-Immu Intrctns",
    "fullname": "Neuro-Immune Interactions",
    "info": "Regulatory systems (neuroendocrine, cytokine, and autonomic nervous systems) linking brain and immune systems in brain-immune axis. Functional effects of bidirectional brain-immune regulation.\n\nprereq: MicB 4131 or equiv, NSc 5111 or equiv",
    "prereq": {
      "or": [
        "009267"
      ]
    }
  },
  {
    "uid": "011188",
    "code": "PSY8031",
    "subject": "PSY",
    "number": "8031",
    "honors": false,
    "writing": false,
    "name": "Sem: Visual Perception",
    "fullname": "Seminar: Visual Perception",
    "info": "Cognitive, psychological, neurophysiological determinants of visual perception. Current research.\n\nprereq: 5031 or instr consent",
    "prereq": {
      "or": [
        "006511"
      ]
    }
  },
  {
    "uid": "790406",
    "code": "PSY8036",
    "subject": "PSY",
    "number": "8036",
    "honors": false,
    "writing": false,
    "name": "Topics: Computational Vision",
    "fullname": "Topics in Computational Vision",
    "info": "Recent research in visual psychophysics, visual neuroscience, and computer vision.\n\nprereq: 5031 or 5036 or equiv or instr consent",
    "prereq": {
      "or": [
        "006511",
        "010278"
      ]
    }
  },
  {
    "uid": "010633",
    "code": "PSY8037",
    "subject": "PSY",
    "number": "8037",
    "honors": false,
    "writing": false,
    "name": "Psychophys and Aud",
    "fullname": "Psychophysics and Audition",
    "info": "Modern/classical psychophysics. Psychophysical/physiological correlates of audition. Theories of hearing.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "807956",
    "code": "PSY8041",
    "subject": "PSY",
    "number": "8041",
    "honors": false,
    "writing": false,
    "name": "Proseminar in Perception",
    "fullname": "Proseminar in Perception",
    "info": "Seminar. Advanced topics in auditory and visual perception. Lecture, discussion, and student-led presentations of research papers on core topics of the peripheral visual and auditory systems, cortical representations, behavioral and brain-imaging methods, and computational approaches to understanding/simulating perception.\n\nprereq: Psy grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "807351",
    "code": "PSY8042",
    "subject": "PSY",
    "number": "8042",
    "honors": false,
    "writing": false,
    "name": "Prosem Cog, Brain, Behavior",
    "fullname": "Proseminar in Cognition, Brain, and Behavior",
    "info": "Advanced topics in cognition, brain, and behavior. Lecture, discussion, and student-led presentations of research papers on core topics of attention, memory, emotion, categorization, thinking, and language, and intersections between these areas.\n\nprereq: Psy grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "013747",
    "code": "PSY8055",
    "subject": "PSY",
    "number": "8055",
    "honors": false,
    "writing": false,
    "name": "Cognitive Neuroscience",
    "fullname": "Seminar: Cognitive Neuroscience",
    "info": "Recent advances in analysis of neural bases of cognitive functions.\n\nprereq: 5015 or instr consent",
    "prereq": {
      "or": [
        "006510"
      ]
    }
  },
  {
    "uid": "010634",
    "code": "PSY8056",
    "subject": "PSY",
    "number": "8056",
    "honors": false,
    "writing": false,
    "name": "Psych of Language",
    "fullname": "Seminar: Psychology of Language",
    "info": "Selected topics in psycholinguistics.\n\nprereq: Grad psych major or instr consent",
    "prereq": {}
  },
  {
    "uid": "788966",
    "code": "PSY8060",
    "subject": "PSY",
    "number": "8060",
    "honors": false,
    "writing": false,
    "name": "Neural Substrates of Mental Pr",
    "fullname": "Seminar: Neural Substrates of Mental Processes",
    "info": "Neurobiological substrates of psychological processes such as memory, attention, and emotion. Neurobiological substrates of mental dysfunction.",
    "prereq": {}
  },
  {
    "uid": "802259",
    "code": "PSY8061",
    "subject": "PSY",
    "number": "8061",
    "honors": false,
    "writing": false,
    "name": "Neuropsychopharmacology",
    "fullname": "Neuropsychopharmacology",
    "info": "Relationships between biochemical, neurophysiological, psychological, and behavioral effects of drugs. Research in neuropharmacology, behavioral pharmacology, and pharmacology of addiction.\n\nprereq: 5xxx coursework in biological psych or neuroscience or pharmacology or instr consent",
    "prereq": {}
  },
  {
    "uid": "791089",
    "code": "PSY8070",
    "subject": "PSY",
    "number": "8070",
    "honors": false,
    "writing": false,
    "name": "Sem: Psychopharmacology",
    "fullname": "Seminar: Psychopharmacology",
    "info": "Basic issues, contemporary research. Lectures, student presentations.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "820092",
    "code": "PSY8101",
    "subject": "PSY",
    "number": "8101",
    "honors": false,
    "writing": false,
    "name": "NSF Grad Fellowship Seminar",
    "fullname": "NSF Graduate Fellowship Proposal Writing Seminar",
    "info": "The primary purpose of this course is to prepare students to submit a competitive NSF Graduate Research Fellowship proposal. Students submitting to other organizations are welcome to join the course, but all of the assignments and focus will be on increasing NSF and predoctoral fellowship competitiveness. This course is intended primarily for doctoral students in their first or second year of study.",
    "prereq": {}
  },
  {
    "uid": "010900",
    "code": "PSY8107",
    "subject": "PSY",
    "number": "8107",
    "honors": false,
    "writing": false,
    "name": "Personality, Culture & Soc",
    "fullname": "Personality, Culture, and Society",
    "info": "Methodological issues and status of current research in intersection of personality, social, and cultural psychology.",
    "prereq": {}
  },
  {
    "uid": "791898",
    "code": "PSY8108",
    "subject": "PSY",
    "number": "8108",
    "honors": false,
    "writing": false,
    "name": "Personality and Intervention",
    "fullname": "Theories of Personality and Intervention",
    "info": "Historical perspective on relationship between theories of personality and formulations of etiology/course of types of psychopathology. Treatment techniques ensuing from different theoretical perspectives. Psychoanalytic thought, works of Carl Rogers, existentialism, Gestalt therapists.",
    "prereq": {}
  },
  {
    "uid": "010479",
    "code": "PSY8112",
    "subject": "PSY",
    "number": "8112",
    "honors": false,
    "writing": false,
    "name": "Psychopathology II",
    "fullname": "Psychopathology II",
    "info": "Etiological bases of psychopathology. Theory/research. Evaluation of current theoretic models and empirical findings regarding nature/causes of varying behavior disorders.",
    "prereq": {}
  },
  {
    "uid": "826990",
    "code": "PSY8121",
    "subject": "PSY",
    "number": "8121",
    "honors": false,
    "writing": false,
    "name": "History and Methods of Psy",
    "fullname": "History and Methods of Psychology",
    "info": "This course is designed to expose students to the history of psychology through a study of the methods used in research over time, with an emphasis on methods used in developmental and personality psychology. Unlike most traditional history of psychology courses, we will focus less on the emergence and differentiation of various schools of psychological thought, and more about the emergence and differentiation of various methods of empirical and theoretical inquiry. Unlike traditional methods courses, we will focus less on specific research designs and analytic techniques, and more on broader issues of inference that permeate all psychological research (i.e., meta-psychology). Unlike both traditional history and methodological courses, we will integrate a focus on the racial and socio-structural aspects of both history and methods. \n\nImportantly, the historical focus of the course will be grounded in contemporary methodological issues in the context of the open science movement, both to illustrate how many of the current issues in the field have persisted for decades, but also to highlight the tremendous advances in potential solutions we have seen in recent years. Through this course, students will develop a basic familiarity with a core set of issues in the history of psychology and will be competent in rudimentary open science and meta-psychology. These skills are intended to greatly enhance the research acumen of the students, both as rigorous producers of new research and informed consumers of existing work.  ",
    "prereq": {}
  },
  {
    "uid": "010425",
    "code": "PSY8201",
    "subject": "PSY",
    "number": "8201",
    "honors": false,
    "writing": false,
    "name": "Social Cog",
    "fullname": "Social Cognition",
    "info": "Social psychological theory/research on social inference and reasoning processes. Psychology of prejudice/stereotyping.\n\nprereq: Psych PhD candidate",
    "prereq": {}
  },
  {
    "uid": "010110",
    "code": "PSY8202",
    "subject": "PSY",
    "number": "8202",
    "honors": false,
    "writing": false,
    "name": "Close Relationships",
    "fullname": "Close Relationships",
    "info": "Classic/contemporary theory/research on close relationships. Emphasizes romantic relationships.\n\nprereq: 5204 or instr consent",
    "prereq": {
      "or": [
        "006600"
      ]
    }
  },
  {
    "uid": "009978",
    "code": "PSY8203",
    "subject": "PSY",
    "number": "8203",
    "honors": false,
    "writing": false,
    "name": "Impr Mgmnt",
    "fullname": "Impression Management",
    "info": "Classic and contemporary theory and research concerning interpersonal strategies of impression management and interplay between private and public self.\n\nprereq: Grad psych major; 8208 recommended; instr consent",
    "prereq": {
      "or": [
        "010235"
      ]
    }
  },
  {
    "uid": "791607",
    "code": "PSY8204",
    "subject": "PSY",
    "number": "8204",
    "honors": false,
    "writing": false,
    "name": "Prejudice/Intergroup Relations",
    "fullname": "Social Psychology of Prejudice and Intergroup Relations",
    "info": "Approaches, findings, and controversies in research on social psychology of prejudice, racial attitudes, and intergroup relations. Focuses on approaches based on social psychology and related work from political science and sociology.",
    "prereq": {}
  },
  {
    "uid": "010229",
    "code": "PSY8205",
    "subject": "PSY",
    "number": "8205",
    "honors": false,
    "writing": false,
    "name": "Principles Social Psychology",
    "fullname": "Principles of Social Psychology",
    "info": "Contemporary theoretical positions and related research.\n\nprereq: Psy PhD student",
    "prereq": {}
  },
  {
    "uid": "010230",
    "code": "PSY8206",
    "subject": "PSY",
    "number": "8206",
    "honors": false,
    "writing": false,
    "name": "Proseminar Social Psychology",
    "fullname": "Proseminar in Social Psychology",
    "info": "Current research topics in social psychology.\n\nprereq: [PSY 8205, Social Psych PhD student] or instr consent",
    "prereq": {
      "and": [
        "010229"
      ]
    }
  },
  {
    "uid": "010430",
    "code": "PSY8207",
    "subject": "PSY",
    "number": "8207",
    "honors": false,
    "writing": false,
    "name": "Soc Psy Hist & Syst",
    "fullname": "Social Psychology History and Systems",
    "info": "Classic theories and research that have shaped contemporary social psychology.",
    "prereq": {}
  },
  {
    "uid": "010235",
    "code": "PSY8208",
    "subject": "PSY",
    "number": "8208",
    "honors": false,
    "writing": false,
    "name": "The Self",
    "fullname": "Social Psychology: The Self",
    "info": "Social psychological theory and research concerning the self and social behavior.\n\nprereq: Psych background especially in personality and soc psych",
    "prereq": {}
  },
  {
    "uid": "010096",
    "code": "PSY8209",
    "subject": "PSY",
    "number": "8209",
    "honors": false,
    "writing": false,
    "name": "Res Meth Soc Psy",
    "fullname": "Research Methods in Social Psychology",
    "info": "Experimental/quasi-experimental methods for research in social psychology. Statistical, interpretive, operational, and ethical issues.\n\nprereq: Psych PhD student",
    "prereq": {}
  },
  {
    "uid": "800662",
    "code": "PSY8210",
    "subject": "PSY",
    "number": "8210",
    "honors": false,
    "writing": false,
    "name": "Law, Race, & Social Psychology",
    "fullname": "Law, Race, and Social Psychology",
    "info": "Interdisciplinary seminar. Scientific foundations for and legal implications of implicit (vs explicit) racial or gender bias in four socio-legal domains: criminal law, affirmative action, employment discrimination, and  legislative redistricting.\n\nprereq: 2nd or 3rd yr law student or PhD student in social science doctoral program",
    "prereq": {}
  },
  {
    "uid": "792268",
    "code": "PSY8211",
    "subject": "PSY",
    "number": "8211",
    "honors": false,
    "writing": false,
    "name": "Proseminar Political Psych 1",
    "fullname": "Proseminar in Political Psychology I",
    "info": "Readings, discussion, and guest speakers. Topics vary each semester.",
    "prereq": {}
  },
  {
    "uid": "792269",
    "code": "PSY8212",
    "subject": "PSY",
    "number": "8212",
    "honors": false,
    "writing": false,
    "name": "Prosem Political Psych II",
    "fullname": "Proseminar in Political Psychology II",
    "info": "Readings, discussion, and guest speakers. Topics vary each semester.",
    "prereq": {}
  },
  {
    "uid": "788265",
    "code": "PSY8333",
    "subject": "PSY",
    "number": "8333",
    "honors": false,
    "writing": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)\n\nprereq: Master's student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "010893",
    "code": "PSY8410",
    "subject": "PSY",
    "number": "8410",
    "honors": false,
    "writing": false,
    "name": "Perspectives in Cog",
    "fullname": "Perspectives in Learning, Perception, and Cognition",
    "info": "Lectures and discussions in cognitive sciences by local and visiting faculty. ",
    "prereq": {}
  },
  {
    "uid": "788404",
    "code": "PSY8444",
    "subject": "PSY",
    "number": "8444",
    "honors": false,
    "writing": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)\n\nprereq: Doctoral student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "009817",
    "code": "PSY8501",
    "subject": "PSY",
    "number": "8501",
    "honors": false,
    "writing": false,
    "name": "Coun Psy:Hist/Theor",
    "fullname": "Counseling Psychology: History and Theories",
    "info": "Introduction to history of counseling psychology and to primary theoretical orientations used by counseling psychologists. For each theory: basic principles, application to counseling practice, and research support.\n\nprereq: Counseling psych grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "009833",
    "code": "PSY8502",
    "subject": "PSY",
    "number": "8502",
    "honors": false,
    "writing": false,
    "name": "Counseling Assess",
    "fullname": "Assessment in Counseling Psychology",
    "info": "Principles and practice. Emphasizes psychometric assessment. History, foundations in measurement, basic methods, survey of instruments, test interpretation evaluation, ethics.\n\nprereq: Counseling psych grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "010025",
    "code": "PSY8503",
    "subject": "PSY",
    "number": "8503",
    "honors": false,
    "writing": false,
    "name": "Interviewing",
    "fullname": "Interviewing and Intervention",
    "info": "Skills-based course: conceptualization of counseling process, stages of counseling, development of counseling skills, and strategies for behavior change.\n\nprereq: Counseling Psy grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "010432",
    "code": "PSY8510",
    "subject": "PSY",
    "number": "8510",
    "honors": false,
    "writing": false,
    "name": "CP Gen Practicum",
    "fullname": "Counseling Psychology Beginning Practicum: General",
    "info": "Beginning applied experiences in counseling psychology settings.\n\nprereq: Counseling Psy grad student",
    "prereq": {}
  },
  {
    "uid": "010451",
    "code": "PSY8511",
    "subject": "PSY",
    "number": "8511",
    "honors": false,
    "writing": false,
    "name": "CP Gen Practicum",
    "fullname": "Counseling Psychology Beginning Practicum: General",
    "info": "Beginning applied experiences in counseling psychology settings.\n\nprereq: Counseling Psy grad student",
    "prereq": {}
  },
  {
    "uid": "010482",
    "code": "PSY8512",
    "subject": "PSY",
    "number": "8512",
    "honors": false,
    "writing": false,
    "name": "CP Gen Practicum",
    "fullname": "Counseling Psychology Beginning Practicum:  General",
    "info": "Beginning applied experiences in counseling psychology settings.\n\nprereq: Counseling Psy grad student",
    "prereq": {}
  },
  {
    "uid": "792037",
    "code": "PSY8514",
    "subject": "PSY",
    "number": "8514",
    "honors": false,
    "writing": false,
    "name": "U Counseling Practicum I",
    "fullname": "University Counseling Practicum I",
    "info": "Integrates science with supervised practice in University Counseling and Consulting Services (UCCS) involving career, academic, and personal counseling clientele.\n\nprereq: Counseling Psy grad student, instr consent",
    "prereq": {}
  },
  {
    "uid": "792038",
    "code": "PSY8515",
    "subject": "PSY",
    "number": "8515",
    "honors": false,
    "writing": false,
    "name": "U Couns Practicum",
    "fullname": "University Counseling Practicum II",
    "info": "Integrates science with supervised practice in University Counseling and Consulting Services (UCCS) involving career, academic, and personal counseling clientele.\n\nprereq: Counseling Psy grad student",
    "prereq": {}
  },
  {
    "uid": "010060",
    "code": "PSY8541",
    "subject": "PSY",
    "number": "8541",
    "honors": false,
    "writing": false,
    "name": "Multicultural Psychology",
    "fullname": "Multicultural Psychology",
    "info": "Approaches, findings, and controversies in research on psychology of ethnic/racial minorities and other cultural populations. Emphasizes counseling/community applications of theory/research. Lecture, discussion, lab.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "010092",
    "code": "PSY8544",
    "subject": "PSY",
    "number": "8544",
    "honors": false,
    "writing": false,
    "name": "Vocation/Occupation Health Psy",
    "fullname": "Vocational and Occupational Health Psychology Research",
    "info": "Research problems specific to special populations, vocational research, assessment/testing, findings in these areas useful to counseling psychology practice.\n\nprereq: [[8501, 8502, 8503] or equiv], counseling psych grad student, instr consent",
    "prereq": {
      "and": [
        "009817",
        "009833",
        "010025"
      ]
    }
  },
  {
    "uid": "010197",
    "code": "PSY8545",
    "subject": "PSY",
    "number": "8545",
    "honors": false,
    "writing": false,
    "name": "Couns Process/Outcome Research",
    "fullname": "Counseling Psychology Process and Outcome Research",
    "info": "Research methods, empirically-supported interventions, assessing treatment outcomes in practice, research on the counseling process, applying counseling research in counseling practice and in non-counseling contexts in the \"real world.\" Ethics and standards of research, history of counseling process and outcome research.\n\nprereq: [[8501, 8502, 8503] or equiv], counseling psy grad student, instr consent",
    "prereq": {
      "and": [
        "009817",
        "009833",
        "010025"
      ]
    }
  },
  {
    "uid": "010392",
    "code": "PSY8550",
    "subject": "PSY",
    "number": "8550",
    "honors": false,
    "writing": false,
    "name": "Assessment: WAIS-III",
    "fullname": "Assessment: WAIS-III",
    "info": "Skills acquisition for administering, scoring, summarizing results of Wechsler Adult Intelligence Scale-III (WAIS-III).",
    "prereq": {}
  },
  {
    "uid": "010411",
    "code": "PSY8554",
    "subject": "PSY",
    "number": "8554",
    "honors": false,
    "writing": false,
    "name": "Career & Occupational Health",
    "fullname": "Career and Occupational Health Psychology Assessment",
    "info": "History of vocational interest inventories/measures related to career development, and of assessments used in occupational health psychology. Scale construction methodology. Research applications. Interpretation/use of instruments.",
    "prereq": {}
  },
  {
    "uid": "010636",
    "code": "PSY8560",
    "subject": "PSY",
    "number": "8560",
    "honors": false,
    "writing": false,
    "name": "Gen Adv Practicum",
    "fullname": "Counseling Psychology Advanced Practicum I: General",
    "info": "Applied practice experience in counseling psychology settings and seminars. May include guest speakers, readings, and student presentations.\n\nprereq: Counseling psy grad student, instr consent",
    "prereq": {}
  },
  {
    "uid": "010650",
    "code": "PSY8561",
    "subject": "PSY",
    "number": "8561",
    "honors": false,
    "writing": false,
    "name": "Gen Adv Practicum",
    "fullname": "Counseling Psychology Advanced Practicum II: General",
    "info": "Applied practice experience in counseling psychology settings and seminar that may include guest speakers, readings, and student presentations on topics relevant to clients and settings of practice experiences.\n\nprereq: Counseling psy grad student, instr consent",
    "prereq": {}
  },
  {
    "uid": "010665",
    "code": "PSY8562",
    "subject": "PSY",
    "number": "8562",
    "honors": false,
    "writing": false,
    "name": "Gen Adv Practicum",
    "fullname": "Counseling Psychology Advanced Practicum III: General",
    "info": "Applied practice experience in counseling psychology settings and seminar that may include guest speakers, readings, and students presentations on topics relevant to clients and settings of practice experiences.\n\nprereq: Counseling psy grad student, instr consent",
    "prereq": {}
  },
  {
    "uid": "010428",
    "code": "PSY8564",
    "subject": "PSY",
    "number": "8564",
    "honors": false,
    "writing": false,
    "name": "Voc Co for Work Adj",
    "fullname": "Vocational Counseling for Work Adjustment",
    "info": "Topics and problems. Research, operationalization, and application of theory of work adjustment to vocational counseling.",
    "prereq": {}
  },
  {
    "uid": "010677",
    "code": "PSY8565",
    "subject": "PSY",
    "number": "8565",
    "honors": false,
    "writing": false,
    "name": "Career Couns & Assess Clinic",
    "fullname": "Counseling Psychology Advanced Practicum I: Career Counseling and Assessment Clinic",
    "info": "Applied practice experience in vocational assessment clinic of Department of Psychology. Career/vocational testing, assessment, decision making.\n\nprereq: Counseling psy grad student, instr consent",
    "prereq": {}
  },
  {
    "uid": "010678",
    "code": "PSY8566",
    "subject": "PSY",
    "number": "8566",
    "honors": false,
    "writing": false,
    "name": "Career Couns &  Assess Clinic",
    "fullname": "Counseling Psychology Advanced Practicum II: Career Counseling and Assessment Clinic",
    "info": "Applied practice experience in Vocational Assessment Clinic of Department of Psychology. Career/vocational testing, assessment, decision making.\n\nprereq: Counseling psy grad student, instr consent",
    "prereq": {}
  },
  {
    "uid": "010684",
    "code": "PSY8567",
    "subject": "PSY",
    "number": "8567",
    "honors": false,
    "writing": false,
    "name": "Career Couns & Assess Clinic",
    "fullname": "Counseling Psychology Advanced Practicum III: Career Counseling and Assessment Clinic",
    "info": "Applied practice experience in Vocational Assessment Clinic of Department of Psychology. Career and vocational testing, assessment, and decision making.\n\nprereq: Counseling psy grad student, instr consent",
    "prereq": {}
  },
  {
    "uid": "016849",
    "code": "PSY8570",
    "subject": "PSY",
    "number": "8570",
    "honors": false,
    "writing": false,
    "name": "Couns Psy Internship I",
    "fullname": "Counseling Psychology Internship I",
    "info": "First part of counseling psychology internship.\n\nprereq: Counseling psy PhD candidate, instr consent",
    "prereq": {}
  },
  {
    "uid": "010688",
    "code": "PSY8571",
    "subject": "PSY",
    "number": "8571",
    "honors": false,
    "writing": false,
    "name": "Couns Psy Internship II",
    "fullname": "Counseling Psychology Internship II",
    "info": "Second part of counseling psychology internship.\n\nprereq: Counseling psy PhD candidate, instr consent",
    "prereq": {}
  },
  {
    "uid": "010689",
    "code": "PSY8572",
    "subject": "PSY",
    "number": "8572",
    "honors": false,
    "writing": false,
    "name": "Couns Psy Internship III",
    "fullname": "Counseling Psychology Internship III",
    "info": "Third part of counseling psychology internship.\n\nprereq: Counseling psy PhD candidate, instr consent",
    "prereq": {}
  },
  {
    "uid": "819019",
    "code": "PSY8601",
    "subject": "PSY",
    "number": "8601",
    "honors": false,
    "writing": false,
    "name": "Clinical Psych Seminar Series",
    "fullname": "Contemporary Directions in Clinical Psychology Research Seminar Series",
    "info": "The central goal of this series is to provide incoming clinical students broad exposure to clinical science methodologies used by CSPR faculty and affiliated scientists in the U of MN community. Each week, faculty will provide an hour long, formal presentation of their research program, emphasizing employed research design and methods. Students will be assigned 1-2 readings relevant to the presentation of the week. Students are encouraged to meet with faculty presenters further to follow-up on specific research methods of interest. This seminar lays the foundation for more in-depth methodological training, in lab-specific areas, to be completed during the Research Laboratories in Psychology course (Psy 5993). \n\nprereq: PhD student in Clinical Psychology",
    "prereq": {}
  },
  {
    "uid": "016038",
    "code": "PSY8602",
    "subject": "PSY",
    "number": "8602",
    "honors": false,
    "writing": false,
    "name": "Psychopathology & Personality",
    "fullname": "Psychopathology & Personality",
    "info": "Psychopathology and Personality. Theory/research. Evaluation of current experimentation in various behavior disorders. \n\nprereq: Clinical psych grad student, instr consent",
    "prereq": {}
  },
  {
    "uid": "819111",
    "code": "PSY8603",
    "subject": "PSY",
    "number": "8603",
    "honors": false,
    "writing": false,
    "name": "Clinical Seminar Series",
    "fullname": "Clinical Seminar Series: Contemporary Directions In Clinical Psychology Research",
    "info": "The central goal of this series is to provide incoming clinical students broad exposure to clinical science methodologies used by CSPR faculty and affiliated scientists in the U of MN community. Each week, faculty will provide an hour long, formal presentation of their research program, emphasizing employed research design and methods. Students will be assigned 1-2 readings relevant to the presentation of the week. Students are encouraged to meet with faculty presenters further to follow-up on specific research methods of interest. This seminar lays the foundation for more in depth methodological training, in lab-specific areas, to be completed during the Research Laboratories in Psychology course (Psy 5993). Additional goals of the seminar include: (a) exposing students to the work of potential mentors, committee members, and/or consultants; (b) prompting students to think through the methodological aspects of their first year project; and (c) providing opportunities to hear from faculty on issues related to career development, work-life balance, and the importance of lifelong learning.",
    "prereq": {}
  },
  {
    "uid": "010470",
    "code": "PSY8611",
    "subject": "PSY",
    "number": "8611",
    "honors": false,
    "writing": false,
    "name": "Neuropsychological Assessment",
    "fullname": "Intellectual and Neuropsychological Assessment: Measurement, Methodology, and Development",
    "info": "Theory/practice in clinical application of assessment techniques/interviewing. Lab observations, administration, scoring, interpretation.\n\nprereq: Clinical psych grad student",
    "prereq": {}
  },
  {
    "uid": "825471",
    "code": "PSY8614",
    "subject": "PSY",
    "number": "8614",
    "honors": false,
    "writing": false,
    "name": "Intell & Neuro Functioning",
    "fullname": "Intellectual and Neuropsychological Assessment",
    "info": "Fundamentals of intellectual and neuropsychological assessment including principles of measurement including reliability, validity, and sources of error in psychological assessment.\n\nprereq: Clinical psych grad student",
    "prereq": {}
  },
  {
    "uid": "825455",
    "code": "PSY8615",
    "subject": "PSY",
    "number": "8615",
    "honors": false,
    "writing": false,
    "name": "Applied Assessment I",
    "fullname": "Professional Methods in Applied Assessment I: Intellectual & Neuropsychological Functioning",
    "info": "Theory/practice in clinical application of assessment techniques/interviewing. Lab observations, administration, scoring, interpretation.\n\nprereq: Clinical psych grad student",
    "prereq": {}
  },
  {
    "uid": "010608",
    "code": "PSY8616",
    "subject": "PSY",
    "number": "8616",
    "honors": false,
    "writing": false,
    "name": "Applied Assessment II",
    "fullname": "Applied Assessment II, Personality and Psychopathology",
    "info": "Theory/practice in clinical application of assessment techniques/interviewing. Lab observations, administration, scoring, interpretation.\n\nprereq: 8611/8615, clinical psych grad student",
    "prereq": {
      "or": [
        "010470",
        "825455"
      ]
    }
  },
  {
    "uid": "010433",
    "code": "PSY8617",
    "subject": "PSY",
    "number": "8617",
    "honors": false,
    "writing": false,
    "name": "Ethics & Equity Clinical Psych",
    "fullname": "Ethical and Equitable Decisions in Clinical Science and Counseling Psychology",
    "info": "Ethical principles/codes of conduct for psychologists. Ethical dilemmas faced by researchers, practitioners, teachers.\n\nprereq: Counseling or clinical psych grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "825920",
    "code": "PSY8618",
    "subject": "PSY",
    "number": "8618",
    "honors": false,
    "writing": false,
    "name": "Equity and Inclusion Discussn",
    "fullname": "Current Issues in Equity And Inclusion for Clinical Science and Counseling Psychology",
    "info": "This elective discussion group meets with the Psy 8617 class biweekly to discuss the latest research and thought papers relevant to inclusion, diversity, equity and accessibility in clinical science and counseling psychology. The readings change every semester offered and so this course may be taken multiple times. The course will cover current scholarship on topics such as race, ethnicity and immigrant status, biological sex and gender identity, sexual orientation, socio-economic status & class, and belief and religion.",
    "prereq": {}
  },
  {
    "uid": "010481",
    "code": "PSY8619",
    "subject": "PSY",
    "number": "8619",
    "honors": false,
    "writing": false,
    "name": "Foundations in Intervention",
    "fullname": "Foundations in Therapeutic Intervention Applying Theory to Clinical Practice",
    "info": "Professional methods in clinical psychology. Individual and group treatment techniques. Lectures and demonstrations of contemporary theories of methods of intervention with adults and or children.\n\nprereq: Clinical psych grad student",
    "prereq": {}
  },
  {
    "uid": "010609",
    "code": "PSY8620",
    "subject": "PSY",
    "number": "8620",
    "honors": false,
    "writing": false,
    "name": "Clinical Practicum",
    "fullname": "Clinical Practicum: Consultation, Supervision, Professional Standards, and Lifelong Learning",
    "info": "Field experience in professional work in clinical settings.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "010618",
    "code": "PSY8622",
    "subject": "PSY",
    "number": "8622",
    "honors": false,
    "writing": false,
    "name": "Effective Intervention",
    "fullname": "Theories and Methods of Effective Intervention",
    "info": "Methodological issues in treatment research, theories of change/motivation. Empirically supported therapies for anxiety, mood, personality disorders, psychosis, addiction. Simulating therapeutic interactions to prepare students to provide therapy.\n\nprereq: 8111, CSPR grad student",
    "prereq": {}
  },
  {
    "uid": "010622",
    "code": "PSY8640",
    "subject": "PSY",
    "number": "8640",
    "honors": false,
    "writing": false,
    "name": "Research Seminar",
    "fullname": "Research Seminar",
    "info": "Current topics for first-year clinical psychology graduate students.",
    "prereq": {}
  },
  {
    "uid": "010883",
    "code": "PSY8660",
    "subject": "PSY",
    "number": "8660",
    "honors": false,
    "writing": false,
    "name": "Psychopaths",
    "fullname": "The Psychopathic Personality: Theory and Research",
    "info": "Research-oriented consideration of nature and etiology of psychopathic behavior.",
    "prereq": {}
  },
  {
    "uid": "010657",
    "code": "PSY8664",
    "subject": "PSY",
    "number": "8664",
    "honors": false,
    "writing": false,
    "name": "Personality Assessment",
    "fullname": "Personality Assessment",
    "info": "Concepts/issues concerning individual differences in personality and their assessment; content, reality, and significance of personality traits; classification of personality traits; major approaches to measurement of personality.\n\nprereq: Psy grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "788517",
    "code": "PSY8666",
    "subject": "PSY",
    "number": "8666",
    "honors": false,
    "writing": false,
    "name": "Doct Pre-Thesis Cr",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "tbd\n\nprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": {}
  },
  {
    "uid": "010623",
    "code": "PSY8701",
    "subject": "PSY",
    "number": "8701",
    "honors": false,
    "writing": false,
    "name": "Seminar in I/O Psych I",
    "fullname": "Seminar in Industrial and Organizational Psychology I",
    "info": "Application of research and theory in psychological measurement and individual differences to problems in job analysis, personnel selection and classification, performance assessment, and individual training.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "010624",
    "code": "PSY8702",
    "subject": "PSY",
    "number": "8702",
    "honors": false,
    "writing": false,
    "name": "Seminar in I/O Psy II",
    "fullname": "Seminar in Industrial and Organizational Psychology II",
    "info": "Determinants of behavior, performance, job satisfaction that can be influenced after an individual enters an organization. Application of research/theory in attitudes, motivation, leadership, group/team dynamics, and job design to enhancement of job performance/satisfaction.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "010625",
    "code": "PSY8703",
    "subject": "PSY",
    "number": "8703",
    "honors": false,
    "writing": false,
    "name": "Seminar in I/O Psych III",
    "fullname": "Seminar in Industrial and Organizational Psychology III",
    "info": "Developing issues/trends in current research, research methodological advances, and implementation practices. Recent important/controversial developments.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "825325",
    "code": "PSY8704",
    "subject": "PSY",
    "number": "8704",
    "honors": false,
    "writing": false,
    "name": "Research Methods in IO Psych",
    "fullname": "Research Methods in IO Psychology",
    "info": "Psy 8704 will introduce students to the best research practices in Industrial-Organizational Psychology.\n\nPrerequisite: Instructor Consent.",
    "prereq": {}
  },
  {
    "uid": "826822",
    "code": "PSY8712",
    "subject": "PSY",
    "number": "8712",
    "honors": false,
    "writing": false,
    "name": "Data Science in Psychology",
    "fullname": "Data Science in Psychology",
    "info": "“Data science” is a broad term used to describe the combination of skills from software engineering, statistics, computer science, and a wide variety of application domains to address messy applied problems using data.  Intended for those with some training in statistics but little or none in practical programming, this course provides psychology students with a range of specific skills related to the practice of data science, starting with programming fundamentals and progressing through specific advanced skills, all within the statistical programming language, R. In the fundamentals portion of the course, students learn about the fundamentals of R programming, including data typing, conditionals, loops, and functions, before progressing into more advanced basic programming within the tidyverse framework. While learning specific coding skills, students also learn the fundamentals of good software engineering practices, including the use of version control systems, navigation of command shells, iterative development practices, and regular expressions. In the applied skills portion of the skills, students are introduced to variety of specific data science applications, including data visualization, markdown, web scraping, machine learning, natural language processing, supercomputing, and relational databases.\n\npreviously offered as 8960 ",
    "prereq": {}
  },
  {
    "uid": "788646",
    "code": "PSY8777",
    "subject": "PSY",
    "number": "8777",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": {}
  },
  {
    "uid": "791899",
    "code": "PSY8814",
    "subject": "PSY",
    "number": "8814",
    "honors": false,
    "writing": false,
    "name": "Analysis of Psychological Data",
    "fullname": "Analysis of Psychological Data",
    "info": "Data-analytic procedures used in psychological research. Types of variables used in psychological research. Data collection designs, their limitations. Procedures for analyzing experimental/non-experimental data, both univariate and multivariate. Emphasizes selection of data-analytic procedures. Procedures and their assumptions. Computation using statistical software. Limitations, interpretation. Lecture, lab.\n\nprereq: Undergrad course in statistics, grad student in psychology, instr consent",
    "prereq": {}
  },
  {
    "uid": "791900",
    "code": "PSY8815",
    "subject": "PSY",
    "number": "8815",
    "honors": false,
    "writing": false,
    "name": "Analysis of Psychological Data",
    "fullname": "Analysis of Psychological Data",
    "info": "Data-analytic procedures used in psychological research. Types of variables used in psychological research. Data collection designs, their limitations. Procedures for analyzing experimental/non-experimental data, both univariate and multivariate. Emphasizes selection of data-analytic procedures. Procedures and their assumptions. Computation using statistical software. Limitations, interpretation. Lecture, lab.\n\nprereq: 8814, instr consent",
    "prereq": {
      "and": [
        "791899"
      ]
    }
  },
  {
    "uid": "010895",
    "code": "PSY8881",
    "subject": "PSY",
    "number": "8881",
    "honors": false,
    "writing": false,
    "name": "Quant & Psychometric Methods",
    "fullname": "Seminar: Quantitative and Psychometric Methods",
    "info": "Reviews individual research on current topics in psychological measurement.",
    "prereq": {}
  },
  {
    "uid": "787687",
    "code": "PSY8882",
    "subject": "PSY",
    "number": "8882",
    "honors": false,
    "writing": false,
    "name": "Sem: Quant & Psychometric Meth",
    "fullname": "Seminar: Quantitative and Psychometric Methods",
    "info": "Reviews, individual research on current topics in psychological measurement.",
    "prereq": {}
  },
  {
    "uid": "010897",
    "code": "PSY8884",
    "subject": "PSY",
    "number": "8884",
    "honors": false,
    "writing": false,
    "name": "Factor Analysis",
    "fullname": "Factor Analysis and Latent Variable Models",
    "info": "Common factor model, major methods of estimation. Analytic rotation algorithms, number of factors problem, evaluation of model fit. Recent developments in restricted factor analysis.",
    "prereq": {}
  },
  {
    "uid": "826668",
    "code": "PSY8885",
    "subject": "PSY",
    "number": "8885",
    "honors": false,
    "writing": false,
    "name": "Computerized Adaptive Testing",
    "fullname": "Computerized Adaptive Testing—Methods and Applications",
    "info": "Computerized adaptive testing (CAT) is the redesign of psychological, educational, and other tests and instruments for delivery by computers—it is the first application of artificial intelligence in the field of psychological measurement.  CATs dynamically adjust the test questions delivered to each examinee in real time to simultaneously maximize measurement precision and efficiency.  Although CAT research began in the early 1970s, it was not until the mid-1990s that CATs began to impact testing programs and instruments in education, business and industry, medical research, personality measurement, and other applications, worldwide. This seminar is designed to (1) expose graduate students to the origins, methods, and applications of CAT, (2) evaluate its current status as reflected in the research literature, (3) identify areas in need of further research, and (4) provide the knowledge to design CATs for specific purposes. \n\nprereq: Psy 5865, EPsy 8226, or equivalent, or instructor permission",
    "prereq": {
      "or": [
        "006627",
        "808716"
      ]
    }
  },
  {
    "uid": "010898",
    "code": "PSY8886",
    "subject": "PSY",
    "number": "8886",
    "honors": false,
    "writing": false,
    "name": "Hierarchical Models",
    "fullname": "Hierarchical Models",
    "info": "Methods for repeated measures and longitudinal data. Linear mixed-effects model. Treatment of missing data and unbalanced designs. Extensions to conditionally linear/nonlinear models. Exercises with software such as HLM and SAS PROC MIXED.",
    "prereq": {}
  },
  {
    "uid": "827283",
    "code": "PSY8887",
    "subject": "PSY",
    "number": "8887",
    "honors": false,
    "writing": false,
    "name": "Advanced Item Response Theory",
    "fullname": "Item Response Theory: Research and Applications",
    "info": "This seminar is designed to (1) expose graduate students to current methods of item response theory (IRT) and its applications, (2) evaluate its current status as reflected in the research literature, (3) identify areas in need of further research, and (4) provide the knowledge to design psychological measuring instruments using currently best practices for specific applied purposes. In a seminar format, the course will examine the current literature on IRT, beginning with current methods for estimating its item response functions, which are the building blocks of IRT, including the methods of marginal maximum likelihood estimation, Markov chain monte-carlo methods, and factor analysis. The research literature on these methods will be evaluated to guide the proper use of the methods for practical application. Other topics to be evaluated in depth will be selected from the following, based on student interest: person parameter estimation, item fit, person fit, local independence, polytomous IRT models, hierarchical models, special models (e.g., response time models), among others. ",
    "prereq": {}
  },
  {
    "uid": "787925",
    "code": "PSY8888",
    "subject": "PSY",
    "number": "8888",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": {}
  },
  {
    "uid": "825326",
    "code": "PSY8901",
    "subject": "PSY",
    "number": "8901",
    "honors": false,
    "writing": false,
    "name": "Psychology Workshop",
    "fullname": "Psychology Research and Professional Development Workshop",
    "info": "The purpose of this workshop course is threefold: 1) to provide students an opportunity to present their work and receive feedback, 2) for students to learn how to provide constructive feedback; that is, to be both critical and supportive of their colleagues work, and 3) to discuss a variety of professional development issues that are relevant to students and their future careers.\n\nPrerequisite: Graduate Student in Psychology",
    "prereq": {}
  },
  {
    "uid": "011126",
    "code": "PSY8935",
    "subject": "PSY",
    "number": "8935",
    "honors": false,
    "writing": false,
    "name": "Rdgs BG & Indiv Dif",
    "fullname": "Readings in Behavioral Genetics and Individual Differences Psychology",
    "info": "Each week participants read and discuss one or two primary research articles.\n\nprereq: 5135, 5137 or instr consent",
    "prereq": {
      "or": [
        "006521",
        "006520"
      ]
    }
  },
  {
    "uid": "011068",
    "code": "PSY8937",
    "subject": "PSY",
    "number": "8937",
    "honors": false,
    "writing": false,
    "name": "Sem Beh Gen",
    "fullname": "Seminar in Human Behavioral Genetics",
    "info": "Advanced topics vary with each offering. Sample topics: gene identification in complex human traits, behavioral genetics of alcoholism, twin-family methodology.\n\nprereq: 5137 or instr consent",
    "prereq": {
      "or": [
        "006520"
      ]
    }
  },
  {
    "uid": "794679",
    "code": "PSY8960",
    "subject": "PSY",
    "number": "8960",
    "honors": false,
    "writing": false,
    "name": "Graduate Seminar in Psychology",
    "fullname": "Graduate Seminar in Psychology",
    "info": "Graduate seminar in subject of current interest in psychology.\n\nprereq: Psychology grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "790003",
    "code": "PSY8965",
    "subject": "PSY",
    "number": "8965",
    "honors": false,
    "writing": false,
    "name": "Well-being Seminar",
    "fullname": "Seminar: Well-Being",
    "info": "Various issues in emerging field of well-being research. Conceptual issues, measurement, judgmental processes, goals/values, adaptation, close relationships, culture, psychophysiology, temperaments/personality.",
    "prereq": {}
  },
  {
    "uid": "013937",
    "code": "PSY8990",
    "subject": "PSY",
    "number": "8990",
    "honors": false,
    "writing": false,
    "name": "Research Problems",
    "fullname": "Research Problems",
    "info": "",
    "prereq": {}
  },
  {
    "uid": "010948",
    "code": "PSY8993",
    "subject": "PSY",
    "number": "8993",
    "honors": false,
    "writing": false,
    "name": "Dir Stud:Special Areas of Psy",
    "fullname": "Directed Studies: Special Areas of Psychology and Related Sciences",
    "info": "Special area of psychology or a related science.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "010950",
    "code": "PSY8995",
    "subject": "PSY",
    "number": "8995",
    "honors": false,
    "writing": false,
    "name": "Research Problems",
    "fullname": "Research Problems",
    "info": "Research problems.",
    "prereq": {}
  }
]