[
  {
    "uid": "010734",
    "code": "RELS1001",
    "subject": "RELS",
    "number": "1001",
    "honors": false,
    "writing": false,
    "name": "Intro: Religions of the World",
    "fullname": "Introduction to the Religions of the World",
    "info": "Introduction to major religions of world/academic study of religion. Hinduism, Buddhism, Judaism, Christianity, Islam, some pre-Christian religions of Antiquity.",
    "prereq": {}
  },
  {
    "uid": "802131",
    "code": "RELS1002",
    "subject": "RELS",
    "number": "1002",
    "honors": false,
    "writing": false,
    "name": "Introduction to Religion",
    "fullname": "Contemporary Issues in Religion, Culture, and Society: An Introduction to Religion",
    "info": "Through examination of several contemporary issues this course introduces students to the complex ways in which religion functions in everyday life.  The course will examine the intersection of religion with several cultural and social contexts and issues, such as gender, the environment, politics, power, race, ethnicity, health, medicine, food, art, and entertainment. It will draw upon the practices, texts, communities, and institutions of several religious traditions and familiarize students with interdisciplinary, humanistic methods for studying religion. ",
    "prereq": {}
  },
  {
    "uid": "802852",
    "code": "RELS1003",
    "subject": "RELS",
    "number": "1003",
    "honors": false,
    "writing": false,
    "name": "World of the Bible",
    "fullname": "World of the Bible: Religions, Empires, and Discourses of Power",
    "info": "Hebrew Bible (Old Testament), its cultural background in Ancient Near East. Biblical literature, religion, lifestyles, and law. Nature of myth, concepts of divine. Origins, authorship, and transmission of texts that constitute Hebrew Bible.",
    "prereq": {}
  },
  {
    "uid": "809485",
    "code": "RELS1011",
    "subject": "RELS",
    "number": "1011",
    "honors": false,
    "writing": false,
    "name": "Religions & American Identity",
    "fullname": "Religions and American Identity in the United States from World War II to the Present",
    "info": "Political/cultural watersheds of last 60 years. Debates within/between religious traditions/communities. How gender, race, class, sexuality have shaped relationships between religion/politics. Tensions between secularism/religiosity, liberalism/fundamentalism. ",
    "prereq": {}
  },
  {
    "uid": "010738",
    "code": "RELS1031",
    "subject": "RELS",
    "number": "1031",
    "honors": false,
    "writing": false,
    "name": "Relig. South Asia",
    "fullname": "Introduction to the Religions of South Asia",
    "info": "Historical study of the three traditional religions of India: Hinduism, Buddhism, and Jainism through literature, art, and film. General topics include myth, yoga, mysticism, and the religious order of society.",
    "prereq": {}
  },
  {
    "uid": "797144",
    "code": "RELS1034",
    "subject": "RELS",
    "number": "1034",
    "honors": false,
    "writing": false,
    "name": "Intro Jewish History & Culture",
    "fullname": "Introduction to Jewish History and Cultures",
    "info": "This course traces the development of Judaism and Jewish civilizations from their beginnings to the present. With over three millennia as its subject, the course must of necessity be a general survey. Together we will explore the mythic structures, significant documents, historical experiences, narratives, practices, beliefs, and worldviews of the Jewish people. The course begins by examining the roots of Judaism in the Hebrew Bible and the history of ancient Israel but quickly focuses on the creative forces that developed within Judaism as a national narrative confronted the forces of history, especially in the forms of the Persian, Greek, and Roman empires.  Rabbinic Judaism becomes the most dominant creative force and will receive our greatest attention, both in its formative years and as it encounters the rise of Christianity and Islam. After studying the Jewish experience in the medieval world, we will turn to Judaism’s encounter with the enlightenment and modernity. The historical survey concludes by attending to the transformations within Judaism and Jewish life of the last 150 years, including a confrontation with the experience of the Holocaust. Woven throughout this historical survey will be repeated engagements with core questions: “Who is a Jew?” “What do Jews believe?” “What do Jews do?” “What do we mean by ‘religion’?”   “How do Jews read texts within their tradition?” And perhaps most importantly, “How many answers are there to a Jewish question?” Students in this course can expect to come away with some knowledge of the Bible in Judaism, rabbinic literature and law, Jewish mysticism and philosophy, Jewish nationalism and Zionism, Jewish culture, ritual, and worship in the synagogue, the home, and the community, and Jewish celebrations of life cycle events and the festivals.",
    "prereq": {}
  },
  {
    "uid": "788561",
    "code": "RELS1035",
    "subject": "RELS",
    "number": "1035",
    "honors": false,
    "writing": false,
    "name": "Introduction to Christianity",
    "fullname": "Introduction to Christianity",
    "info": "Christian traditions throughout history. Emphasizes recurrent themes: reform/renewal, relations between church/society, varieties of spiritual formation, elusive pursuit of Christian unity.",
    "prereq": {}
  },
  {
    "uid": "797104",
    "code": "RELS1082",
    "subject": "RELS",
    "number": "1082",
    "honors": false,
    "writing": false,
    "name": "Jesus in History",
    "fullname": "Jesus in History, Art & Culture",
    "info": "Does time, place, and culture affect our picture of Jesus? We'll start by constructing our own Jesus story and then go backwards in time to examine modern times (film, music, and modern art), pre-Civil War America (views of Jesus from enslaved people and their enslavers), Renaissance and Medieval Europe and North Africa (art and architecture), and finally end with the ancient world (art and writings about Jesus, including the biblical gospels). No background in religious studies required, and students of any, all, or no religious background are welcome.",
    "prereq": {}
  },
  {
    "uid": "802172",
    "code": "RELS1201",
    "subject": "RELS",
    "number": "1201",
    "honors": false,
    "writing": false,
    "name": "Contxt & Interp, Hebrew Bible",
    "fullname": "The Bible: Context and Interpretation, World of the Hebrew Bible",
    "info": "The Hebrew Bible and Old Testament are literary collections that modern Jewish and Christian traditions maintain as important, but these collections were initially produced by ancient Israelite scribes who composed and/or compiled the biblical texts at particular time periods in the ancient Near East. This course will introduce the academic study of biblical texts, which demands critical analysis of the literature and an openness to reading the literature from the perspective of ancient Israelite writers (who lived in a world far different from today). The course will spend considerable time on the literary (and scribal) composition of biblical prose texts; time will also be spent on the historical circumstances of biblical prophets and other writers of the biblical texts. This course will only address the ancient setting of the biblical texts and not re-interpretations in Jewish or Christian traditions. Given the scope of the course, modern interpretations of the biblical literature will not be discussed; we will only focus on this literature in its ancient setting.prereq: Knowledge of Hebrew not required",
    "prereq": {}
  },
  {
    "uid": "826049",
    "code": "RELS1203",
    "subject": "RELS",
    "number": "1203",
    "honors": false,
    "writing": false,
    "name": "Bible: New Testament",
    "fullname": "The Bible: Context & Interpretation, World of the New Testament",
    "info": "Religious or not, Christian or not, hundreds of millions of people around the world utilize the New Testament for everything from personal belief (\"Jesus is my personal Lord and Savior\") to mass entertainment (documentaries, art house films, and blockbusters); from religious gatherings (most forms of Christianity) to ?secular? spiritual teachings (\"Turn the other cheek\"); from fine art (Salvador Dali's \"Christ of Saint John of the Cross\") to matters of law (Good Samaritan laws); and from politics (Christian nationalism) to literature (the quotes Harry Potter finds on the gravestones in Godric's Hollow). The New Testament deeply influences modern cultural contexts all around the world, but especially in the Western world. This course will explore the New Testament from a different context, that of its first century birthplace. We will build students? understanding of the writings of the New Testament in the Roman Empire of the first century by gaining basic cultural knowledge of first century Greece, Rome, and Israel/Palestine and then reading the Gospels, the letters of Paul, and the Book of Revelation from the perspective of these intersecting worlds. The New Testament is grounded in this context, and deeper exploration of New Testament writings from a first-century perspective will help students enrich their understanding of modern references like the ones mentioned above.",
    "prereq": {}
  },
  {
    "uid": "826232",
    "code": "RELS1205",
    "subject": "RELS",
    "number": "1205",
    "honors": false,
    "writing": false,
    "name": "The Bible and Film",
    "fullname": "The Bible and Film: The Holy Book Meets the Silver Screen",
    "info": "The Bible has been a star of Hollywood and the silver screen since the birth of cinema. This course tells that story. The Bible has deep roots in American society, in communities of faith, in politics, in art and literature, and in popular culture. It is no surprise, then, that filmmakers have frequently drawn on the Bible as source text and as inspiration. This course explores the ways in which the Bible has been interpreted and reimagined in film over the past century. We will examine the relationships between the biblical texts and the films they inspired, considering questions such as: How do the filmmakers rework their sources to make them relevant to contemporary audiences? How beholden are the filmmakers to the interpretations of communities that view biblical texts as authoritative, and where are they free to depart from their sources? Is it possible to \"translate\" biblical narratives into film without losing something in the translation?",
    "prereq": {}
  },
  {
    "uid": "817696",
    "code": "RELS1544W",
    "subject": "RELS",
    "number": "1544",
    "honors": false,
    "writing": true,
    "name": "World Christianity: 100-1400",
    "fullname": "Martyrs, Monks, Crusaders: World Christianity, 100-1400",
    "info": "This course surveys the history of Christianity from its status as a persecuted minority religion of the Roman Empire to its dominant role in medieval Europe and Byzantium. We study Christian traditions in Asia and Africa as well as Europe with special attention to the relationship between Christianity and culture in the ancient and medieval world.",
    "prereq": {}
  },
  {
    "uid": "799130",
    "code": "RELS1905",
    "subject": "RELS",
    "number": "1905",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "818098",
    "code": "RELS1911",
    "subject": "RELS",
    "number": "1911",
    "honors": false,
    "writing": false,
    "name": "Islam in America",
    "fullname": "Islam in America: A History of the Present",
    "info": "From the \"Age of Discovery\" and the African slave trade, to Malcolm X and the War on Terror, Islam has long been an integral part of the American landscape. In this seminar students will examine the history of Islam and social formation of Muslim communities in the United States. We will explore the ways in which racial, national, cultural, and sectarian differences within and between Muslim communities have shaped and shifted what it means to be Muslim in the United States. And, we will ask what tracing the history of Islam can tell us about the role of religion in the United States more broadly.",
    "prereq": {}
  },
  {
    "uid": "802127",
    "code": "RELS3001W",
    "subject": "RELS",
    "number": "3001",
    "honors": false,
    "writing": true,
    "name": "Theory and Method in Religion",
    "fullname": "Theory and Method in Religion: Critical Approaches to the Study of Religion",
    "info": "Theoretical/methodological issues in academic study of religion. Theories of origin, character, and function of religion as a human phenomenon. Psychological, sociological, anthropological, and phenomenological perspectives.",
    "prereq": {}
  },
  {
    "uid": "016386",
    "code": "RELS3013W",
    "subject": "RELS",
    "number": "3013",
    "honors": false,
    "writing": true,
    "name": "Biblical Law & Jewish Ethics",
    "fullname": "Biblical Law and Jewish Ethics",
    "info": "This course introduces students to the original meaning and significance of religious law and ethics within Judaism. Law is the single most important part of Jewish history and identity. At the same time, law is also the least understood part of Judaism and has often been the source of criticism and hatred. We shall therefore confront one of the most important parts of Jewish civilization and seek to understand it on its own terms. In demonstrating how law becomes a fundamental religious and ethical ideal, the course will focus on the biblical and Rabbinic periods but spans the entire history of Judaism. Consistent with the First Amendment, the approach taken is secular. There are no prerequisites: the course is open to all qualified students.The course begins with ideas of law in ancient Babylon and then studies the ongoing history of those ideas. The biblical idea that a covenant binds Israel to God, along with its implications for human worth - including the view of woman as person - will be examined. Comparative cultural issues include the reinterpretations of covenant within Christianity and Islam. The course investigates the rabbinic concept of oral law, the use of law to maintain the civil and religious stability of the Jewish people, and the kabbalistic transformation of law. The course concludes with contemporary Jewish thinkers who return to the Bible while seeking to establish a modern system of universal ethics.The premise of the course is the discipline of academic religious studies. The assumptions of the course are therefore academic and secular, as required by the First Amendment. All texts and all religious traditions will be examined analytically and critically. Students are expected to understand and master this approach, which includes questioning conventional cultural assumptions about the composition and authorship of the Bible. Willingness to ask such questions and openness to new ways of thinking are essential to success in the course.Old: Significance of religious law in Judaism. Babylonian background of biblical law. Biblical creation of the person as a legal category. Rabbinic transformations of biblical norms. Covenant in Christianity/Islam. Contemporary Jewish literature/philosophy.",
    "prereq": {}
  },
  {
    "uid": "826248",
    "code": "RELS3019",
    "subject": "RELS",
    "number": "3019",
    "honors": false,
    "writing": false,
    "name": "Buddhist Art and Architecture",
    "fullname": "Buddhist Art and Architecture",
    "info": "This class provides an introduction to Buddhist art and architecture, from the sixth-century BCE to the present.  Beginning with the life of the historical Buddha (563-483), it will follow the development of Buddhist art in India before tracing it across the Silk Road to China, Korea, and Japan.  The class will consider how art and architecture evolved to serve the needs of Buddhism as its doctrine and practice evolved.  At the same, we will consider how Buddhist cosmology and metaphysics were translated into culturally specific modes that served the multifarious cultural and artistic traditions of Asia.",
    "prereq": {}
  },
  {
    "uid": "797143",
    "code": "RELS3034",
    "subject": "RELS",
    "number": "3034",
    "honors": false,
    "writing": false,
    "name": "Intro Jewish History & Culture",
    "fullname": "Introduction to Jewish History and Cultures",
    "info": "This course traces the development of Judaism and Jewish civilizations from their beginnings to the present. With over three millennia as its subject, the course must of necessity be a general survey. Together we will explore the mythic structures, significant documents, historical experiences, narratives, practices, beliefs, and worldviews of the Jewish people. The course begins by examining the roots of Judaism in the Hebrew Bible and the history of ancient Israel but quickly focuses on the creative forces that developed within Judaism as a national narrative confronted the forces of history, especially in the forms of the Persian, Greek, and Roman empires.  Rabbinic Judaism becomes the most dominant creative force and will receive our greatest attention, both in its formative years and as it encounters the rise of Christianity and Islam. After studying the Jewish experience in the medieval world, we will turn to Judaism’s encounter with the enlightenment and modernity. The historical survey concludes by attending to the transformations within Judaism and Jewish life of the last 150 years, including a confrontation with the experience of the Holocaust. Woven throughout this historical survey will be repeated engagements with core questions: “Who is a Jew?” “What do Jews believe?” “What do Jews do?” “What do we mean by ‘religion’?”   “How do Jews read texts within their tradition?” And perhaps most importantly, “How many answers are there to a Jewish question?” Students in this course can expect to come away with some knowledge of the Bible in Judaism, rabbinic literature and law, Jewish mysticism and philosophy, Jewish nationalism and Zionism, Jewish culture, ritual, and worship in the synagogue, the home, and the community, and Jewish celebrations of life cycle events and the festivals.",
    "prereq": {}
  },
  {
    "uid": "788562",
    "code": "RELS3035",
    "subject": "RELS",
    "number": "3035",
    "honors": false,
    "writing": false,
    "name": "Introduction to Christianity",
    "fullname": "Introduction to Christianity",
    "info": "Christian traditions throughout history. Emphasizes recurrent themes: reform/renewal, relations between church/society, varieties of spiritual formation, elusive pursuit of Christian unity.",
    "prereq": {}
  },
  {
    "uid": "790024",
    "code": "RELS3070",
    "subject": "RELS",
    "number": "3070",
    "honors": false,
    "writing": false,
    "name": "Topics in Religious Studies",
    "fullname": "Topics in Religious Studies",
    "info": "Diverse topics in Religious Studies. Please see below for this semester's selection title.",
    "prereq": {}
  },
  {
    "uid": "797123",
    "code": "RELS3071",
    "subject": "RELS",
    "number": "3071",
    "honors": false,
    "writing": false,
    "name": "Greek & Hellenistic Religions",
    "fullname": "Greek and Hellenistic Religions",
    "info": "Greek religion from the Bronze Age to Hellenistic times. Literature, art, archaeology. Homer/Olympian deities. Ritual performance, prayer, sacrifice. Temple architecture. Death/afterlife. Mystery cults. Philosophical religion. Near Eastern salvation religions. Meets with 3171.",
    "prereq": {}
  },
  {
    "uid": "797186",
    "code": "RELS3072",
    "subject": "RELS",
    "number": "3072",
    "honors": false,
    "writing": false,
    "name": "The Birth of Christianity",
    "fullname": "The Birth of Christianity",
    "info": "Early Jesus movement in cultural/historical setting. Origins in Judaism. Traditions about Jesus. Apostle Paul, controversies/interpreters. Authority, religious practice, structure. Emergence of canon. Contemporary methods of New Testament study. Biblical writings as history/narrative. CNES 3072/CNES 5072/RELS 3072/RELS 5072 meet together.",
    "prereq": {}
  },
  {
    "uid": "797189",
    "code": "RELS3073",
    "subject": "RELS",
    "number": "3073",
    "honors": false,
    "writing": false,
    "name": "Roman Rel & Early Christianity",
    "fullname": "Roman Religion and Early Christianity",
    "info": "Etruscan, Republican religion. Appeal of non-Roman cults. Ruler worship. Christians in Asia Minor, Egypt, and the West. Popular piety, Christian and non-Christian. Rabbinic Judaism. Varieties of Christianity in 2nd and 3rd centuries. Influence of Greco-Roman culture on emerging church. Constantine and Julian.",
    "prereq": {}
  },
  {
    "uid": "803023",
    "code": "RELS3074",
    "subject": "RELS",
    "number": "3074",
    "honors": false,
    "writing": false,
    "name": "Age of Constantine the Great",
    "fullname": "Age of Constantine the Great",
    "info": "Change/continuity in Roman Empire from 2nd-century zenith through 3rd-century crisis, first Christian emperor (306 to 337 A.D.), and beyond. Replacement of classical\npaganism by Christianity. Beginnings of monasticism. Superpower relations between Roman, Persian empires.",
    "prereq": {}
  },
  {
    "uid": "800229",
    "code": "RELS3076",
    "subject": "RELS",
    "number": "3076",
    "honors": false,
    "writing": false,
    "name": "The Apostle Paul",
    "fullname": "The Apostle Paul: Life, Letters, and Legacy",
    "info": "How/what can we know about Paul. What his message was. What he was fighting. How he was later understood by friends/foes.",
    "prereq": {}
  },
  {
    "uid": "801444",
    "code": "RELS3077",
    "subject": "RELS",
    "number": "3077",
    "honors": false,
    "writing": false,
    "name": "Religious Violence",
    "fullname": "Religious Violence in the Early Roman Empire: Jews, Christians, and Pagans",
    "info": "Methodological strategies for understanding discourses of violence. Ways religious traditions shaped ethnic identity/practices and views of sacrifice, martyrdom, spectacles of violence, apocalyptic ideologies of violence, state persecution, texts/terror, and holy war.",
    "prereq": {}
  },
  {
    "uid": "803101",
    "code": "RELS3078",
    "subject": "RELS",
    "number": "3078",
    "honors": false,
    "writing": false,
    "name": "Jews of the Mediterranean",
    "fullname": "Jews of the Islamic Mediterranean and Christian Europe, 7th-17th Centuries",
    "info": "Experience of Jews, their interactions with Christian Europe and Muslim Mediterranean. Social, cultural, and intellectual life of Jews. Migration, trade. Relationship of Jews to governments and to non-Jewish religious/secular authorities.",
    "prereq": {}
  },
  {
    "uid": "803970",
    "code": "RELS3079",
    "subject": "RELS",
    "number": "3079",
    "honors": false,
    "writing": false,
    "name": "Muslims and Jews",
    "fullname": "Muslims and Jews: Conflict and Co-existence in the Middle East and North Africa since 1700",
    "info": "Diversity of social/cultural interactions between Muslims and Jews and between Islam and Judaism since 1700. What enabled the two religious communities to peacefully coexist? What were causes of conflict? Why is history of Muslim-Jewish relations such a contested issue? ",
    "prereq": {}
  },
  {
    "uid": "789775",
    "code": "RELS3083",
    "subject": "RELS",
    "number": "3083",
    "honors": false,
    "writing": false,
    "name": "Jesus the Jew",
    "fullname": "Jesus the Jew",
    "info": "Historic figure of Jesus within context of first century Palestinian Judaism. Main groups/institutions of Judaism at time of Jesus. Rabbinic literature/traditions. Works describing Jesus' life/sayings (synoptic gospels). Jesus and the Law, Messianic ideals/expectations, problem of religious authority. Positions regarding Rome, its authority. James and the Jerusalem Church.",
    "prereq": {}
  },
  {
    "uid": "010321",
    "code": "RELS3089",
    "subject": "RELS",
    "number": "3089",
    "honors": false,
    "writing": false,
    "name": "New Test Arch",
    "fullname": "Archaeology in Biblical Lands II: New Testament Period",
    "info": "Archaeological data relevant to the New Testament; major sites in the Holy Land and other areas of Mediterranean and Near East. Evidence of pottery, inscriptions, manuscripts, and coins. Excavation methods.  Archaeology as a tool for study of ancient religions.",
    "prereq": {}
  },
  {
    "uid": "817000",
    "code": "RELS3092",
    "subject": "RELS",
    "number": "3092",
    "honors": false,
    "writing": false,
    "name": "Jesus in History",
    "fullname": "Jesus in History, Art & Culture",
    "info": "Does time, place, and culture affect our picture of Jesus? We'll start by constructing our own Jesus story and then go backwards in time to examine modern times (film, music, and modern art), pre-Civil War America (views of Jesus from enslaved people and their enslavers), Renaissance and Medieval Europe and North Africa (art and architecture), and finally end with the ancient world (art and writings about Jesus, including the biblical gospels). No background in religious studies required, and students of any, all, or no religious background are welcome.",
    "prereq": {}
  },
  {
    "uid": "805873",
    "code": "RELS3111",
    "subject": "RELS",
    "number": "3111",
    "honors": false,
    "writing": false,
    "name": "Too Jewish?",
    "fullname": "Too Jewish? The Complex Construction of the Jewish American Psyche in Literature, Art, and Film",
    "info": "Questions about image/location of Jews in American arts and pop culture. Examples from literature, music, film.",
    "prereq": {}
  },
  {
    "uid": "790894",
    "code": "RELS3112",
    "subject": "RELS",
    "number": "3112",
    "honors": false,
    "writing": false,
    "name": "Jewish Mysticism and Kabbalah",
    "fullname": "Jewish Mysticism, Magic, and Kabbalah",
    "info": "Mystical traditions from early rabbinic traditions to Zohar (Book of Splendor) in 13th century. Literature of heavenly ascent (Hekhalot, Merkavah), Book of Creation (Sefer Yetzirah), precursors of Zohar.the Bahir. Schools of Provence, Gerona, and Zohar. Tension between legal/mystical aspects, magical theurgic techniques, evolution of doctrine of Sefirot, mystical interpretation of Scripture, erotic dimension.",
    "prereq": {}
  },
  {
    "uid": "815504",
    "code": "RELS3113",
    "subject": "RELS",
    "number": "3113",
    "honors": false,
    "writing": false,
    "name": "Hist of Mod Israel/Palestine",
    "fullname": "History of Modern Israel/Palestine: Society, Culture, and Politics",
    "info": "History of Israel/Palestine, 19th–21st centuries. Zionism and Arab nationalism. Arab/Palestinian/Israeli wars. Ethnic, religious, and national identities. Israeli and Palestinian politics, culture, and society; conflicting narratives and shared histories. ",
    "prereq": {}
  },
  {
    "uid": "793565",
    "code": "RELS3115",
    "subject": "RELS",
    "number": "3115",
    "honors": false,
    "writing": false,
    "name": "Midrash: Reading and Retelling",
    "fullname": "Midrash: Reading and Retelling the Hebrew Bible",
    "info": "How did the Jews of the first seven centuries of the common era read and understand the Hebrew Bible? What were the problems they faced -- interpretive, historical, theological -- in trying to apply their holy scriptures? This course explores key issues that led to the development of a new form of Judaism in late antiquity, rabbinic Judaism, and its methods of scriptural interpretation. The course's study will focus on the forms and practices of rabbinic scriptural interpretation (midrash) as it developed in Roman Palestine and Sasanian Babylonia, focusing on key narrative and legal passages in the Five Books of Moses (Torah). A main focus of the course will be on the ways the rabbis adapted the Hebrew Bible to express their own core concerns.",
    "prereq": {}
  },
  {
    "uid": "818276",
    "code": "RELS3121",
    "subject": "RELS",
    "number": "3121",
    "honors": false,
    "writing": false,
    "name": "Gender in Early Christianity",
    "fullname": "Gender and Body in Early Christianity",
    "info": "Ancient Christians, like any other social group in the ancient world, represented themselves through images, stories, and discourses using the cultural tools available to them in their own contexts. In this course, we will explore two key texts of early Christianity (1 Corinthians and the Gospel of Mark) with special attention to how representations of the body and gender served to communicate the nature of what it meant to be Christian for these authors.  The study of ancient material offers a space to acquire the skills of critical analysis of body and gender dynamics so that we can better understand the roles that the body and gender play in shaping our self-identity, social interaction, and societal structures.",
    "prereq": {}
  },
  {
    "uid": "010813",
    "code": "RELS3126",
    "subject": "RELS",
    "number": "3126",
    "honors": false,
    "writing": false,
    "name": "Judaism-Mod World",
    "fullname": "Judaism in the Modern World",
    "info": "Jewish theology, religion, and ideology in the 19th and 20th centuries. American Judaism: orthodox, conservative, reform, reconstructionist; religious and communal organizational structures.  Zionism in Europe, Israel, and America. Hasidism. Jewish responses to feminism and the democratic ideal.",
    "prereq": {}
  },
  {
    "uid": "816982",
    "code": "RELS3182",
    "subject": "RELS",
    "number": "3182",
    "honors": false,
    "writing": false,
    "name": "Art & Arch Egypt, Western Asia",
    "fullname": "Egypt and Western Asia: Art and Archaeology of Ancient Egypt and Western Asia",
    "info": "This course will provide students with foundational knowledge in the art, architecture and archaeology of Egypt, East Africa, Asia Minor, Mesopotamia, Iran and Central Asia from the Neolithic through Late Antiquity (ca. 7,000 B.C.E. - 650 C.E.). Students will gain an understanding of the relationship between the visual material and the social, intellectual, political and religious contexts in which it developed and functioned. In this regard, students will also gain an understanding of the evolution of, and exchanges and differences among, the visual cultures of these time periods and regions. It will also expose them to the preconditions for contemporary geopolitics in the region. ",
    "prereq": {}
  },
  {
    "uid": "010852",
    "code": "RELS3201",
    "subject": "RELS",
    "number": "3201",
    "honors": false,
    "writing": false,
    "name": "Contxt & Interp, Hebrew Bible",
    "fullname": "The Bible: Context and Interpretation, World of the Hebrew Bible",
    "info": "The Hebrew Bible and Old Testament are literary collections that modern Jewish and Christian traditions maintain as important, but these collections were initially produced by ancient Israelite scribes who composed and/or compiled the biblical texts at particular time periods in the ancient Near East. This course will introduce the academic study of biblical texts, which demands critical analysis of the literature and an openness to reading the literature from the perspective of ancient Israelite writers (who lived in a world far different from today). The course will spend considerable time on the literary (and scribal) composition of biblical prose texts; time will also be spent on the historical circumstances of biblical prophets and other writers of the biblical texts. This course will only address the ancient setting of the biblical texts and not re-interpretations in Jewish or Christian traditions. Given the scope of the course, modern interpretations of the biblical literature will not be discussed; we will only focus on this literature in its ancient setting.prereq: Knowledge of Hebrew not required",
    "prereq": {}
  },
  {
    "uid": "010556",
    "code": "RELS3202",
    "subject": "RELS",
    "number": "3202",
    "honors": false,
    "writing": false,
    "name": "Bible: Prophecy Ancnt Israel",
    "fullname": "Bible: Prophecy in Ancient Israel",
    "info": "Survey of Israelite prophets. Emphasizes Amos, Hosea, Isaiah, Jeremiah, Ezekiel, Second Isaiah. Prophetic contributions to Israelite religion. Personality of prophets. Politics, prophetic reaction. Textual analysis, Biblical scholarship. Prophecy viewed cross-culturally.prereq: [RelS 1001] or [CNES 1201 or JWST 1201 or RELS 1201 or CNES 3201 or JWST 3201 or RELS 3201]",
    "prereq": {
      "or": [
        {
          "and": [
            "010734"
          ]
        },
        {
          "or": [
            "797684",
            "802172",
            "797685",
            "010852"
          ]
        }
      ]
    }
  },
  {
    "uid": "010546",
    "code": "RELS3203",
    "subject": "RELS",
    "number": "3203",
    "honors": false,
    "writing": false,
    "name": "The Bible: Wisdom, Poetry",
    "fullname": "The Bible: Wisdom, Poetry, and Apocalyptic",
    "info": "Survey of books of Psalms, Proverbs, Job, Song of Songs, Lamentations, Ecclesiastes (Qoheleth). Characteristics of biblical poetry. Conceptions of Israelite wisdom writing. Traits of early Jewish apocalyptic writing.",
    "prereq": {}
  },
  {
    "uid": "804686",
    "code": "RELS3204",
    "subject": "RELS",
    "number": "3204",
    "honors": false,
    "writing": false,
    "name": "The Dead Sea Scrolls",
    "fullname": "The Dead Sea Scrolls",
    "info": "Introduction to Dead Sea Scrolls and Qumran. Contents of Dead Sea Scrolls, significance for development of Bible. Background of Judaism and Christianity. Archaeological site of Qumran.",
    "prereq": {}
  },
  {
    "uid": "811578",
    "code": "RELS3205",
    "subject": "RELS",
    "number": "3205",
    "honors": false,
    "writing": false,
    "name": "Women, Gender, & Hebrew Bible",
    "fullname": "Women, Gender, and the Hebrew Bible",
    "info": "How men, women, gender, sexuality is portrayed in Hebrew Bible. Social/religious roles/status of women in ancient Israel. Read biblical texts from academic point of view.",
    "prereq": {}
  },
  {
    "uid": "818559",
    "code": "RELS3206",
    "subject": "RELS",
    "number": "3206",
    "honors": false,
    "writing": false,
    "name": "Purity and Pollution",
    "fullname": "Sex, Murder, and Bodily Discharges: Purity and Pollution in the Ancient World",
    "info": "\"Dirt is dangerous,\" Mary Douglas declared more than 50 years ago in her groundbreaking study, \"Purity and Danger.\" Douglas's ideas have been influential in ancient Mediterranean and Near Eastern studies and provide a framework for us to analyze how people in antiquity conceptualized ideas of purity, pollution, ritual sacrifice, sacred spaces, bodily leakages, and the liminal stages of life and death. We'll delve into Douglas's theory in light of ancient examples with a special focus on ancient Israelite texts (the Tanakh or Old Testament) as well as ancient Mediterranean and Near Eastern building inscriptions, specialist manuals, and rituals. Through this evidence, we'll gain profound insight into the ancient notions of \"sacred/clean\" (purity) and the \"unclean/profane\" (pollution).",
    "prereq": {}
  },
  {
    "uid": "826050",
    "code": "RELS3213",
    "subject": "RELS",
    "number": "3213",
    "honors": false,
    "writing": false,
    "name": "Bible: New Testament",
    "fullname": "The Bible: Context & Interpretation, World of the New Testament",
    "info": "Religious or not, Christian or not, hundreds of millions of people around the world utilize the New Testament for everything from personal belief (\"Jesus is my personal Lord and Savior\") to mass entertainment (documentaries, art house films, and blockbusters); from religious gatherings (most forms of Christianity) to \"secular\" spiritual teachings (\"Turn the other cheek\"); from fine art (Salvador Dali's \"Christ of Saint John of the Cross\") to matters of law (Good Samaritan laws); and from politics (Christian nationalism) to literature (the quotes Harry Potter finds on the gravestones in Godric's Hollow). The New Testament deeply influences modern cultural contexts all around the world, but especially in the Western world. This course will explore the New Testament from a different context, that of its first century birthplace. We will build students? understanding of the writings of the New Testament in the Roman Empire of the first century by gaining basic cultural knowledge of first century Greece, Rome, and Israel/Palestine and then reading the Gospels, the letters of Paul, and the Book of Revelation from the perspective of these intersecting worlds. The New Testament is grounded in this context, and deeper exploration of New Testament writings from a first-century perspective will help students enrich their understanding of modern references like the ones mentioned above.",
    "prereq": {}
  },
  {
    "uid": "010811",
    "code": "RELS3251",
    "subject": "RELS",
    "number": "3251",
    "honors": false,
    "writing": false,
    "name": "Mod Stud of OT",
    "fullname": "Modern Study of the Old Testament",
    "info": "Methods used in studying the Old Testament, including textual criticism, the anthropological approach, the sociological approach, the history of religion, and the use of archaeology in interpreting the text.",
    "prereq": {}
  },
  {
    "uid": "818191",
    "code": "RELS3254",
    "subject": "RELS",
    "number": "3254",
    "honors": false,
    "writing": false,
    "name": "The Archaeology of Religion",
    "fullname": "Archaeology of Ritual and Religion",
    "info": "The course discusses evidence for the origins of religion and its diverse roles in human societies over millennia. It focuses on how artifacts and architecture are essential to religious experience. It asks: What constitutes religion for different cultures? Why is religion at the heart of politics, social life, and cultural imagination? ",
    "prereq": {}
  },
  {
    "uid": "827189",
    "code": "RELS3320",
    "subject": "RELS",
    "number": "3320",
    "honors": false,
    "writing": false,
    "name": "Topics in Religious Studies",
    "fullname": "Topics in Religious Studies",
    "info": "Topics specified in class schedule",
    "prereq": {}
  },
  {
    "uid": "802925",
    "code": "RELS3321",
    "subject": "RELS",
    "number": "3321",
    "honors": false,
    "writing": false,
    "name": "American Indian Philosophies",
    "fullname": "American Indian Philosophies",
    "info": "World views of indigenous people of Americas. Topics include native medicines/healing practices, ceremonies/ritual, governance, ecology, humor, tribal histories, status of contemporary native people.",
    "prereq": {}
  },
  {
    "uid": "809279",
    "code": "RELS3322",
    "subject": "RELS",
    "number": "3322",
    "honors": false,
    "writing": false,
    "name": "Pre-Columbian Art",
    "fullname": "Art of Central and South America Before Columbus",
    "info": "Art/architecture of native peoples of Americas from twelfth century B.C. until arrival of Europeans in sixteenth century. Ways that people living in diverse areas of South America/Mesoamerica used art/architecture. Tools to investigate Pre-Columbian art at more advanced levels.",
    "prereq": {}
  },
  {
    "uid": "799920",
    "code": "RELS3371",
    "subject": "RELS",
    "number": "3371",
    "honors": false,
    "writing": false,
    "name": "Buddhism",
    "fullname": "Buddhism",
    "info": "Historical and contemporary account of the Buddhist religion in Asia/world in terms of its rise, development, various schools, practices, philosophical concepts, and ethics. Current trends in the modern faith and the rise of \"socially engaged\" Buddhism.",
    "prereq": {}
  },
  {
    "uid": "808527",
    "code": "RELS3372",
    "subject": "RELS",
    "number": "3372",
    "honors": false,
    "writing": false,
    "name": "Reading Asian Cultures",
    "fullname": "Reading Asian Cultures",
    "info": "Introduction to primary Asian texts in translation. Introducing/applying methods of interpretation to particular text in sequence. Close reading, methodological rigor. Practice, application.",
    "prereq": {}
  },
  {
    "uid": "801381",
    "code": "RELS3373",
    "subject": "RELS",
    "number": "3373",
    "honors": false,
    "writing": false,
    "name": "Religion in Imperial China",
    "fullname": "Religion and Society in Imperial China",
    "info": "Varieties of religious experience in imperial China. Religion as lived practices. Textual traditions. Buddhism, Daoism, Confucianism, relations among them. Western missionary enterprise in China.",
    "prereq": {}
  },
  {
    "uid": "818714",
    "code": "RELS3374",
    "subject": "RELS",
    "number": "3374",
    "honors": false,
    "writing": false,
    "name": "Intro to Japanese Religions",
    "fullname": "Introduction to Japanese Religions",
    "info": "An introduction to the development of different forms of religious practice in Japan over the past fourteen hundred years. A survey of Japanese religions and their development will be combined with specific examples (past and present) that demonstrate the way that religious belief has manifested itself in various forms of cultural practice.",
    "prereq": {}
  },
  {
    "uid": "801734",
    "code": "RELS3377",
    "subject": "RELS",
    "number": "3377",
    "honors": false,
    "writing": false,
    "name": "Buddhism in China",
    "fullname": "A Thousand Years of Buddhism in China: Beliefs, Practices, and Culture",
    "info": "Buddhism in China, 4th-15th centuries. Introduction of Buddhism to China. Relevance of Buddhist teaching to indigenous thought (e.g., Taoism, Confucianism). Major \"schools\": Tiantai, Huayan, Chan/Zen, etc.. Cultural activities of monks, nuns, and lay believers.",
    "prereq": {}
  },
  {
    "uid": "799918",
    "code": "RELS3411",
    "subject": "RELS",
    "number": "3411",
    "honors": false,
    "writing": false,
    "name": "Intro Indian Phil",
    "fullname": "Introduction to Indian Philosophy",
    "info": "Major concepts. Principal schools of Indian philosophy. Traditional/contemporary views.",
    "prereq": {}
  },
  {
    "uid": "799921",
    "code": "RELS3414",
    "subject": "RELS",
    "number": "3414",
    "honors": false,
    "writing": false,
    "name": "Comp Religs So Asia",
    "fullname": "Comparative Religions of South Asia",
    "info": "Compares/contrasts basic philosophical concepts, literatures, ideologies, and ritualistic practices of Hinduism, Buddhism, and Jainism with those of Islam and Sikhism.",
    "prereq": {}
  },
  {
    "uid": "802926",
    "code": "RELS3415W",
    "subject": "RELS",
    "number": "3415",
    "honors": false,
    "writing": true,
    "name": "Art of India",
    "fullname": "Art of India",
    "info": "Indian sculpture, architecture, and paintings from the prehistoric Indus Valley civilization to the present day.",
    "prereq": {}
  },
  {
    "uid": "010767",
    "code": "RELS3501",
    "subject": "RELS",
    "number": "3501",
    "honors": false,
    "writing": false,
    "name": "Ancient Israel:Biblical Origin",
    "fullname": "Ancient Israel: The Origins of Israel in Biblical Traditions",
    "info": "Foundation of the Hebrew people. Traditions of patriarchal period, development of Israelite religious/legal institution. Ancient Near Eastern context of Israel's origins.\n\nprereq: Hebrew not required",
    "prereq": {}
  },
  {
    "uid": "790794",
    "code": "RELS3502W",
    "subject": "RELS",
    "number": "3502",
    "honors": false,
    "writing": true,
    "name": "Anc Israel: Conquest to Exile",
    "fullname": "Ancient Israel: From Conquest to Exile",
    "info": "Israel and Judah were not states of great importance in the ancient Near East.  Their population and territory were small, and they could not resist conquest by larger, more powerful states like Assyria and Rome.  Yet their ancient history matters greatly today, out of proportion to its insignificance during the periods in which it transpired.  The historical experiences of the people of Israel and Judah were accorded religious meaning and literary articulation in the Hebrew Bible (the Old Testament), which became a foundational text for Judaism, Christianity, and Islam.  Essential features of Western as well as Islamic civilization are predicated on some element of Israel’s ancient past, as mediated through the Bible; therefore it behooves us to understand that past.  But the Bible is a religious work, not a transcript of events, and the history of ancient Israel is not derived merely from reading the biblical accounts of it.  Archaeological excavations have revealed the physical remains of the cultures of Israel and neighboring lands, as well as bringing to light inscriptions, documents, and literary works produced by those cultures.  These sources, which complement and sometimes contradict the accounts conveyed in the Bible, provide the basis for reconstructing a comprehensive history of ancient Israel.This course covers the history of Israel and Judah from the Late Bronze Age (c. 1550-1200 BCE), by the end of which Israel had emerged as a distinct ethnic entity, to the period of Roman rule (63 BCE-330 CE), which saw the final extinction of ancient Israel, represented by the kingdom of Judea, as a political entity.  Knowledge of this history is based on archaeological, epigraphic, and literary sources, including the Hebrew Bible.N.B.: Students should be aware that the study of history, like all the human and natural sciences, is predicated on inquiry, not a priori judgments.  Accordingly, the Bible is not privileged as an intrinsically true or authoritative record.  No text is presumed inerrant, and all sources are subject to scrutiny, in the context of scholarly discourse.  Biblical texts are treated just like all other texts, as the products of human beings embedded in a historical context, and as the subject of analysis and interpretation.  Persons of all faiths and of no faith are equally welcome to participate in such scholarly discourse.  However, students who feel that their own religious beliefs require an understanding of the Bible that is antithetical to the foregoing statements are cautioned that they may find themselves uncomfortable with this course.",
    "prereq": {}
  },
  {
    "uid": "010804",
    "code": "RELS3503",
    "subject": "RELS",
    "number": "3503",
    "honors": false,
    "writing": false,
    "name": "Hist/Israelite Rel",
    "fullname": "History and Development of Israelite Religion I",
    "info": "Survey of the evolution of Israelite religion. Cultic practices, law and religion, prophecy, religion and historiography. Relationship to surrounding religious systems.\n\nprereq: No knowledge of Hebrew required",
    "prereq": {}
  },
  {
    "uid": "010484",
    "code": "RELS3504",
    "subject": "RELS",
    "number": "3504",
    "honors": false,
    "writing": false,
    "name": "Jewish Resistance in Antiquity",
    "fullname": "Apocalypticism, Cosmic Warfare, and the Maccabees: Jewish Strategies of Resistance in Antiquity",
    "info": "The rise of Hellenistic kingdoms in the ancient Mediterranean and Near East created a variety of responses from local, subjugated peoples, and some of the most documented cases are those of Jewish populations in Koele-Syria/Palestine. The main objective of this course is to analyze Jewish responses to imperial rule and military conflict during the Hellenistic and early Roman periods (c. 300 B.C.E. - 150 C.E.), but we will also spend time examining the broader picture of how local, ancestral groups fared under foreign rule. Along with discussing pertinent archaeological evidence, we will discuss Jewish literature and documentary material from this period, including, the sectarian documents of the Dead Sea Scrolls, the Book of Judith (a Jewish \"novel\"), the Books of Daniel and the Maccabees (all of which provide historical information about the Maccabean revolt and rise of the Hasmoneans), and the writings of Josephus (a Jewish writer who witnessed the Roman takeover of Palestine in the first century C.E.). This course will stay within the confines of the ancient evidence and not examine later interpretations when analyzing each historical period; it will begin with Ptolemaic control of the region and conclude with the Bar Kokhba revolt, its aftermath, and the resilience of Jewish populations in northern Palestine. Topics that will be examined in depth are messianism and apocalypticism, the Jerusalem Temple, Jewish ancestral traditions (which include \"biblical\" literature), and theoretical models used by scholars to analyze power relationships in antiquity.",
    "prereq": {}
  },
  {
    "uid": "805610",
    "code": "RELS3520",
    "subject": "RELS",
    "number": "3520",
    "honors": false,
    "writing": false,
    "name": "History of the Holocaust",
    "fullname": "History of the Holocaust",
    "info": "Study of 1933-1945 extermination of six million Jews and others by Nazi Germany on basis of race. European anti-Semitism. Implications of social Darwinism and race theory. Perpetrators, victims, onlookers, resistance.  Theological responses of Jews and Christians.",
    "prereq": {}
  },
  {
    "uid": "010535",
    "code": "RELS3521W",
    "subject": "RELS",
    "number": "3521",
    "honors": false,
    "writing": true,
    "name": "History of the Holocaust",
    "fullname": "History of the Holocaust",
    "info": "Study of the 1933-1945 extermination of six million Jews and others by Nazi Germany on the basis of race. European anti-Semitism, implications of social Darwinism and race theory, perpetrators, victims, onlookers, resistance, and theological responses of Jews and Christians.",
    "prereq": {}
  },
  {
    "uid": "798786",
    "code": "RELS3535",
    "subject": "RELS",
    "number": "3535",
    "honors": false,
    "writing": false,
    "name": "Death and Afterlife",
    "fullname": "Death and the Afterlife in the Ancient World",
    "info": "Beliefs, attitudes, and behaviors related to death and afterlife found in cultures of ancient Mediterranean and Near East. Literature, funerary art/epitaphs. Archaeological evidence for burial practices and care of dead.",
    "prereq": {}
  },
  {
    "uid": "803593",
    "code": "RELS3541",
    "subject": "RELS",
    "number": "3541",
    "honors": false,
    "writing": false,
    "name": "Age of St. Augustine of Hippo",
    "fullname": "Age of St. Augustine of Hippo",
    "info": "Cultural diversity (A.D. 363 to circa 500 A.D.). Replacement of Roman Empire in Western Europe by barbarian kingdoms, consolidation of Constantinople. Literature, art, thought resulting from Christianity and Augustine of Hippo. Meets with CNES 3108.",
    "prereq": {}
  },
  {
    "uid": "805576",
    "code": "RELS3542",
    "subject": "RELS",
    "number": "3542",
    "honors": false,
    "writing": false,
    "name": "Age of Justinian and Muhammad",
    "fullname": "The Age of Justinian and Muhammad (c.500-c.700 A.D.)",
    "info": "Uses sources written between 500 and 700 A.D. to consider history, art, religion, and architecture of Golden Age of Byzantium, its superpower relations with Persian Empire. Way that Arab invasions from mid-7th century altered configuration of Mediterranean world and Near East.",
    "prereq": {}
  },
  {
    "uid": "814008",
    "code": "RELS3543",
    "subject": "RELS",
    "number": "3543",
    "honors": false,
    "writing": false,
    "name": "Pagans, Christians, Barbarians",
    "fullname": "Pagans, Christians, Barbarians: The World of Late Antiquity",
    "info": "Between classical and medieval, pagan and Christian, Roman and barbarian, the late antique world was a dynamic age. This course focuses on the Mediterranean region from the 2nd to the mid-7th century exploring such topics as the conversion of Constantine, the fall of Rome, barbarian invasions, the spread of Christianity, and the rise of Islam.",
    "prereq": {}
  },
  {
    "uid": "815031",
    "code": "RELS3544W",
    "subject": "RELS",
    "number": "3544",
    "honors": false,
    "writing": true,
    "name": "World Christianity: 100-1400",
    "fullname": "Martyrs, Monks, Crusaders: World Christianity, 100-1400",
    "info": "This course surveys the history of Christianity from its status as a persecuted minority religion of the Roman Empire to its dominant role in medieval Europe and Byzantium. We study Christian traditions in Asia and Africa as well as Europe with special attention to the relationship between Christianity and culture in the ancient and medieval world.",
    "prereq": {}
  },
  {
    "uid": "816846",
    "code": "RELS3545W",
    "subject": "RELS",
    "number": "3545",
    "honors": false,
    "writing": true,
    "name": "World Christianity, 1300-1800",
    "fullname": "World Christianity, 1300-1800 Reformers, Radicals and Revolutionaries",
    "info": "This course, which requires no prerequisite, examines developments in the history of Christianity from the beginning of the fourteenth century to the end of the eighteenth. We will start our investigation by considering the Latin church with its headquarters in Rome at the height of its power and influence. We will then trace its development through the crises of the fourteenth century and its subsequent transformation during the Reformation and the Confessional era. We will close by considering new challenges facing the church in an age of Enlightenment and Revolution. Though our geographic center of gravity will be in Europe, we will follow the expansion of Christianity into the Asian, African and American worlds and how developments here changed the nature of the church back in Europe. We will study religion as a phenomenon that affects human activity in a broad spectrum of area and activities. Though we will investigate formal matters of belief, significant attention will be given to Christianity as a lived experience, and how faith affected the everyday life of men and women in the premodern world.",
    "prereq": {}
  },
  {
    "uid": "818760",
    "code": "RELS3609",
    "subject": "RELS",
    "number": "3609",
    "honors": false,
    "writing": false,
    "name": "Intersectional Medieval Art",
    "fullname": "Intersectional Medieval Art",
    "info": " Grounded in critical race theory, intersectionality, and queer theory, this class draws on primary texts and a range of visual and material sources to trace the histories, experiences, and representations of marginalized identities in the medieval world. We will consider gender, sexuality, and race in the context of Jewish, Christian, and Islamic cultures during the Middle Ages. This class will examine topics including transgender saints, miraculous transformations, demonic possession, female artists and patrons, the \"monstrous races\" of travel accounts, and gender-affirming surgeries. In contrast to misconceptions of a homogenous white European past, the reality of medieval Europe was diverse and complex, and its boundaries - geographical, cultural, bodily, and otherwise - were in flux, as reflected in its visual and material culture.",
    "prereq": {}
  },
  {
    "uid": "802933",
    "code": "RELS3611",
    "subject": "RELS",
    "number": "3611",
    "honors": false,
    "writing": false,
    "name": "Eastern Orthodoxy",
    "fullname": "Eastern Orthodoxy: History and Culture",
    "info": "Development of orthodox church in Byzantium, Islamic Near East, Slavic world, and diaspora. Impact of orthodoxy on political/cultural institutions. Interaction with other Christian/non-Christian communities. Orthodox spirituality/aesthetics.",
    "prereq": {}
  },
  {
    "uid": "808611",
    "code": "RELS3612",
    "subject": "RELS",
    "number": "3612",
    "honors": false,
    "writing": false,
    "name": "Baroque Rome: Art and Politics",
    "fullname": "Baroque Rome: Art and Politics in the Papal Capital",
    "info": "This course explores the center of Baroque culture, Rome, as a city of spectacle and pageantry. The urban development of the city, as well as major works in painting, sculpture, and architecture, are considered within their political and religious context, with special emphasis on the ecclesiastical and private patrons who transformed the Eternal City into one of the world's great capitals. ",
    "prereq": {}
  },
  {
    "uid": "803017",
    "code": "RELS3621W",
    "subject": "RELS",
    "number": "3621",
    "honors": false,
    "writing": true,
    "name": "The Christian Right and Left",
    "fullname": "The Christian Right and Left in America: Protestant Liberals, Evangelicals, and Fundamentalists",
    "info": "Religious, historical, social, and scientific thought/practice across three main U.S. Protestant groups since 1820. Historical processes that brought about diverse understandings of Christianity, theologies, and worship. Theological left/right views of views of society, history, and science, that influence public debates.",
    "prereq": {}
  },
  {
    "uid": "803590",
    "code": "RELS3622",
    "subject": "RELS",
    "number": "3622",
    "honors": false,
    "writing": false,
    "name": "Early US Religious Encounters",
    "fullname": "Religious Encounters in Early America",
    "info": "The United States is home to an astonishing array of religious beliefs and institutions, yet mutual toleration has historically been harder to achieve.  This upper-level course, which is run as a discussion seminar, uses case studies to investigates how people of differing faiths perceived, reacted to, and changed each other, between the arrival of Jesuits and Puritans in the early 17th century and the US-Dakota War of 1862.  People who hailed from North America, Europe, and Africa had divergent ideas about the divine and its presence on Earth, about life and life after death, about religious rituals and relations of authority.  Their struggles with one another were partly struggles over religiously inflected ways of being in the world.  The course explores how religion shaped people?s responses to European colonization, the growing slave-labor system, industrialization, immigration, and westward expansion.  A religious lens onto American history reveals religion as an element of struggle and shows that freedom of conscience has been continually contested rather than easily assured.   \n\nprereq: Non-fr or instr consent",
    "prereq": {}
  },
  {
    "uid": "803604",
    "code": "RELS3623",
    "subject": "RELS",
    "number": "3623",
    "honors": false,
    "writing": false,
    "name": "Religion and US Culture Wars",
    "fullname": "Religion and the American Culture Wars",
    "info": "Thomas Jefferson, Benjamin Franklin, James Madison, Thomas Paine, George Washington, and John Adams on religion, faith, and religion in politics. Deism. Enlightenment-era discussions about rational religion. Rise of evangelicalism.\nSeparation of church/state, framers' original intent for first amendment. Religious Right.",
    "prereq": {}
  },
  {
    "uid": "816305",
    "code": "RELS3624",
    "subject": "RELS",
    "number": "3624",
    "honors": false,
    "writing": false,
    "name": "Atheists as 'Others'",
    "fullname": "Atheists as “Other”: Religious and Nonreligious Outsiders in the US",
    "info": "What does it mean to be an atheist in the United States today? Atheists comprise a small percentage of the American population, but one with an increasingly visible presence in popular culture, political discourse, & everyday life. How do atheists organize into groups oriented toward identity-formation, social connection, and political action?prereq: 1001 recommended",
    "prereq": {
      "and": [
        "010734"
      ]
    }
  },
  {
    "uid": "815431",
    "code": "RELS3625",
    "subject": "RELS",
    "number": "3625",
    "honors": false,
    "writing": false,
    "name": "Magic and Medicine",
    "fullname": "Magic and Medicine",
    "info": "Course examines how the line between magic and medicine has changed over time. From accusations of witchcraft to proclamations of scientific breakthrough, we will examine the relationship between the supernatural and the natural from the early modern period to today. Specific topics include the practice of exorcism, the concept of the \"four humors,\" the persecution of witches, the development of \"voodoo,\" the effectiveness of placebos, and the professionalization of medicine. Throughout, we will ask how gender, class, and race have affected the construction of \"magic\" and \"medicine.\"",
    "prereq": {}
  },
  {
    "uid": "817333",
    "code": "RELS3626W",
    "subject": "RELS",
    "number": "3626",
    "honors": false,
    "writing": true,
    "name": "Witches, Seers, and Saints",
    "fullname": "Witches, Seers, and Saints: Women, Gender, and Religion in the U.S.",
    "info": "This course examines the development and ramifications of gender ideologies within several religious groups in North America from the colonial period to the present and explores women's strategies that have contributed to and resisted these ideologies.",
    "prereq": {}
  },
  {
    "uid": "817194",
    "code": "RELS3627",
    "subject": "RELS",
    "number": "3627",
    "honors": false,
    "writing": false,
    "name": "End of World Lit & History",
    "fullname": "The End of the World in Literature and History",
    "info": "For at least two and a half millennia, prophets, politicians, and poets have crafted terrifying accounts about the end of the world. This comparatist seminar examines the way different cultures have imagined a final apocalypse with particular attention to the political and social consequences of their visions. Students will read texts that focus on pandemic, extraterrestrial attack, nuclear holocaust, prophecy, cybernetic revolt, divine judgment, resource depletion, meteoric impact, or one of the many other ways in which humans write of their demise. They will use literary analysis to explore the many historical and contemporary wastelands they will encounter. They will write short papers and give in-class presentations on different kinds of apocalypse.",
    "prereq": {}
  },
  {
    "uid": "819133",
    "code": "RELS3628",
    "subject": "RELS",
    "number": "3628",
    "honors": false,
    "writing": false,
    "name": "Jewish American Literature",
    "fullname": "Jewish American Literature: Religion, Culture, and the Immigrant Experience",
    "info": "Immigrant? Jewish? American?  What do these labels mean, why are they applied, and do they ever cease to be applicable? Can we distinguish religion from culture, and what are the implications when we try? Why is it frequently asked whether Saul Bellow was “really” a Jewish writer, but it is impossible to read Philip Roth as anything other than that? How does Grace Paley’s “Jewishness” come through even when she is writing about non-Jewish characters? We will address these issues and others as we explore the literature growing out of the Jewish immigrant experience in America, as well as the literature by Jewish writers more firmly, though still sometimes anxiously, rooted in American soil.In this course we will engage in a highly contextualized and historicized study of Jewish American literature from the 19th century to today.  We will discover in these texts how inherited Jewish culture and literary imaginings, developed over centuries of interaction between Jewish communities and the “outside world,” get reexamined, questioned, rejected, reimagined, reintegrated, and transformed within the crucible of American experience. The discussions that ensue will also provide a framework for engaging with the creative energies and cultural productivity of more recent immigrant communities in the United States and beyond. Immigration and the experience of immigrant communities continues to be at the forefront of American consciousness, as immigrants work to create new meanings and new narratives for their lives, and as those who immigrated before them provide contested meanings for the impact of immigration on their own narratives. This course, though grounded in Jewish narratives, will therefore provide students with an expanded vocabulary and perspective for engaging in this central and very current debate within the American experience. ",
    "prereq": {}
  },
  {
    "uid": "818942",
    "code": "RELS3631",
    "subject": "RELS",
    "number": "3631",
    "honors": false,
    "writing": false,
    "name": "Islam in America",
    "fullname": "Islam in America: A History of the Present",
    "info": "From the “Age of Discovery” and the African slave trade, to Malcolm X and the War on Terror, Islam has long been an integral part of the American landscape. In this course students will examine the history of Islam and social formation of Muslim communities in the United States. We will approach this history in the plural: as histories of Islam in America, paying particular attention to the different local and global dynamics that led to the migration of this racially, ethnically, and class variegated community. This course will explore how racial, national, cultural, and sectarian differences within and between Muslim communities shape and challenge the notion of a singular Islam or Muslim community. We will ask how and why Islam and Muslims have been characterized - both historically and today - as a \"problem\" in/for America. What does the emergence of terminology like “American Muslim” and “American Islam” tell us about these historical tensions, conceptions of good/bad citizenship, and identity politics more broadly, in the United States today? ",
    "prereq": {}
  },
  {
    "uid": "799919",
    "code": "RELS3671",
    "subject": "RELS",
    "number": "3671",
    "honors": false,
    "writing": false,
    "name": "Hinduism",
    "fullname": "Hinduism",
    "info": "Development of Hinduism focusing on sectarian trends, modern religious practices, myths/rituals, pilgrimage patterns/ religious festivals. Interrelationship between Indian social structure/Hinduism.",
    "prereq": {}
  },
  {
    "uid": "802128",
    "code": "RELS3679",
    "subject": "RELS",
    "number": "3679",
    "honors": false,
    "writing": false,
    "name": "Religion in South Asia",
    "fullname": "Religion and Society in Modern South Asia",
    "info": "Survey of religious formations in premodern India (Hindu, Islamic, Sikh). Transformation of religious practice/thought. Religion and nationalism. Geopolitical dimensions of religious transformation in South Asia.",
    "prereq": {}
  },
  {
    "uid": "818277",
    "code": "RELS3704",
    "subject": "RELS",
    "number": "3704",
    "honors": false,
    "writing": false,
    "name": "Exploring the Quran",
    "fullname": "Exploring the Quran: An intellectual odyssey with Islam's holy scripture",
    "info": "This course explores the contents of the Quran and probes its place in the history of human civilization. Students will learn about, and critically reflect on, the following subjects: 1) the Quran's core ideas, stories, laws, parables, and arguments, 2) the historical context in which the Quran was first promulgated and codified, 3) the relationship between the Quran and the preceding literary traditions of the ancient world, in particular, the Bible and post-biblical Jewish and Christian writings, 4) Muslim utilization of the Quran towards intellectual, social, religious, cultural, and political ends, and 5) the pre-modern and modern scholarly traditions of interpreting the Quran.",
    "prereq": {}
  },
  {
    "uid": "816967",
    "code": "RELS3706W",
    "subject": "RELS",
    "number": "3706",
    "honors": false,
    "writing": true,
    "name": "Art of Islam",
    "fullname": "Art of Islam",
    "info": "Architecture, painting, and other arts from Islam's origins to the 20th century. Cultural and political settings as well as themes that unify the diverse artistic styles of Islamic art will be considered.",
    "prereq": {}
  },
  {
    "uid": "813402",
    "code": "RELS3707W",
    "subject": "RELS",
    "number": "3707",
    "honors": false,
    "writing": true,
    "name": "Anthropology: The Middle East",
    "fullname": "Anthropology of the Middle East",
    "info": "Anthropological field methods of analyzing/interpreting Middle Eastern cultures/societies.",
    "prereq": {}
  },
  {
    "uid": "810723",
    "code": "RELS3708",
    "subject": "RELS",
    "number": "3708",
    "honors": false,
    "writing": false,
    "name": "The Cultures of the Silk Road",
    "fullname": "The Cultures of the Silk Road",
    "info": "Past/present state of cultures that flourished in Central Asia (present-day CA republics, Iran, Afghanistan) after Alexander the Great. Decline with opening of sea routes.",
    "prereq": {}
  },
  {
    "uid": "808528",
    "code": "RELS3709",
    "subject": "RELS",
    "number": "3709",
    "honors": false,
    "writing": false,
    "name": "Ancient Iran",
    "fullname": "Ancient Iran",
    "info": "Development of ancient Iranian culture under Achaemenians and Sassanians. Impact of Zoroastrian religion on Iranians, on Hellenism, and on domains such as Bactria. Iran's contribution to cultures of Silk Road.",
    "prereq": {}
  },
  {
    "uid": "802700",
    "code": "RELS3711",
    "subject": "RELS",
    "number": "3711",
    "honors": false,
    "writing": false,
    "name": "The Islamic World",
    "fullname": "The Islamic World",
    "info": "The Islamic World provides a comprehensive introduction of Islam from its inception to today. The course’s journey begins with Islam’s dawn in the small desert oasis of Mecca in the Arabian peninsula over 14 centuries ago to today when it is a worldwide faith. One hundred years from its inception, Islam spread to what is today Syria, Iraq, the Horn of Africa, North Africa, and across the Mediterranean Sea. Central Asia, the Indian subcontinent, and Anatolia (Turkey) came under the sway of Islam leading to the emergence of three major Islamic civilization that dominated and enlightened the old world for several centuries. This era came to an end with the rise of Capitalist Europe and its colonization of much of the world including Muslim societies. Like many colonized peoples, Muslims threw the yoke of colonialism and joined the postcolonial World. Beyond this historical geographic survey, the course examines the Muslim World’s relationships with the West, democracy, and development. It also explore how Muslims and Islam engage the seemingly contemporary topics such as human rights, gender relations, the monumental environmental crisis of our time, the war on terror and the terror of war, and the Palestinian-Israeli conflict.  Marhaba or Soo Dhawoow (Welcome).  ",
    "prereq": {}
  },
  {
    "uid": "792260",
    "code": "RELS3712",
    "subject": "RELS",
    "number": "3712",
    "honors": false,
    "writing": false,
    "name": "Islam: Religion and Culture",
    "fullname": "Islam: Religion and Culture",
    "info": "This course is a brief survey of the religion and civilization of Islam. It introduces students to 1) Islamic history from its inception in the seventh century CE to the present, with emphasis on the life of the Prophet Muhammad and the early Caliphate; 2) The authoritative texts of Islam, i.e. the Quran and Prophetic traditions (Hadith); 3) The institutions and discourses characteristic of Islamic civilization; and 4) The transformation of Muslim life and thought in the modern period. By taking this course, students become familiar with the chief ideas, characters, narratives, rites, localities, and movements associated with Islam.prereq: Soph or jr or sr",
    "prereq": {}
  },
  {
    "uid": "807930",
    "code": "RELS3713",
    "subject": "RELS",
    "number": "3713",
    "honors": false,
    "writing": false,
    "name": "The History of Modern Iran",
    "fullname": "Modern Iran: Nationalism, Religion, and the Struggle to Create Modern Iran",
    "info": "Iranian history from the fall of the Sassanids (7th C. CE) to the present. Shi'ite Islam in a world context. Iranian dynasties. Iran's entrance into modern world politics.",
    "prereq": {}
  },
  {
    "uid": "802979",
    "code": "RELS3714",
    "subject": "RELS",
    "number": "3714",
    "honors": false,
    "writing": false,
    "name": "Islam and the West",
    "fullname": "Islam and the West",
    "info": "Cultural/intellectual trends that have defined differences between Islam and the West. Development of historical, philosophical, and intellectual mindset ofboth spheres. Factors in tension, anxiety, and hatred between Muslim world and Europe and the United States.",
    "prereq": {}
  },
  {
    "uid": "803019",
    "code": "RELS3715",
    "subject": "RELS",
    "number": "3715",
    "honors": false,
    "writing": false,
    "name": "History of the Crusades",
    "fullname": "History of the Crusades",
    "info": "Crusading spirit in Europe. Results of classic medieval crusades ca 1095-1285. States established by crusaders in Near East. Internal European crusades. Chronologicalprolongation of crusading phenomenon.",
    "prereq": {}
  },
  {
    "uid": "807153",
    "code": "RELS3716",
    "subject": "RELS",
    "number": "3716",
    "honors": false,
    "writing": false,
    "name": "Gender in the Islamic World",
    "fullname": "Gender and the Family in the Islamic World",
    "info": "This course explores the experiences of Muslim women and Muslim families from a historical and comparative perspective. Expanding the discussion on Muslim women's lives and experiences beyond the Middle East, by also centralizing on the experiences of Muslim women and families outside of this geographical area highlights the complex and diverse everyday experiences of Muslim women around the world. This wider lens exposes the limitations intrinsic in the stereotypical representation of Muslims in general and Muslim women in particular. We will explore the intricate web of gender and family power relations, and how these are contested and negotiated in these societies. Some of the themes the course explores include the debates on Muslim women and colonial representations, sexual politics, family, education and health, women and paid work, gender and human rights, and Islamic feminisms debates.prereq: At least soph; 1001 recommended",
    "prereq": {
      "and": [
        "010734"
      ]
    }
  },
  {
    "uid": "808760",
    "code": "RELS3717",
    "subject": "RELS",
    "number": "3717",
    "honors": false,
    "writing": false,
    "name": "Christians, Muslims, and Jews",
    "fullname": "Christians, Muslims, and Jews in the Middle Ages",
    "info": "A Pew Research survey of the global religious landscape in 2010 found 2.2 billion Christians (31.5% of the world?s population), 1.6 billion Muslims (23.2%), and 14 million Jews (.2%). In this class, we explore how the histories of these religious communities became deeply entangled in an age of diplomacy, trade, jihad, and crusade.",
    "prereq": {}
  },
  {
    "uid": "809568",
    "code": "RELS3718W",
    "subject": "RELS",
    "number": "3718",
    "honors": false,
    "writing": true,
    "name": "Christ in Islamic Thought",
    "fullname": "Christ in Islamic Thought",
    "info": "Course examines the history of the figure of Christ in Islamic thought, from the beginnings of Islam in the Qur'an and the Hadith to the recent 2013 book by Reza Aslan, Zealot. The course is based on close reading of primary sources from regions extending from Spain to Iran, and in various languages (in translation): Arabic, Greek, French, Farsi, and Italian. Course demonstrates how much the interpretation of the figure of Christ in Islamic thought belonged to specific historical contexts.",
    "prereq": {}
  },
  {
    "uid": "811356",
    "code": "RELS3719",
    "subject": "RELS",
    "number": "3719",
    "honors": false,
    "writing": false,
    "name": "Jews/Muslims: Medieval Iberia",
    "fullname": "Jews and Muslims in Medieval Iberia",
    "info": "Cultural production of Sephardic Jews/Andalusi Muslims. Andalusi poetry. Fiction of alSaraqusti, Judah alHarizi/Juan Ruiz. Treatises of Averroes/Maimonides. How cultural assimilation in medieval alAndalus complicates notions of identity, subalternity, postcoloniality. How literary, historical, philosophical, theological works of major Jewish/Muslim thinkers survived among later Spanish Christian intellectuals.",
    "prereq": {}
  },
  {
    "uid": "815107",
    "code": "RELS3721",
    "subject": "RELS",
    "number": "3721",
    "honors": false,
    "writing": false,
    "name": "North Africa since 1500",
    "fullname": "North Africa since 1500: Islam, Colonialism, and Independence",
    "info": "History of Maghrib (Morocco, Algeria, Tunisia, Libya, disputed territories of Western Sahara) from time of Ottoman expansion/Sharifian dynasties (Sa'dian/'Alawid) in 16th/17th Centuries to end of 20th century. Focus on encounter of Islamic cultures/societies of Maghrib with Africa/Europe.",
    "prereq": {}
  },
  {
    "uid": "817697",
    "code": "RELS3722",
    "subject": "RELS",
    "number": "3722",
    "honors": false,
    "writing": false,
    "name": "The Ottoman Empire",
    "fullname": "The Ottoman Empire",
    "info": "Survey of Islam's most successful empire, from its founding circa 1300 to its demise in 1923. Lands, institutions, peoples, historical legacy.",
    "prereq": {}
  },
  {
    "uid": "819041",
    "code": "RELS3724",
    "subject": "RELS",
    "number": "3724",
    "honors": false,
    "writing": false,
    "name": "Islam/Modernity in South Asia",
    "fullname": "Islam and Modernity in South Asia",
    "info": "This course explores the multiple genealogical trajectories of Islamic thought in South Asia through the varied lens of its literary traditions. For centuries, literature has remained an important site for the expression of Islamic identity and its interaction with the larger history of the subcontinent. Muslim writers have traversed diverse domains of human experience through multiple genres: while poetry has been a widely celebrated genre for the expression of private love, drama has emerged as a crucial site for public politics and activism. In this course, students will read texts that have circulated across South Asia and interpret them in relation to enduring questions about power, justice, identity, community and love (both human and divine) in Islam. Reading a wide array of works from diverse temporal and spatial locations, this course examines how the aesthetic and discursive world of South Asia provides a terrain on which the Islamic \"socius\" of the region has come to define itself in a unique manner. In addition, we also investigate how these literary cultures-at different historical junctures-articulated a secular ethos to define Hindu-Muslim relations in the subcontinent. We further discuss questions of genres-epic, romance, drama, novel and lyric-as a way of thinking about the circulation of literary forms across languages, cultures and national spaces in the past and the present. ",
    "prereq": {}
  },
  {
    "uid": "826912",
    "code": "RELS3773",
    "subject": "RELS",
    "number": "3773",
    "honors": false,
    "writing": false,
    "name": "Islamic Mysticism & Modernism",
    "fullname": "Islamic Mysticism and Modernism",
    "info": "This course offers an introduction to the tradition of Islamic mysticism, or Sufism. It aims to first develop an understanding of the mystical perspectives within Islam that have influenced most of the world’s Muslim population, and then to understand how that tradition has changed under the conditions of modernity. Throughout Islamic history, Sufis (Islamic mystics) developed fascinating philosophical theories and beautiful literature, attempting to answer questions about the meaning of life and the nature of reality. We will read Islamic mystical texts that explore everything from hidden meanings of the Qur’an, to dreams and supernatural powers, to sex, love, and spiritual connection with God, written by mystics from Africa to the Middle East to China and beyond. We will also examine what happens to Sufism in the modern period, given challenges from colonialism as well as alternate schools of thought within Islam, and consider the writings of the Sufis’ opponents: Salafis, socialists, secularists, and other modernizers.\n\nAll readings will be in English translation and no prior knowledge of Islam or foreign languages is required for this class.",
    "prereq": {}
  },
  {
    "uid": "819852",
    "code": "RELS3777",
    "subject": "RELS",
    "number": "3777",
    "honors": false,
    "writing": false,
    "name": "Indian Empires after 1200",
    "fullname": "The Diversity of Traditions: Indian Empires after 1200",
    "info": "This class considers the development of Indian and Pakistani art and architecture from the introduction of Islam as a major political power at the end of the 12th century to the colonial empires of the 18th century.  We will study how South Asia's diverse ethnic and religious communities interacted, observing how visual and material cultures reflect differences, adaptations, and shared aesthetic practices within this diversity of traditions. Students in this class will have mastered a body of knowledge about Indian art and probed multiple modes of inquiry. We will explore how Muslim rulers brought new traditions yet maintained many older ones making, for example, the first mosque in India that combines Muslim and Indic visual idioms. We will study the developments leading to magnificent structures, such as the Taj Mahal, asking why such a structure could be built when Islam discourages monumental mausolea.  In what ways the schools of painting that are the products of both Muslim and Hindu rulers different and similar? The course will also consider artistic production in the important Hindu kingdoms that ruled India concurrently with the great Muslim powers. In the 18th century, colonialist forces enter the subcontinent, resulting in significant innovative artistic trends. Among questions we will ask is how did these kingdoms influence one another? Throughout we will probe which forms and ideas seem to be inherently Indian, asking which ones transcend dynastic, geographic and religious differences and which forms and ideas are consistent throughout these periods of political and ideological change.  To do all this we must constantly consider how South Asia's diverse ethnic and religious communities interact.There are no prerequisites for this course.",
    "prereq": {}
  },
  {
    "uid": "825131",
    "code": "RELS3779",
    "subject": "RELS",
    "number": "3779",
    "honors": false,
    "writing": false,
    "name": "The Indian Temple",
    "fullname": "Visions of Paradise: The Indian Temple",
    "info": "This course traces the development and diversity of the Indian temple, focusing the ways in which people interact with sacred space and how religious art addresses its viewers. We primarily focus on Hinduism, but also include Buddhism and Jainism. We will discuss the role of sculpture, painting, textiles, dance, and food within the temple.  We will also examine how the legacy of colonial and orientalist scholarship inflects our study of these traditions and monuments.Although the architecture of both structural and rock-cut temples will be our main object of study, we will also discuss the role of sculpture, painting, textiles, and food within the temple. Our consideration of the structures will be attentive to the ways in which people interact with the space and how objects of sacred art address their viewers. In classroom discussions, we will work together to create an interpretive model that is synthetic, critical, and appreciative of the enormously diverse field that is South Asian Art. Lectures will move from explanatory descriptions of objects and histories that are covered in the textbook to critical interpretations of the historiographies that shape their contemporary reception. Class discussions and assignments are intended to encourage students to bring their own ways of looking at this art, to read critically in light of what they see, and to consider new approaches to the material. No prior experience in the history of art or religions of South Asia is required for this course. ",
    "prereq": {}
  },
  {
    "uid": "803567",
    "code": "RELS3801",
    "subject": "RELS",
    "number": "3801",
    "honors": false,
    "writing": false,
    "name": "Philosophy of Religion",
    "fullname": "Philosophy of Religion",
    "info": "Conceptual problems that arise from attempts to provide rational justification for religious belief.",
    "prereq": {}
  },
  {
    "uid": "818528",
    "code": "RELS3896",
    "subject": "RELS",
    "number": "3896",
    "honors": false,
    "writing": false,
    "name": "Internship for Academic Credit",
    "fullname": "Internship in Religion, Society, and Culture",
    "info": "Guided academic and vocational reflection on an internship supervised by a religious studies faculty member. Intended to support an applied learning experience in an agreed-upon, short-term, supervised workplace activity, with defined goals which are related to the academic study of religion, society, and culture. A student may only earn credit for a given internship through one course at a time. ",
    "prereq": {}
  },
  {
    "uid": "800919",
    "code": "RELS3970",
    "subject": "RELS",
    "number": "3970",
    "honors": false,
    "writing": false,
    "name": "Suppl. Disc in Religious Stds",
    "fullname": "Supplemental Discussion in Religious Studies",
    "info": "Extra discussion section attached to a religious studies course/event.",
    "prereq": {}
  },
  {
    "uid": "008603",
    "code": "RELS3993",
    "subject": "RELS",
    "number": "3993",
    "honors": false,
    "writing": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "Student works with faculty on a subject decided upon by both.",
    "prereq": {}
  },
  {
    "uid": "802671",
    "code": "RELS4003",
    "subject": "RELS",
    "number": "4003",
    "honors": false,
    "writing": false,
    "name": "Mediev Phil",
    "fullname": "General History of Western Philosophy: Medieval Period",
    "info": "Survey of several major figures in western philosphy, e.g., Augustine (pre-medieval), Anselm, Maimonides, Aquinas, Ockham, Cusanus.",
    "prereq": {}
  },
  {
    "uid": "802672",
    "code": "RELS4049",
    "subject": "RELS",
    "number": "4049",
    "honors": false,
    "writing": false,
    "name": "Religion and Culture",
    "fullname": "Religion and Culture",
    "info": "Our subtitle is “sacredness.” The operational presupposition of the class is that sacredness is more than a mental phenomenon: it involves objects and bodies. Modern perspectives on religion have long downplayed this “material” aspect as they privileged iconoclastic spirituality. The anthropology of religion aims to go beyond the material/spiritual opposition and asks how rituals employ objects and bodies in order to capture the effect we might call spiritual or mystical. Intellectually, this is an extremely difficult wisdom for the moderns to grasp because the binary oppositions between the spiritual and the material, between mind and the body, subtend modern society’s very sense of order and rationality. This class is successful if we can have even a glimpse of how much difficulty we moderns have in seeing beyond these binaries. \nTake, for example, sacrifice. It is almost intuitive that the human condition abides in the requisition of sacrifice: redemption is found by suffering, abundance secured by loss, and the gift of life enabled by death. Such an intuition is as universal as its practiced intent is ambiguous to us. Ambiguous because the following questions immediately rise: For whom or in whose \"eyes\" is a gesture of sacrificial offering supposed to be accounted for? If one facilitates one’s own death in the hands of one’s enemy in a redemptive gesture—which is, arguably, the case of Jesus Christ—would the enemy part of the redeemed? We will raise the most impenetrable of such questions through compelling examples in contemporary politics, such as the post-9/11 category of so-called religiously-motivated protest suicide. As Talal Asad argues, one of the reasons the \"suicide bombing\" is so disconcerting to us is not because of the extent of its violence—which is not remarkable compared to technology-driven terror tactics—but because the act violates our dearest binaries: victim/victimizer, dying/killing, means/ends, and crime/punishment. At the bottom of these binaries, as we will see in this class, is the binary opposition between materiality and spirituality. This issue will be expanded into modern society in the latter part of the class. \n\nThere are no prerequisites for this class. ",
    "prereq": {}
  },
  {
    "uid": "802129",
    "code": "RELS4309",
    "subject": "RELS",
    "number": "4309",
    "honors": false,
    "writing": false,
    "name": "Religion in Public Life",
    "fullname": "Religion in American Public Life: Culture, Politics, and Communities",
    "info": "How diversity/vitality of American religion shape public life. How religious groups engage in political action, foster understandings of democracy/styles of civic participation. Volunteering/service activities. Race, poverty, the family, sexuality.prereq: Soc majors/minors must register A-F",
    "prereq": {}
  },
  {
    "uid": "809508",
    "code": "RELS4952",
    "subject": "RELS",
    "number": "4952",
    "honors": false,
    "writing": false,
    "name": "Capstone",
    "fullname": "Capstone",
    "info": "Independent research/writing under supervision of faculty sponsor. In-depth research paper/comparable project to be completed in conjunction with RELS course.\n\nprereq: Limited to RELS majors and second semester junior and seniors. Please see director of Undergraduate Studies for permission.",
    "prereq": {}
  },
  {
    "uid": "825661",
    "code": "RELS4993",
    "subject": "RELS",
    "number": "4993",
    "honors": false,
    "writing": false,
    "name": "Capstone: Directed Study",
    "fullname": "Capstone: Directed Study",
    "info": "This Directed Study is an independent research project developed and completed by the student in consultation with a faculty member of their choice who serves as the capstone project advisor and project evaluator. The Capstone should be a culminating project of the student’s learning in Religious Studies, focused on a topic related to the Area Concentration section of the student’s individual major program.   Students enrolling in this directed study/research course will complete the University's Directed Study/Research contract with the faculty mentor/evaluator. The mentor/evaluator should have expertise in the chosen topic area and will ensure that academic standards are upheld, that the research proposed is at the appropriate level for the course and academic in nature, that the project is developed and executed by the student, and that the project scope is reasonable for one semester. Students should expect to devote 42 hours of work per credit to the project.  The faculty mentor/evaluator will consult regularly with the student and  ",
    "prereq": {}
  },
  {
    "uid": "797728",
    "code": "RELS5001",
    "subject": "RELS",
    "number": "5001",
    "honors": false,
    "writing": false,
    "name": "Theory and Method in Religion",
    "fullname": "Theory and Method in the Study of Religion: Critical Approaches to the Study of Religion",
    "info": "Theoretical/methodological issues in academic study of religion. Theories of origin, character, and function of religion as a human phenomenon. Psychological, sociological, anthropological, and phenomenological perspectives.prereq: Sr or grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "016387",
    "code": "RELS5013W",
    "subject": "RELS",
    "number": "5013",
    "honors": false,
    "writing": true,
    "name": "Biblical Law & Jewish Ethics",
    "fullname": "Biblical Law and Jewish Ethics",
    "info": "This course introduces students to the original meaning and significance of religious law and ethics within Judaism. Law is the single most important part of Jewish history and identity. At the same time, law is also the least understood part of Judaism and has often been the source of criticism and hatred. We shall therefore confront one of the most important parts of Jewish civilization and seek to understand it on its own terms. In demonstrating how law becomes a fundamental religious and ethical ideal, the course will focus on the biblical and Rabbinic periods but spans the entire history of Judaism. Consistent with the First Amendment, the approach taken is secular. There are no prerequisites: the course is open to all qualified students.The course begins with ideas of law in ancient Babylon and then studies the ongoing history of those ideas. The biblical idea that a covenant binds Israel to God, along with its implications for human worth - including the view of woman as person - will be examined. Comparative cultural issues include the reinterpretations of covenant within Christianity and Islam. The course investigates the rabbinic concept of oral law, the use of law to maintain the civil and religious stability of the Jewish people, and the kabbalistic transformation of law. The course concludes with contemporary Jewish thinkers who return to the Bible while seeking to establish a modern system of universal ethics.The premise of the course is the discipline of academic religious studies. The assumptions of the course are therefore academic and secular, as required by the First Amendment. All texts and all religious traditions will be examined analytically and critically. Students are expected to understand and master this approach, which includes questioning conventional cultural assumptions about the composition and authorship of the Bible. Willingness to ask such questions and openness to new ways of thinking are essential to success in the course.",
    "prereq": {}
  },
  {
    "uid": "797120",
    "code": "RELS5070",
    "subject": "RELS",
    "number": "5070",
    "honors": false,
    "writing": false,
    "name": "Topics in Religious Studies",
    "fullname": "Topics in Religious Studies",
    "info": "Topics specified in Class Schedule and Course Guide.",
    "prereq": {}
  },
  {
    "uid": "797980",
    "code": "RELS5071",
    "subject": "RELS",
    "number": "5071",
    "honors": false,
    "writing": false,
    "name": "Greek & Hellenistic Religions",
    "fullname": "Greek and Hellenistic Religions",
    "info": "Greek religion from Bronze Age to Hellenistic times. Literature, art, archaeology. Homer/Olympian deities. Ritual performance, prayer, sacrifice. Temple architecture. Death/afterlife. Mystery cults. Philosophical religion. Near Eastern salvation religions. Meets with 3071.",
    "prereq": {}
  },
  {
    "uid": "797184",
    "code": "RELS5072",
    "subject": "RELS",
    "number": "5072",
    "honors": false,
    "writing": false,
    "name": "The Birth of Christianity",
    "fullname": "The Birth of Christianity",
    "info": "Early Jesus movement in cultural/historical setting. Origins in Judaism. Traditions about Jesus. Apostle Paul, controversies/interpreters. Authority, religious practice, structure. Emergence of canon. Contemporary methods of New Testament study. Biblical writings as history/narrative. CNES 3072/CNES 5072/RELS 3072/RELS 5072 meet together.",
    "prereq": {}
  },
  {
    "uid": "797616",
    "code": "RELS5073",
    "subject": "RELS",
    "number": "5073",
    "honors": false,
    "writing": false,
    "name": "Roman Rel & Early Christianity",
    "fullname": "Roman Religion and Early Christianity",
    "info": "Etruscan, Republican relgion. Appeal of non-Roman cults. Ruler worship. Christians in Asia Minor, Egypt, and the West. Popular piety, Christian and non-Christian. Rabbinic Judaism. Varieties of Christianity in 2nd and 3rd centuries. Influence of Greco-Roman culture on emerging church. Constantine and Julian.",
    "prereq": {}
  },
  {
    "uid": "800230",
    "code": "RELS5076",
    "subject": "RELS",
    "number": "5076",
    "honors": false,
    "writing": false,
    "name": "The Apostle Paul",
    "fullname": "Apostle Paul: Life, Letters, and Legacy",
    "info": "How/what can we know about Paul. What his message was. What he was fighting. How he was later understood by friends/foes.",
    "prereq": {}
  },
  {
    "uid": "801445",
    "code": "RELS5077",
    "subject": "RELS",
    "number": "5077",
    "honors": false,
    "writing": false,
    "name": "Religious Violence",
    "fullname": "Religious Violence in the Early Roman Empire: Jews, Christians, and Pagans",
    "info": "Methodological strategies for understanding discourses of violence. Ways religious traditions shaped ethnic identity/practices and views of sacrifice, martyrdom, spectacles of violence, apocalyptic ideologies of violence, state persecution, texts/terror, and holy war.",
    "prereq": {}
  },
  {
    "uid": "797129",
    "code": "RELS5080",
    "subject": "RELS",
    "number": "5080",
    "honors": false,
    "writing": false,
    "name": "New Test Proseminar",
    "fullname": "New Testament Proseminar",
    "info": "Discussion seminar. Specific aspect of New Testament, related literature. Topics specified in Class Schedule.\n\nprereq: 1082 or RELA 1082 or 3072 or equiv",
    "prereq": {
      "or": [
        "797104",
        "797186"
      ]
    }
  },
  {
    "uid": "010574",
    "code": "RELS5111",
    "subject": "RELS",
    "number": "5111",
    "honors": false,
    "writing": false,
    "name": "Histor/Rep of the Holocaust",
    "fullname": "Problems in Historiography and Representation of the Holocaust",
    "info": "Relationship of paintings, memorials, and other art forms to the question of understanding the Holocaust. Issues of sources, especially use of the Survivors of the Shoah project in U libraries.",
    "prereq": {}
  },
  {
    "uid": "790895",
    "code": "RELS5112",
    "subject": "RELS",
    "number": "5112",
    "honors": false,
    "writing": false,
    "name": "Jewish Mysticism and Kabbalah",
    "fullname": "Jewish Mysticism, Magic, and Kabbalah",
    "info": "Mystical traditions from early rabbinic traditions to Zohar (Book of Splendor) in 13th century. Literature of heavenly ascent (Hekhalot, Merkavah), Book of Creation (Sefer Yetzirah), precursors of Zohar.the Bahir. Schools of Provence, Gerona, and Zohar. Tension between legal/mystical aspects, magical theurgic techniques, evolution of doctrine of Sefirot, mystical interpretation of Scripture, erotic dimension.",
    "prereq": {}
  },
  {
    "uid": "793567",
    "code": "RELS5115",
    "subject": "RELS",
    "number": "5115",
    "honors": false,
    "writing": false,
    "name": "Midrash: Reading and Retelling",
    "fullname": "Midrash: Reading and Retelling the Hebrew Bible",
    "info": " How did the Jews of the first seven centuries of the common era read and understand the Hebrew Bible? What were the problems they faced -- interpretive, historical, theological -- in trying to apply their holy scriptures? This course explores key issues that led to the development of a new form of Judaism in late antiquity, rabbinic Judaism, and its methods of scriptural interpretation. The course?s study will focus on the forms and practices of rabbinic scriptural interpretation (midrash) as it developed in Roman Palestine and Sasanian Babylonia, focusing on key narrative and legal passages in the Five Books of Moses (Torah). A main focus of the course will be on the ways the rabbis adapted the Hebrew Bible to express their own core concerns.",
    "prereq": {}
  },
  {
    "uid": "818949",
    "code": "RELS5121",
    "subject": "RELS",
    "number": "5121",
    "honors": false,
    "writing": false,
    "name": "Gender in Early Christianity",
    "fullname": "Gender and Body in Early Christianity",
    "info": "Ancient Christians, like any other social group in the ancient world, represented themselves through images, stories, and discourses using the cultural tools available to them in their own contexts. In this course, we will explore two key texts of early Christianity (1 Corinthians and the Gospel of Mark) with special attention to how representations of the body and gender served to communicate the nature of what it meant to be Christian for these authors.  The study of ancient material offers a space to acquire the skills of critical analysis of body and gender dynamics so that we can better understand the roles that the body and gender play in shaping our self-identity, social interaction, and societal structures.",
    "prereq": {}
  },
  {
    "uid": "804687",
    "code": "RELS5204",
    "subject": "RELS",
    "number": "5204",
    "honors": false,
    "writing": false,
    "name": "The Dead Sea Scrolls",
    "fullname": "The Dead Sea Scrolls",
    "info": "Introduction to Dead Sea Scrolls and Qumran. Contents of Dead Sea Scrolls, significance for development of Bible. Background of Judaism and Christianity. Archaeological site of Qumran. The course will focus on the material in translation and academic scholarship on the literature and archaeological site. Open to graduate students across the college; knowledge of classical Hebrew will not be required. The course is open to upper level undergraduate students with permission of the instructor.",
    "prereq": {}
  },
  {
    "uid": "791321",
    "code": "RELS5251",
    "subject": "RELS",
    "number": "5251",
    "honors": false,
    "writing": false,
    "name": "Archaeology of Herodian Israel",
    "fullname": "Archaeology of Herodian Israel",
    "info": "Archaeological sites in Israel dating to era of Herod the Great (37-4BC). Palaces, religious edifices, and remains from Jewish/gentile settlements throughout the kingdom. Course readings consist of contemporary literary sources and excavation reports.",
    "prereq": {}
  },
  {
    "uid": "811517",
    "code": "RELS5252",
    "subject": "RELS",
    "number": "5252",
    "honors": false,
    "writing": false,
    "name": "Early Christian & Late Rome",
    "fullname": "Art and Archaeology of Early Christianity and the Late Roman Empire",
    "info": "Emergence of Christian visual culture in Rome. Age of Tetrarchs/Constantine. Age of Justinian. Development of liturgical environments such as Jewish synagogue/Christian church. Melding of imperial/Christian art, architecture, ritual. Constantinople, from its founding through sixth century. Church architecture. Early icon/manuscript painting.",
    "prereq": {}
  },
  {
    "uid": "818192",
    "code": "RELS5254",
    "subject": "RELS",
    "number": "5254",
    "honors": false,
    "writing": false,
    "name": "The Archaeology of Religion",
    "fullname": "Archaeology of Ritual and Religion",
    "info": "The course discusses evidence for the origins of religion and its diverse roles in human societies over millennia. It focuses on how artifacts and architecture are essential to religious experience. It asks: What constitutes religion for different cultures? Why is religion at the heart of politics, social life, and cultural imagination? ",
    "prereq": {}
  },
  {
    "uid": "803648",
    "code": "RELS5255",
    "subject": "RELS",
    "number": "5255",
    "honors": false,
    "writing": false,
    "name": "The Archaeology of Religion",
    "fullname": "Archaeology of Religion",
    "info": "Evidence for origins of religion, its diverse roles in human societies over millennia. What constitutes religion, why it is constantly present in human history. How archaeologists reconstruct beliefs/practices of past peoples.",
    "prereq": {}
  },
  {
    "uid": "809280",
    "code": "RELS5325",
    "subject": "RELS",
    "number": "5325",
    "honors": false,
    "writing": false,
    "name": "The Art of the Aztec Empire",
    "fullname": "The Art of the Aztec Empire",
    "info": "Art/architecture of Nahuatl-speaking Aztecs of Central Mexico, from first appearance in archaeological record until Spanish invasion in 1521. Major scholarly problems, theoretical/methodological approaches. Analysis of scholarly writing.",
    "prereq": {}
  },
  {
    "uid": "810043",
    "code": "RELS5326",
    "subject": "RELS",
    "number": "5326",
    "honors": false,
    "writing": false,
    "name": "The Inka and Their Ancestors",
    "fullname": "Art of the Inka and their Ancestors",
    "info": "Art/architecture of people of Andes from first\nappearance in archaeological record until Spanish invasion in 16th century. Problems, theoretical/methodological approaches. Analysis of scholarly writing, focusing on evidence.\n\nprereq: Jr. or Sr. or grad student",
    "prereq": {}
  },
  {
    "uid": "799924",
    "code": "RELS5371",
    "subject": "RELS",
    "number": "5371",
    "honors": false,
    "writing": false,
    "name": "Buddhism",
    "fullname": "Buddhism",
    "info": "Historical account of Buddhist religion in terms of its rise, development, various schools, and common philosophical concepts. Indian Buddhism compared with Hinduism. Buddhism's demise/revival on Indian subcontinent.",
    "prereq": {}
  },
  {
    "uid": "799922",
    "code": "RELS5411",
    "subject": "RELS",
    "number": "5411",
    "honors": false,
    "writing": false,
    "name": "Intro Indian Phil",
    "fullname": "Introduction to Indian Philosophy",
    "info": "Major concepts. Principal schools of Indian philosophy. Traditional/contemporary views.",
    "prereq": {}
  },
  {
    "uid": "799925",
    "code": "RELS5414",
    "subject": "RELS",
    "number": "5414",
    "honors": false,
    "writing": false,
    "name": "Comp Religs So Asia",
    "fullname": "Comparative Religions of South Asia",
    "info": "Compares/contrasts basic philosophical concepts, literatures, ideologies, and ritualistic practices of Hinduism, Buddhism, and Jainism with those of Islam and Sikhism.",
    "prereq": {}
  },
  {
    "uid": "797151",
    "code": "RELS5503",
    "subject": "RELS",
    "number": "5503",
    "honors": false,
    "writing": false,
    "name": "Hist/Israelite Rel",
    "fullname": "History and Development of Israelite Religion I",
    "info": "Survey of the evolution of Israelite religion. Cultic practices, law and religion, prophecy, religion and historiography. Relationship to surrounding religious systems.",
    "prereq": {}
  },
  {
    "uid": "797139",
    "code": "RELS5504",
    "subject": "RELS",
    "number": "5504",
    "honors": false,
    "writing": false,
    "name": "Hist/Israel Rel II",
    "fullname": "Development of Israelite Religion II",
    "info": "Ancient Judaism from the Persian restoration (520 B.C.E.) to Roman times (2nd century C.E.). Religious, cultural, and historical developments are examined to understand Jewish life, work, and worship under a succession of foreign empires: Persian, Greek, Roman.",
    "prereq": {}
  },
  {
    "uid": "790576",
    "code": "RELS5513W",
    "subject": "RELS",
    "number": "5513",
    "honors": false,
    "writing": true,
    "name": "Scripture and Interpretation",
    "fullname": "Scripture and Interpretation in Israelite Religion and Judaism",
    "info": "Idea of divine revelation. Impact on religion/literature. How history of Bible's creation, transmission, interpretation helps us think critically about role of idea of revelation in history of religious traditions.\n\nprereq: At least one upper level course (3xxx or higher) in academic biblical or religious studies",
    "prereq": {}
  },
  {
    "uid": "798787",
    "code": "RELS5535",
    "subject": "RELS",
    "number": "5535",
    "honors": false,
    "writing": false,
    "name": "Death and Afterlife",
    "fullname": "Death and the Afterlife in the Ancient World",
    "info": "Beliefs, attitudes, and behaviors related to death and afterlife found in cultures of ancient Mediterranean and Near East. Literature, funerary art/epitaphs. Archaeological evidence for burial practices and care of dead.",
    "prereq": {}
  },
  {
    "uid": "808537",
    "code": "RELS5612",
    "subject": "RELS",
    "number": "5612",
    "honors": false,
    "writing": false,
    "name": "Baroque Rome: Art and Politics",
    "fullname": "Baroque Rome: Art and Politics in the Papal Capital",
    "info": "This course explores the center of Baroque culture, Rome, as a city of spectacle and pageantry. The urban development of the city, as well as major works in painting, sculpture, and architecture, are considered within their political and religious context, with special emphasis on the ecclesiastical and private patrons who transformed the Eternal City into one of the world's great capitals. ",
    "prereq": {}
  },
  {
    "uid": "803681",
    "code": "RELS5614",
    "subject": "RELS",
    "number": "5614",
    "honors": false,
    "writing": false,
    "name": "The Medieval Church",
    "fullname": "Medieval Church",
    "info": "Introduction to history of western church in Middle Ages. Emphasizes church teachings and institutional structures, beliefs/practices of lay people, medieval\nChristian encounter with non-Christian world.",
    "prereq": {}
  },
  {
    "uid": "803018",
    "code": "RELS5621W",
    "subject": "RELS",
    "number": "5621",
    "honors": false,
    "writing": true,
    "name": "The Christian Right and Left",
    "fullname": "The Christian Right and Left in America: Protestant Liberals, Evangelicals, and Fundamentalists",
    "info": "Religious, historical, social, and scientific thought/practice across three main U.S. Protestant groups since 1820. Historical processes that brought about diverse understandings of Christianity, theologies, and worship. Theological left/right views of views of society, history, and science that influence public debates.",
    "prereq": {}
  },
  {
    "uid": "799923",
    "code": "RELS5671",
    "subject": "RELS",
    "number": "5671",
    "honors": false,
    "writing": false,
    "name": "Hinduism",
    "fullname": "Hinduism",
    "info": "Development of Hinduism focusing on sectarian trends, modern religious practices, myths/rituals, pilgrimage patterns/ religious festivals. Interrelationship between Indian social structure/Hinduism.",
    "prereq": {}
  },
  {
    "uid": "813403",
    "code": "RELS5707W",
    "subject": "RELS",
    "number": "5707",
    "honors": false,
    "writing": true,
    "name": "Anthropology: The Middle East",
    "fullname": "Anthropology of the Middle East",
    "info": "Anthropological field methods of analyzing/interpreting Middle Eastern cultures/societies.",
    "prereq": {}
  },
  {
    "uid": "815108",
    "code": "RELS5721",
    "subject": "RELS",
    "number": "5721",
    "honors": false,
    "writing": false,
    "name": "North Africa since 1500",
    "fullname": "North Africa since 1500: Islam, Colonialism, and Independence",
    "info": "History of Maghrib (Morocco, Algeria, Tunisia, Libya, disputed territories of Western Sahara) from time of Ottoman expansion/Sharifian dynasties (Sa'dian/'Alawid) in 16th/17th Centuries to end of 20th century. Focus on encounter of Islamic cultures/societies of Maghrib with Africa/Europe.",
    "prereq": {}
  },
  {
    "uid": "816883",
    "code": "RELS5777",
    "subject": "RELS",
    "number": "5777",
    "honors": false,
    "writing": false,
    "name": "Indian Empires after 1200",
    "fullname": "The Diversity of Traditions: Indian Empires after 1200",
    "info": "This class considers the development of Indian and Pakistani art and architecture from the introduction of Islam as a major political power at the end of the 12th century to the colonial empires of the 18th century.  We will study how South Asia’s diverse ethnic and religious communities interacted, observing how visual and material cultures reflect differences, adaptations, and shared aesthetic practices within this diversity of traditions. Students in this class will have mastered a body of knowledge about Indian art and probed multiple modes of inquiry. We will explore how Muslim rulers brought new traditions yet maintained many older ones making, for example, the first mosque in India that combines Muslim and Indic visual idioms. We will study the developments leading to magnificent structures, such as the Taj Mahal, asking why such a structure could be built when Islam discourages monumental mausolea.  In what ways the schools of painting that are the products of both Muslim and Hindu rulers different and similar? The course will also consider artistic production in the important Hindu kingdoms that ruled India concurrently with the great Muslim powers. In the 18th century, colonialist forces enter the subcontinent, resulting in significant innovative artistic trends. Among questions we will ask is how did these kingdoms influence one another? Throughout we will probe which forms and ideas seem to be inherently Indian, asking which ones transcend dynastic, geographic and religious differences and which forms and ideas are consistent throughout these periods of political and ideological change.  To do all this we must constantly consider how South Asia's diverse ethnic and religious communities interact.",
    "prereq": {}
  },
  {
    "uid": "818101",
    "code": "RELS5781",
    "subject": "RELS",
    "number": "5781",
    "honors": false,
    "writing": false,
    "name": "Age of Empire",
    "fullname": "Age of Empire: The Mughals, Safavids, and Ottomans",
    "info": "Artistic developments under the three most powerful Islamic empires of the 16th through 19th centuries: Ottomans of Turkey; Safavids of Iran; Mughals of India. Roles of religion and state will be considered to understand their artistic production.",
    "prereq": {}
  },
  {
    "uid": "009826",
    "code": "RELS5993",
    "subject": "RELS",
    "number": "5993",
    "honors": false,
    "writing": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "TBDprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "817657",
    "code": "RELS8070",
    "subject": "RELS",
    "number": "8070",
    "honors": false,
    "writing": false,
    "name": "Readings in Religious Texts",
    "fullname": "Readings in Religious Texts",
    "info": "Close reading of selected literary or epigraphical texts of importance for the history of ancient Mediterranean religions, along with critical discussion of trends in recent scholarship. The texts may be read in the original languages (such as Greek, Latin, Hebrew, etc.) but may also be accessed in translation where appropriate.",
    "prereq": {}
  },
  {
    "uid": "827188",
    "code": "RELS8080",
    "subject": "RELS",
    "number": "8080",
    "honors": false,
    "writing": false,
    "name": "Topics in Religious Studies",
    "fullname": "Topics in Religious Studies",
    "info": "Topics in Religious Studies",
    "prereq": {}
  },
  {
    "uid": "792972",
    "code": "RELS8190",
    "subject": "RELS",
    "number": "8190",
    "honors": false,
    "writing": false,
    "name": "Seminar in Religions Antiquity",
    "fullname": "Comparative Seminar in Religions in Antiquity",
    "info": "Topics vary. Major cultural movement as it developed over several centuries. Draws on evidence in literature, archival records, inscriptions, documentary papyri, and archaeological remains. Artistic media such as wall painting, architectural ornament, funerary sculpture, or manuscript illumination.\n\nprereq: Grad student in relevant field",
    "prereq": {}
  }
]