[
  {
    "uid": "811206",
    "code": "RSC5058",
    "subject": "RSC",
    "number": "5058",
    "honors": false,
    "writing": false,
    "name": "Anatomy for Rehab Science",
    "fullname": "Anatomy for Rehabilitation Science",
    "info": "Study of gross human anatomy through lecture/laboratory experiences that include cadaver dissection of extremities, head, neck, back, abdomen, thoracic, pelvic regions with correlation to clinical conditions.\n\nprereq: Student enrolled in Rehabilitation Science Program, instr consent, dept consent",
    "prereq": {}
  },
  {
    "uid": "818026",
    "code": "RSC5060",
    "subject": "RSC",
    "number": "5060",
    "honors": false,
    "writing": false,
    "name": "Lower Extremity Anatomy",
    "fullname": "Lower Extremity Anatomy Intensive",
    "info": "Intensive and focused study of lower extremity gross human anatomy for graduate students. The content is presented through lecture and laboratory experiences that include cadaver dissection of human lower extremities with correlation to clinical conditions.",
    "prereq": {}
  },
  {
    "uid": "818025",
    "code": "RSC5065",
    "subject": "RSC",
    "number": "5065",
    "honors": false,
    "writing": false,
    "name": "Upper Extremity Anatomy",
    "fullname": "Upper Extremity Anatomy Intensive",
    "info": "Intensive and focused study of upper extremity gross human anatomy for graduate students.  The content is presented through lecture and laboratory experiences that include cadaver dissection of human upper extremities with correlation to clinical conditions.",
    "prereq": {}
  },
  {
    "uid": "806737",
    "code": "RSC5100",
    "subject": "RSC",
    "number": "5100",
    "honors": false,
    "writing": false,
    "name": "Hot Topics-Biology of Aging",
    "fullname": "Hot Topics in the Biology of Aging",
    "info": "Biological research in aging. Student-/faculty-led discussions on select research topics that are highly relevant to the field of biogerontology research, along with seminars on scientific integrity. Students lead discussions focused on their area of research expertise, using review/research articles and case studies of scientific misconduct. Tour of laboratory/discussion of literature published by lab dealing with aging and/or proteomics.\n\nprereq: instr consent dept consent",
    "prereq": {}
  },
  {
    "uid": "808769",
    "code": "RSC5101",
    "subject": "RSC",
    "number": "5101",
    "honors": false,
    "writing": false,
    "name": "Math Tools for Research Applic",
    "fullname": "Mathematical Tools for Research Applications in Health, Rehab, and Human Movement Sciences",
    "info": "Quantitative research approaches in health, rehabilitation, human movement sciences. Application examples/practice problems focus of the course. Basic algebra/geometry, solving equations for unknowns, logarithmic transforms, derivatives/integrals, matrix methods, use of macros in research applications.\n\nprereq: Basic algebra, trigonometry, and geometry. Pre-calculus or calculus is helpful but not required.",
    "prereq": {}
  },
  {
    "uid": "816070",
    "code": "RSC5102",
    "subject": "RSC",
    "number": "5102",
    "honors": false,
    "writing": false,
    "name": "Hot Topics in Aging",
    "fullname": "Hot Topics in the Biology of Aging",
    "info": "This course is intended to provide a platform of understanding about the major issues surrounding biological research in aging. This course will include a combination of student- and faculty-led discussions on select research topics that are highly relevant to the field of biogerontology research, along with seminars on scientific integrity. Student participants will lead discussions focused on their area of research expertise, utilizing a combination of review articles and research articles and case studies of scientific misconduct. Faculty will provide students with a tour of their laboratory, followed by discussion of literature published by their laboratory dealing with aging and/or proteomics. This course is directed to graduate students and post-doctoral fellows currently engaged in conducting research in the area of biological aging.",
    "prereq": {}
  },
  {
    "uid": "816071",
    "code": "RSC5103",
    "subject": "RSC",
    "number": "5103",
    "honors": false,
    "writing": false,
    "name": "Seminal Milestones in Aging",
    "fullname": "Seminal Milestones in the Biology of Aging",
    "info": "This course is intended to provide a platform of understanding about the major issues surrounding biological research in aging. The course will utilize original literature, including both seminal, historical background papers and the most recent progress in the field of biogerontology research as a starting point for in-depth discussions. This course is directed to graduate students and post-doctoral fellows currently engaged in conducting research in the area of biological aging.",
    "prereq": {}
  },
  {
    "uid": "814051",
    "code": "RSC5106",
    "subject": "RSC",
    "number": "5106",
    "honors": false,
    "writing": false,
    "name": "Intro to Rehab Science",
    "fullname": "Introduction to Rehabilitation Science",
    "info": "This is one of a series of seminar courses that prepares students to think critically in reading and discussing the literature in rehabilitation science and to speak and write persuasively on scientific topics. This semester, the seminar will focus on the past, present, and future of rehabilitation science. This course will include lecture presentations from rehabilitation science faculty for the first 50 minutes of the weekly class time, as well as discussion/interaction sessions planned jointly by assigned students and faculty for the second 50 minute session each week.",
    "prereq": {}
  },
  {
    "uid": "010785",
    "code": "RSC5135",
    "subject": "RSC",
    "number": "5135",
    "honors": false,
    "writing": false,
    "name": "Advanced Biomechanics I",
    "fullname": "Advanced Biomechanics I: Kinematics",
    "info": "How to describe/measure movement. Basic/applied biomechanics, pathokinesiology, and rehabilitation literature. Lecture, lab, seminar discussion. Meets with RSC 8135.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "808770",
    "code": "RSC5200",
    "subject": "RSC",
    "number": "5200",
    "honors": false,
    "writing": false,
    "name": "Intro to Neuromodulation",
    "fullname": "Introduction to Neuromodulation",
    "info": "This course will provide training in the theory, biophysics and evidence-based application of non-invasive magnetic and electric brain stimulation in humans. Course content will be delivered in three modules: (1) safety and administration of non-invasive brain stimulation, (2) neuromodulation methods, and (3) advanced assessment and modeling techniques.  All registered students must take module #1. Testing methods will include various methods to assess intracortical, transcallosal and interhemispheric excitability. Neuromodulation methods presented will include non-invasive and invasive forms of brain stimulation. Hands-on instruction and laboratory applications will be provided for cortical excitability testing using transcranial magnetic stimulation (TMS) as well as for other non-invasive forms of brain stimulation. Those enrolled will both administer and receive non-invasive brain stimulation and will be asked to sign a consent form. Specific safety exclusion criteria for receiving non-invasive brain stimulation exist and enrollees who have questions should contact the Division of Rehabilitation Science.",
    "prereq": {}
  },
  {
    "uid": "810663",
    "code": "RSC5206",
    "subject": "RSC",
    "number": "5206",
    "honors": false,
    "writing": false,
    "name": "Academic Ethos",
    "fullname": "Academic Ethos",
    "info": "Explicit/implicit culture unique to academia. Early understanding within/beyond rehabilitation science. Role of higher education in society, academic freedom, tenure, corporatization of education, accreditation, globalization of education, regulatory monitoring of research, faculty scholarship/governance.",
    "prereq": {}
  },
  {
    "uid": "807497",
    "code": "RSC5231",
    "subject": "RSC",
    "number": "5231",
    "honors": false,
    "writing": false,
    "name": "Clinical Biomechanics",
    "fullname": "Clinical Biomechanics",
    "info": "Biomechanics. Internal/external forces/structures responsible for normal/abnormal human movement. Joint and tissue mechanics, muscle function, task analysis, and gait mechanics. Lecture and lab practice.\n\nprereq: concurrent registration is required (or allowed) in PT 6231, general physics, [intro or short] calculus, anatomy;\nintensive anatomy course in human cadaver dissection recommended",
    "prereq": {
      "and": [
        "792077"
      ]
    }
  },
  {
    "uid": "804576",
    "code": "RSC5235",
    "subject": "RSC",
    "number": "5235",
    "honors": false,
    "writing": false,
    "name": "Advanced Biomechanics II: Kin",
    "fullname": "Advanced Biomechanics II: Kinetics",
    "info": "Forces that create human motion and are produced within body as a result. Measuring human motion. Clinical movement assessment, Exercise, sport, and activities of daily living. Two-dimensional rigid body dynamics models, forward/inverse dynamics solutions, hypotheses to describe whole body/joint kinetics. Lectures, lab, discussion.\n\nprereq: 5135 or equiv or instr consent",
    "prereq": {
      "or": [
        "010785"
      ]
    }
  },
  {
    "uid": "810575",
    "code": "RSC5281",
    "subject": "RSC",
    "number": "5281",
    "honors": false,
    "writing": false,
    "name": "Physiology for Physical Rehab",
    "fullname": "Physiology for Physical Rehabilitation",
    "info": "This course provides an in-depth presentation of fundamental concepts in tissue and organ system physiology as they relate to general health, aging, and physical exercise. Emphasis is on the following systems: muscle, bone & connective tissue, endocrine, immune, renal, gi, and hematology. The influence of aging on these systems will be addressed as well. \nprereq: Rehabilitation Science grad student",
    "prereq": {}
  },
  {
    "uid": "010793",
    "code": "RSC5294",
    "subject": "RSC",
    "number": "5294",
    "honors": false,
    "writing": false,
    "name": "Ind Study in Rehab Sci",
    "fullname": "Independent Study in Rehabilitation Science",
    "info": "Independent exploration into topics related to rehabilitation science.\n\nprereq: Rehabilitation science student or program approval",
    "prereq": {}
  },
  {
    "uid": "825280",
    "code": "RSC5300",
    "subject": "RSC",
    "number": "5300",
    "honors": false,
    "writing": false,
    "name": "ANS Function",
    "fullname": "Autonomic Nervous System (ANS) Function",
    "info": "This course is designed to advance the student’s knowledge on how the autonomic nervous system (ANS) functions to maintain homeostasis. The student will have a strong understanding of the components of the ANS and how the ANS contributes to blood pressure regulation and control of circulation. Students will read book chapters, journal reviews, and original articles and engage in weekly discussions on topics related to the listed course objectives. In addition, students will have the opportunity to present on specific topics that will be related to their current work.",
    "prereq": {}
  },
  {
    "uid": "814052",
    "code": "RSC5306",
    "subject": "RSC",
    "number": "5306",
    "honors": false,
    "writing": false,
    "name": "Sci & Profess Presentation",
    "fullname": "Scientific and Professional Presentation",
    "info": "This course will focus on the process and practice of oral presentation of scientific inquiry and discoveries. These skills are essential for scientists in all disciplines, yet often guidelines for optimal scientific presentation are not taught or practiced in an educational setting. Specific areas to be covered in this course include presentation intent, audience analysis, timing, content, keys to effective communication, vocal behavior, and important things to avoid. Context will include conference-style platform or podium presentations, poster presentations, and seminar presentation. The course will involve opportunities to prepare and practice presentation skills and receive constructive feedback in a safe, supportive environment. It is appropriate for students from all disciplines and levels of PhD study.",
    "prereq": {}
  },
  {
    "uid": "815210",
    "code": "RSC5310",
    "subject": "RSC",
    "number": "5310",
    "honors": false,
    "writing": false,
    "name": "Cardio Physiology and Rehab",
    "fullname": "Cardiopulmonary Physiology and Rehabilitation",
    "info": "This course conveys foundational information regarding human basic physiology cardiovascular and pulmonary physiology. In addition, fundamental principles of cardiac and pulmonary systems as they relate to physical therapy will be known in the clinic to the physical therapist as Cardiac and Pulmonary Rehabilitation will be addressed. The focus of this course is on normal and abnormal responses to exercise and the pathophysiology, assessment, evaluation, and rehabilitation of patients with cardiopulmonary disorders.",
    "prereq": {}
  },
  {
    "uid": "818819",
    "code": "RSC5402",
    "subject": "RSC",
    "number": "5402",
    "honors": false,
    "writing": false,
    "name": "Shoulder Sports Rehab Science",
    "fullname": "The Shoulder in Sports Rehabilitation Science",
    "info": "A three-credit online course for students who are interested in investigating the biomechanical and epidemiological aspects of the shoulder in athletics. The course will explore the unique demands placed on the shoulder in sports that involve throwing, swimming, swinging, and bodily impacts. The course begins with an investigation into sport-specific biomechanics, pathomechanics, and epidemiology and progresses to applied problem solving for rehabilitation and research scenarios.\n\nprereq: (1) an undergraduate or graduate human anatomy course and (2) an undergraduate or graduate biomechanics course. It is recommended, but not required, you have an anatomy course including a detailed shoulder anatomy section and a biomechanics course including a detailed shoulder biomechanics section. Consent from course instructor or Rehabilitation Science graduate program is required.\n",
    "prereq": {}
  },
  {
    "uid": "825425",
    "code": "RSC5404",
    "subject": "RSC",
    "number": "5404",
    "honors": false,
    "writing": false,
    "name": "Appl Shoulder Anat and Biomech",
    "fullname": "Applied Shoulder Anatomy and Biomechanics",
    "info": "The shoulder is capable of more range of motion than any other joint in the human body. It is involved in virtually any motion that places the hand in space. Subsequently, the shoulder is prone to injury. There are many mechanisms of shoulder injury, and many are related to the anatomy of the shoulder joint and the anatomical relationship to movement. \n\nThis course will serve as an overview of the anatomy and biomechanics of the shoulder joint complex. Students taking this course will have the opportunity to explore the intricate anatomy of the shoulder complex. In doing so, students will create their own anatomical-reference-guide that they will use beyond this class. We will build upon this anatomical knowledge and apply the purpose of these structures in the context of functional movement. Lastly, we will examine how these relationships may be altered during several common surgical techniques. \n",
    "prereq": {}
  },
  {
    "uid": "015937",
    "code": "RSC5814",
    "subject": "RSC",
    "number": "5814",
    "honors": false,
    "writing": false,
    "name": "Age, Ex and Rehab",
    "fullname": "Age, Exercise, and Rehabilitation",
    "info": "Overview of normal physiological responses to exercise in the elderly.  Comparison of exercise-induced responses of physiological systems throughout aging process. Focuses on importance of exercise from rehabilitation perspective. Offered Fall semesters of even-numbered years.prereq: Rehabilitation science student or program permission",
    "prereq": {}
  },
  {
    "uid": "010272",
    "code": "RSC5841",
    "subject": "RSC",
    "number": "5841",
    "honors": false,
    "writing": false,
    "name": "Applied Data Acqstn & Process",
    "fullname": "Applied Data Acquisition and Processing",
    "info": "This course will introduce students to collecting and processing biomedical time series data. Students will gain experience using data acquisition hardware common in many laboratories, as well as related software for acquisition of the data and digital signal processing. Data sources will include electromyography (EMG), wearable sensors, motion capture, and data from other systems based on the background and interests of students in the class. The overall goal of this course is to provide students with the necessary, fundamental skills to run a successful experiment, troubleshoot errors, and produce high quality data sets. prereq: prefer students to have completed general physics, introductory of short calculus",
    "prereq": {}
  },
  {
    "uid": "820483",
    "code": "RSC5842",
    "subject": "RSC",
    "number": "5842",
    "honors": false,
    "writing": false,
    "name": "Teaching & Learning in RSC",
    "fullname": "Teaching and Learning in Rehabilitation Science",
    "info": "Introduction to the roles of an academic educator and the basic principles of adult education, active learning, course design, and teaching in academic environments.",
    "prereq": {}
  },
  {
    "uid": "808848",
    "code": "RSC5901",
    "subject": "RSC",
    "number": "5901",
    "honors": false,
    "writing": false,
    "name": "Scholarly Inquiry in Hlth Sci",
    "fullname": "Scholarly Inquiry in Health Sciences",
    "info": "How research evidence is developed, disseminated, utilized in health sciences. Qualitative/quantitative scholarly project proposal. Critique studies/peer proposals. Explore conduct of research.prereq: Three credits of undergraduate statistics. instr consent, dept consent.",
    "prereq": {}
  },
  {
    "uid": "816072",
    "code": "RSC8021",
    "subject": "RSC",
    "number": "8021",
    "honors": false,
    "writing": false,
    "name": "Applic. of Proteomics to Aging",
    "fullname": "Application of Proteomics to Aging",
    "info": "This course is intended to provide a platform of understanding about the use of proteomic technology in aging research. This course will include a combination of faculty- and student-led discussions on select topics that are highly relevant to the field of mass spectrometry and proteomic research. This course also includes an introduction to the NIH/NRSA fellowship applications. Student participants will lead discussions focused on research articles highlighting current proteomic techniques. This course is directed to graduate students and post-doctoral fellows currently engaged in conducting research in the area of biological aging.",
    "prereq": {}
  },
  {
    "uid": "810576",
    "code": "RSC8022",
    "subject": "RSC",
    "number": "8022",
    "honors": false,
    "writing": false,
    "name": "Career in Aging Research",
    "fullname": "Fostering a Career in Aging Research",
    "info": "Platform for preparing pre-doctoral students/post-doctoral fellows for next step in academic career. Combination of student/faculty led discussions.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "791076",
    "code": "RSC8100",
    "subject": "RSC",
    "number": "8100",
    "honors": false,
    "writing": false,
    "name": "Rehabilitation Science Seminar",
    "fullname": "Rehabilitation Science Seminar",
    "info": "Critically reading/discussing rehabilitation science literature. Identifying important researchable questions, methods to answer them. Speaking/writing persuasively on scientific topics.",
    "prereq": {}
  },
  {
    "uid": "814053",
    "code": "RSC8106",
    "subject": "RSC",
    "number": "8106",
    "honors": false,
    "writing": false,
    "name": "Critical Analysis of Sci Lit",
    "fullname": "Critical Analysis of Scientific Literature",
    "info": "This course will focus on the process of critical review, appraisal, and synthesis of scientific literature. Overview of organizing and writing literature reviews for a traditional dissertation, systematic reviews, and peer review for scientific manuscripts will be included. The course will involve substantive review of the literature and writing in your anticipated area of dissertation work.",
    "prereq": {}
  },
  {
    "uid": "009482",
    "code": "RSC8130",
    "subject": "RSC",
    "number": "8130",
    "honors": false,
    "writing": false,
    "name": "Current Lit",
    "fullname": "Current Literature Seminar",
    "info": "Critical review of literature to evaluate efficacy of selected physical therapy interventions.\n\nprereq: Grad student in PT or rehabilitation science major or instr consent",
    "prereq": {}
  },
  {
    "uid": "010792",
    "code": "RSC8135",
    "subject": "RSC",
    "number": "8135",
    "honors": false,
    "writing": false,
    "name": "Human Kinematics",
    "fullname": "Human Kinematics",
    "info": "How to describe/measure movement. Basic/applied biomechanics, pathokinesiology, and rehabilitation literature. Lecture, lab, seminar discussion. Meets in conjunction with RSC 5135.\n\nprereq: [Rehabilitation science student or program permission], instr consent",
    "prereq": {}
  },
  {
    "uid": "010799",
    "code": "RSC8170",
    "subject": "RSC",
    "number": "8170",
    "honors": false,
    "writing": false,
    "name": "Special Topics in Rehab Sci",
    "fullname": "Special Topics in Rehabilitation Science",
    "info": "Topics vary by semester. Papers required.",
    "prereq": {}
  },
  {
    "uid": "010800",
    "code": "RSC8185",
    "subject": "RSC",
    "number": "8185",
    "honors": false,
    "writing": false,
    "name": "Problems in Rehab Sci",
    "fullname": "Problems in Rehabilitation Science",
    "info": "Research practicum on selected topic. Use of systematic literature search. Critical analysis of scientific literature. Specific measurement systems. Data collection/reduction methods of on-going or new research projects. Preparing/defending research reports.",
    "prereq": {}
  },
  {
    "uid": "011157",
    "code": "RSC8188",
    "subject": "RSC",
    "number": "8188",
    "honors": false,
    "writing": false,
    "name": "Teaching Practicum",
    "fullname": "Teaching Practicum",
    "info": "Supervised experience in teaching/evaluation. Effective use of instructional materials in lecture/lab courses. Students create learning objectives for teaching unit(s), conduct a review of current literature on topic, prepare/deliver presentations, compose test questions. Offered by individual arrangement with faculty.\n\nprereq: [Rehabilitation science student or program permission], instr consent",
    "prereq": {}
  },
  {
    "uid": "010812",
    "code": "RSC8192",
    "subject": "RSC",
    "number": "8192",
    "honors": false,
    "writing": false,
    "name": "Essentials in Rehab Research",
    "fullname": "Essentials in Rehab Research",
    "info": "The goals of this course are to develop abilities to critically evaluate peer-reviewed literature. It will also enable students to identify and apply appropriate statistical procedures, and interpret the meaning of statistical analyses. Finally, it will give students an opportunity to present the aims, methods, intended analyses, and preliminary results of their own research. Additionally, students will meet individually for 2 hours every month with the lecturer to work on the method section of a paper related to their PhD project. This paper will be critically reviewed and graded as end-evaluation for this class.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "811375",
    "code": "RSC8206",
    "subject": "RSC",
    "number": "8206",
    "honors": false,
    "writing": false,
    "name": "Grant Writing",
    "fullname": "Grant Writing",
    "info": "Process of applying for individual National Institutes of Health (NIH) pre-doctoral research training fellowship. Overview of NIH Program Announcement PA-11-111/NIH SF424 individual fellowship application guide required for application will be included. Substantive writing of components of NIH fellowship.",
    "prereq": {}
  },
  {
    "uid": "805594",
    "code": "RSC8235",
    "subject": "RSC",
    "number": "8235",
    "honors": false,
    "writing": false,
    "name": "Human Kinetics",
    "fullname": "Human Kinetics",
    "info": "Forces that create human motion or are produced within body as a result of motion. Measuring kinetics of motion. Clinical movement assessment. Measuring/analyzing exercise, sport, and activities for transfer of forces within body. Two-dimensional rigid body dynamics. Forward/inverse dynamics. Hypotheses for whole body/joint kinetics. Lectures, lab experiments, discussion. Meets with RSC 5235.\n\nprereq: [5135 or equiv] or instr consent",
    "prereq": {
      "or": [
        "010785"
      ]
    }
  },
  {
    "uid": "789911",
    "code": "RSC8282",
    "subject": "RSC",
    "number": "8282",
    "honors": false,
    "writing": false,
    "name": "Problems in Human Movement",
    "fullname": "Problems in Human Movement",
    "info": "Fundamental principles of neurophysiology, neurology, motor control, and motor learning as a basis for therapeutic intervention in motor dysfunction.prereq: [Rehabilitation science student or program permission], instr consent",
    "prereq": {}
  },
  {
    "uid": "812956",
    "code": "RSC8306",
    "subject": "RSC",
    "number": "8306",
    "honors": false,
    "writing": false,
    "name": "Peer Review and Publication",
    "fullname": "Peer Review and Publication",
    "info": "This course will focus on the process of publication in the scientific literature, with emphasis on publication of original research. Overview of organizing and writing for publication, and the peer review process for scientific manuscripts will be included. The course will involve substantive writing practice in your anticipated area of scientific inquiry.",
    "prereq": {}
  },
  {
    "uid": "825127",
    "code": "RSC8332",
    "subject": "RSC",
    "number": "8332",
    "honors": false,
    "writing": false,
    "name": "Quantitative Research",
    "fullname": "Quantitative Research in Rehab Science",
    "info": "This course guides students in learning how quantitative evidence is developed, disseminated, and used. Students become critical consumers of research and evidence-based practitioners by learning to analyze and critique quantitative studies and by developing and implementing their own research questions, specifying rigorous methodologies, applying appropriate statistics, and knowledgeably interpreting results. This course is the second in a three semester sequence that covers general principles of research, quantitative, and qualitative methods. It includes the University’s online training to cover topics associated with developing research questions, specifying rigorous methodologies, applying appropriate statistics, and knowledgeably interpreting results.",
    "prereq": {}
  },
  {
    "uid": "788271",
    "code": "RSC8333",
    "subject": "RSC",
    "number": "8333",
    "honors": false,
    "writing": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)\n\nprereq: Master's student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "825278",
    "code": "RSC8431",
    "subject": "RSC",
    "number": "8431",
    "honors": false,
    "writing": false,
    "name": "Qualitative Research in RSC",
    "fullname": "Qualitative Research in Rehabilitation Science",
    "info": "Learners will explore the epistemological, ethical, and methodological approaches and procedures associated with qualitative inquiry. This knowledge will be applied when evaluating evidence, designing a proposal for a qualitative study in clinical therapies, specifically occupational therapy, and conducting and analyzing a small study.",
    "prereq": {}
  },
  {
    "uid": "788407",
    "code": "RSC8444",
    "subject": "RSC",
    "number": "8444",
    "honors": false,
    "writing": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)\n\nprereq: Doctoral student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "788520",
    "code": "RSC8666",
    "subject": "RSC",
    "number": "8666",
    "honors": false,
    "writing": false,
    "name": "Doct Pre-Thesis Cr",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "TBD\n\nprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": {}
  },
  {
    "uid": "788654",
    "code": "RSC8777",
    "subject": "RSC",
    "number": "8777",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": {}
  },
  {
    "uid": "787929",
    "code": "RSC8888",
    "subject": "RSC",
    "number": "8888",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "Thesis credit: doctoral.\n\nprereq: Max 18 cr per semester or summer, 24 cr required; RSC doctoral student who has successfully passed the prelim written exam, dept consent",
    "prereq": {}
  }
]