[
  {
    "uid": "825917",
    "code": "SCLY1201",
    "subject": "SCLY",
    "number": "1201",
    "honors": false,
    "writing": false,
    "name": "Survival Italian Language",
    "fullname": "Survival Italian Language",
    "info": "The course is designed for college students who are approaching the study of the Italian language for the first time. Lessons are held exclusively in Italian and take into consideration the need to combine the study of lexis and grammar with the development of communication skills and cultural awareness. The instructor encourages students to put the language structures and vocabulary studied in class into practice in real-life situations, thus accelerating the learning process and bringing students into contact with local society so that they may fully appreciate the way of life and cultural differences. This knowledge is an integral part of linguistic competence. ",
    "prereq": {}
  },
  {
    "uid": "825169",
    "code": "SCLY3201",
    "subject": "SCLY",
    "number": "3201",
    "honors": false,
    "writing": false,
    "name": "Sicily Design Lab",
    "fullname": "Sicily Design Lab",
    "info": "Physical making remains central to how we understand and design the world around us, even as we become a more digitally connected, global world. These project-based, making-intensive courses celebrate the act and craft of individual hand-making in community with other makers. The specific theme and project change each year and are determined by the expert instructors in consultation with MADE Academy leadership. They are taught by international designers at the MADE Academy, at the Academy of Fine Arts in Syracuse, Italy.\n \nStudents in these workshops will learn in the tradition of the expert and apprentice, working side by side with peers and expert art and design instructors from around the world. Each workshop will focus on a single team project; the prompt is issued at the start of the week, students work through the design and making throughout the week, and the project is reviewed five days later. At mid-week, students have a brief, independent assignment that extends the specific ideas of the workshop in the context of the learning abroad experience and the concurrent summer MADE Academy symposium content.",
    "prereq": {}
  },
  {
    "uid": "825885",
    "code": "SCLY3202",
    "subject": "SCLY",
    "number": "3202",
    "honors": false,
    "writing": false,
    "name": "Migration, Human Rights, Media",
    "fullname": "Migration, Human Rights & the Media",
    "info": "This course is offered to undergraduate students interested in furthering their knowledge on migration, asylum, and human rights in Europe and in the Mediterranean. The course engages students through an interactive learning approach which takes place in Sicily, as one of the most crucial locations to directly observe, live, and experience migration challenges in the Mediterranean, as well as get the real sense of what managing migration “crises” practically means.\n\nLocated in the heart of the Mediterranean Sea, Sicily in recent years has become a critical southern borderland at the crossroad of migratory flows and one of the main gateways to Italy and the European Union (EU). While Italy is among the EU Member States that received the highest number of sea arrivals, within Italy Sicily was the major disembarkation location, accounting for 68% of the total number of sea arrivals in the country between 2014 and 2018. By receiving a large flow of people on the move, Sicily stands out as a crucial venue where to interact and engage with contemporary migration challenges and narratives. It offers the opportunity to study the many aspects of migration in Europe and in the Mediterranean in terms of politics, policies, and polity and in terms of the convoluted interaction among different narratives, discourses and actors (migrants and civil society’s voices, politicians, border guards, sea rescuers, human smugglers, media, etc.). Moreover, it allows comparative reflections with other critical southern borders.\n",
    "prereq": {}
  },
  {
    "uid": "825918",
    "code": "SCLY3203",
    "subject": "SCLY",
    "number": "3203",
    "honors": false,
    "writing": false,
    "name": "Entrprnrshp. in Southern Italy",
    "fullname": "Entrepreneurship in Southern Italy: Small Businesses as the Drivers of Social Development",
    "info": "Building a new business is a difficult endeavor anywhere in the world; tenacity, creativity, and endless intrinsic motivation are needed to drive the entrepreneurial spirit. Successful entrepreneurship also requires government and institutional support, infrastructure, and investment. This is clear in the development of “hubs” —tech, finance, AI, etc.—in urban centers around the globe. Such factors create business ecosystems where new entrants to a specific field can thrive. This is also true in Italy.\n\nAs one of the world’s most industrialized economies, Italy has important manufacturing, finance, and agricultural hubs that foster entrepreneurial growth. However, in Southern Italy, the obstacles to entrepreneurship are outsized in comparison to Northern Italy. Poor infrastructure, low cooperation, and a lack of entrepreneurial education have helped to perpetuate the slow development of the South. Young people often move north or abroad to study and work. This phenomenon, oftentimes dubbed the “brain drain,” can also be seen replicated in other highly industrialized countries, where capital, knowledge, and labor end up concentrating in specific geographical areas creating social divides. Nonetheless, entrepreneurship in Southern Italy is growing. In recent years, over 50% of new small businesses registered in Italy were concentrated in the South and Island regions of the country. Thanks to focused national and regional funding initiatives and collective advocacy movements for business development in Southern Italy, new companies have been able to take root. \n",
    "prereq": {}
  },
  {
    "uid": "825919",
    "code": "SCLY3204",
    "subject": "SCLY",
    "number": "3204",
    "honors": false,
    "writing": false,
    "name": "Ethics in Supply Chain",
    "fullname": "Ethics & Integrity in Supply Chain: Fair Trade, Corruption, & Labor Rights in Sicily",
    "info": "Ethics and integrity in supply chain management (SCM) are continually coming into question as global discussions of fair trade, labor practices, and corruption are more frequently exposed to be connected to business-as-usual practices. Sicily can be viewed as a microcosm of global supply chain challenges and as a laboratory for ethical business practices. From international labor market competition and inequality to the logistics of operating from an island and the implications of corruption and organized crime, businesses of all scales find themselves benefitting from the island’s geopolitical integration in the European Union but also struggling with poor infrastructure, transnational competition, complex transportation logistics, and shifting cultural beliefs. \n\nThis course focuses on the language and tools of sustainability and responsibility as new standard currencies in business and challenges students to consider complex issues of ethics and integrity within real-world business cases in the Sicilian economic and socio-cultural context. As a result of this analysis, students will better understand the realities of applying ethical frameworks to complex, global business environments, and also recognize the medium- and long-term impacts of corporate decisions that can lead to not only thriving businesses ready to adapt to the demands of new and evolving markets, but also to sustain local communities and address complex economic and social challenges through innovation.\n",
    "prereq": {}
  },
  {
    "uid": "826380",
    "code": "SCLY3205",
    "subject": "SCLY",
    "number": "3205",
    "honors": false,
    "writing": false,
    "name": "Sicily Collaborative Practicum",
    "fullname": "Collaborative Practicum in Sicily",
    "info": "This course is an exciting way for you to develop skills and confidence by working in multidisciplinary teams on a project based in Ortigia, Siracusa, Sicily.\n\nEach term, the design team will begin a new project, or advance the next phase of a project from a previous team. Regardless, you will work with local community partners and professional Italian designers as mentors to help shape a design response to an unmet need or opportunity in historic Ortigia and/or the city of Siracusa.\n\nYour mentors will lead the design team in ways that are much like professional practice. They will help divide the work into manageable parts and smaller working groups, and you will collaboratively determine ambitious, yet achievable goals given the meeting schedule for the summer practicum.\n\nYou will be working alongside other design students (apparel design, architecture, graphic design, interior design, product design, and retail merchandising) to realize at least some aspects of the design proposal at full scale—as prototypes, partial models, or bespoke objects or events. In previous terms, for example, community projects included: designing and building a gateway structure at the edge of the sea, implementing way finding strategies, and screen printing apparel and accessories—all as part of neighborhood revitalization; and generating adaptive reuse strategies for an historic structure in the center of Ortigia, which included graphic identity and branding, prototyping furniture and build-outs, and hosting a communal event to share ideas.\n\nImportantly, your time commitment for this course is determined as a work schedule might be in a firm. You are expected to attend and work/learn at the scheduled meeting times; there is no expectation for practicum work outside of your scheduled hours. (The work/learn meeting schedule will, in total, meet workload expectations for a 3-credit course.)",
    "prereq": {}
  },
  {
    "uid": "826443",
    "code": "SCLY3206",
    "subject": "SCLY",
    "number": "3206",
    "honors": false,
    "writing": false,
    "name": "International Human Rights Law",
    "fullname": "International Human Rights Law",
    "info": "Based on principles of international law, the course intends to introduce students to the international system of protection of human rights and its foundations by presenting and analyzing the sources, the categories, the content, and the limitations, as well as the obligations, which human rights generate for states. The course also outlines the main implementation mechanisms of protection foreseen at the universal and regional level to ensure their respect by studying their scope and their effectiveness.\n\nAlong with this theoretical overview, the course proposes an in-depth analysis of thematic case studies from various human rights categories and dimensions and accompanied by site visits and guest lectures in collaboration with the Siracusa International Institute of Criminal Justice and Human Rights and international NGOs, allowing for a comparative focus on the Euro-Mediterranean region, on the following thematic areas:\n\nClimate change and human rights with relation to:\na) Migration\nb) Food systems\nc) Health and well-being\nd) Gender justice\n\nAsylum and refugee law and policy;\n\nViolence against women\n\nThe responsibilities of businesses to protect human rights (duty of care and due diligence principles, see seasonal workers, migrant workers)\n\nHuman rights and national security (terrorism, smuggling, migration).\n",
    "prereq": {}
  },
  {
    "uid": "827151",
    "code": "SCLY3207",
    "subject": "SCLY",
    "number": "3207",
    "honors": false,
    "writing": false,
    "name": "Marine & Coastal Ecology",
    "fullname": "Marine & Coastal Ecology",
    "info": "This course invites students to critically examine the intricate ecological processes of Mediterranean marine environments. With its extensive coastlines and diverse marine ecosystems, Sicily offers a living laboratory where theoretical concepts are brought to life through empirical observation and study. Students will engage in rigorous scientific investigations, combining fieldwork with scholarly research, to deepen their understanding of marine systems. This course not only emphasizes the biological aspects but also integrates the long-standing human interaction with the sea, fostering a holistic understanding of marine ecology in the context of Sicily's historical and cultural milieu. Students will explore the unique characteristics of the Mediterranean Sea, its diverse ecosystems, and the interplay between organisms and their environment. Through a combination of lectures, fieldwork, and laboratory exercises, participants will gain a solid understanding of the ecological processes, species interactions, and conservation challenges specific to this region. \nThe provinces of Catania and Siracusa, and in particular the island of Ortigia, are perfectly situated for studying the marine environment. Easy access to the shoreline is within walking distance of the study center, and the Plemmirio Marine Protected Area (MPA) monitoring and research facilities (Area Marina Protetta Plemmirio | Area Marina Protetta del Plemmirio) are a stone's throw away. The coastline varies from sandy beaches to limestone cliffs with a great variety of flora and fauna.",
    "prereq": {}
  },
  {
    "uid": "827118",
    "code": "SCLY3208",
    "subject": "SCLY",
    "number": "3208",
    "honors": false,
    "writing": false,
    "name": "Med Conflict: Humans & Environ",
    "fullname": "Mediterranean Conflict: Humans & Environment",
    "info": "Our seas provide us with plentiful natural resources, support wildlife, keep our climate stable, and create employment opportunities. However, unsustainable practices threaten the balance of marine ecosystems. Climate change, pollution, and other human-induced, anthropogenic pressures lead to ongoing global change in marine environments, including water acidification, sea surface warming, sea water level rising, deoxygenation, and changes in nutrient and light regimes. These changes alter multiple chemical and physical seawater properties, propagating to diverse marine microorganisms, through the entire food chain, up to the top predators, including humans.\nMarine biodiversity is essential for balanced food webs, which in turn enable ecosystems to be more adaptable to key challenges such as climate change, habitat degradation, and other major ecological disruptions. Within this framework, mitigation actions, management plans, and the establishment of protected areas, along with responsible and sustainable management of marine resources can be strategic for the restoration of damaged species communities and habitats.\nField trips in the coastal areas of Eastern Sicily allow students to observe the presence of marine vulnerable species and their coexistence with anthropogenic activities. ",
    "prereq": {}
  },
  {
    "uid": "825861",
    "code": "SCLY3895",
    "subject": "SCLY",
    "number": "3895",
    "honors": false,
    "writing": false,
    "name": "Research in Sicily",
    "fullname": "Research in Sicily",
    "info": "This course is an intensive research program offered to undergraduate students interested in furthering their knowledge on migration, asylum, and human rights in Europe and willing to take part in a comparative research experience through field-based learning. The course engages students through an interactive learning approach which takes place in Sicily, as one of the most crucial locations to directly observe, live, and experience migration challenges in the Mediterranean, as well as get the real sense of what managing migration “crises” practically means. Moreover, it offers the chance to develop comparative research designs with other countries, regions, or critical southern borders elsewhere (e.g., US-Mexico border; Myanmar-Thailand border, etc.).\n\nBuilding on this background, this research program aims to introduce undergraduate students to some of the main research methods that are used to explain and do research on migration, asylum, and human rights in the Mediterranean. As there are many ways to do research on these topics, methodologies here included are not intended to be exhaustive. The program delves into the methodology and the research process and offers students the opportunity to learn some of the analytical methods and data collection techniques adopted to investigate migrants and asylum seekers, as well as to implement comparative research designs. Moreover, the course focuses on the ethical challenges which arise for researchers engaged in the study of migration and conducting fieldwork with migrants, including the vulnerability of the research subjects, the issue of transparency, the kind of language adopted, the potential unintended negative consequences for vulnerable actors, and the delicate relationship between the research and the migrant.\n\nOverall, the course aims to bridge the gap between theory and practice, giving students some guidance to understand, learn and experience some of the main appropriate research approaches, methodological and data-collection techniques in relation to the many aspects of migration. Moreover, students will have the possibility to shape their own questions and ensuing analysis, taking advantage of resources in Sicily as well as, possibly, analyzing data and sources in the US and implement a comparative research approach.\n\nNote that the Migration, Human Rights, & the Media course is a co-curricular course to this one. Any students taking this research course will also need to take the Migration, Human Rights, & the Media course to gain the relevant contextual knowledge of this complex topic.",
    "prereq": {}
  },
  {
    "uid": "825170",
    "code": "SCLY3896",
    "subject": "SCLY",
    "number": "3896",
    "honors": false,
    "writing": false,
    "name": "Internship in Sicily",
    "fullname": "Internship in Sicily",
    "info": "The Sicily internship course is designed to provide students with an opportunity to reflect on the intercultural context of the host country’s work environment. Through practical work experiences as well as readings, discussions, and written assignments, students will deepen their understanding of the host-country cultural context and critically examine their own worldview.\n\nThe course is designed to provide students with the opportunity to become more knowledgeable regarding the local culture, organizational cultures, and the Italian business environment in the urban context. It also offers them the unique opportunity to master teamwork and communicate in Italian and/or English. \n\nThe course is designed to guide students in the workplace/internship experience and create a foundation for a successful professional career. The topics and assignments will help students gain a cross-cultural comparative view on work and deepen their insights about themselves, their area of study, and professional practice. \n\nThis course focuses on themes students are expected to develop and enhance over the course of the program through class seminars and the internship experience, particularly work ethic; leadership; communication; multiculturalism; media and politics; and gender and the workplace.\n",
    "prereq": {}
  }
]