[
  {
    "uid": "014355",
    "code": "SENG5115",
    "subject": "SENG",
    "number": "5115",
    "honors": false,
    "writing": false,
    "name": "User Interface Design",
    "fullname": "Graphical User Interface Design, Evaluation, and Implementation",
    "info": "Design and evaluation of interactive application interfaces, user- and task-centered approaches to design, guidelines for graphical design, interface evaluation techniques, current interface trends, including web interfaces and information visualization. Group projects that include designing, prototyping, and implementing an application interface.\n\nprereq: Grad SEng major",
    "prereq": {}
  },
  {
    "uid": "014362",
    "code": "SENG5116",
    "subject": "SENG",
    "number": "5116",
    "honors": false,
    "writing": false,
    "name": "GUI",
    "fullname": "Graphical User Interface Toolkits",
    "info": "Toolkit-centered introduction to GUI implementation technology. Students learn to use a GUI toolkit to implement a graphical application. Introduction to advanced techniques, including constraint-based data management, 3D visualization tools, and toolkit structure and design.\n\nprereq: Grad SEng major",
    "prereq": {}
  },
  {
    "uid": "818179",
    "code": "SENG5130",
    "subject": "SENG",
    "number": "5130",
    "honors": false,
    "writing": false,
    "name": "Internet of Things",
    "fullname": "Introduction to Internet of Things: Systems-Level Design and Experimentation",
    "info": "Project-based examples from modern \"Internet of Things\" (IoT) systems. Hands-on experiments with core wireless hardware, sensors, and software elements. Students will gain the practical system-level skills and understandings able to be applied to any IoT system, and walk away with an IoT project created themselves. There will be discussions and team-centric activities focused on market trends, ground-breaking tech and products, security, communication protocols, and exciting emerging technologies related to IoT including machine learning, artificial intelligence, and augmented reality.",
    "prereq": {}
  },
  {
    "uid": "014365",
    "code": "SENG5131",
    "subject": "SENG",
    "number": "5131",
    "honors": false,
    "writing": false,
    "name": "Distributed Application Design",
    "fullname": "Distributed Application Design and Development",
    "info": "Java programming, concurrent programming, workflow, distributed database, security, collaborative computing, object-oriented architecture/design, network publishing, messaging architecture, distributed object computing, and intranet.\n\nprereq: Grad SEng major",
    "prereq": {}
  },
  {
    "uid": "818180",
    "code": "SENG5132",
    "subject": "SENG",
    "number": "5132",
    "honors": false,
    "writing": false,
    "name": "Web Application Development",
    "fullname": "Web Application Development",
    "info": "This course is an in-depth discussion of the challenges and complexities involved in designing and implementing modern web applications. Students will gain experience designing and implementing a project during in the course of the semester. ",
    "prereq": {}
  },
  {
    "uid": "825628",
    "code": "SENG5133",
    "subject": "SENG",
    "number": "5133",
    "honors": false,
    "writing": false,
    "name": "Cloud Computing",
    "fullname": "Cloud Computing - Leading Technical Change",
    "info": "Today most organizations make use of the \"Cloud\" in some way and it is, understandably, changing the way we architect our systems. But there is confusion around cloud native, 12 factors, modular monoliths, serverless, etc. How does a busy technologist make sense of it all? In this course, using cloud computing as a lens, we will explore the broader impact of technology change. We discuss how a technology radar can help a technologist stay marketable as well as to help an organization stay informed of important changes in the technology landscape. Expected topics: Docker; Kubernetes; Google Kubernetes Engine, Amazon EKS, Amazon Fargate; Cloud Foundry; Functions as a service; Amazon Lambda, Google Cloud Functions, Azure. This course will consist of discussion, hands on assignments, papers, presentations, and use of sample applications.",
    "prereq": {}
  },
  {
    "uid": "788170",
    "code": "SENG5199",
    "subject": "SENG",
    "number": "5199",
    "honors": false,
    "writing": false,
    "name": "Topics in Software Engineering",
    "fullname": "Topics in Software Engineering",
    "info": "Topics specified in Class Schedule.\n\nprereq: SEng grad student",
    "prereq": {}
  },
  {
    "uid": "818181",
    "code": "SENG5271",
    "subject": "SENG",
    "number": "5271",
    "honors": false,
    "writing": false,
    "name": "Cybersecurity",
    "fullname": "Cybersecurity",
    "info": "This course introduces the major topics of cyber security. Class time will focus on demonstrations, exercises, mini-projects, and discussions. Topics include authentication, access control, file system forensics, symmetric and asymmetric cryptography, network monitoring and controls, dynamic web site attacks, and network cryptography. ",
    "prereq": {}
  },
  {
    "uid": "014367",
    "code": "SENG5511",
    "subject": "SENG",
    "number": "5511",
    "honors": false,
    "writing": false,
    "name": "Artific Intellig",
    "fullname": "Artificial Intelligence",
    "info": "Introduces ideas and theories of AI. Problem solving, search, inference techniques. Logic and theorem proving. Knowledge representation, rules, frames, semantic networks. Planning and scheduling. Introduces Lisp programming language.\n\nprereq: Grad SEng major",
    "prereq": {}
  },
  {
    "uid": "014366",
    "code": "SENG5551",
    "subject": "SENG",
    "number": "5551",
    "honors": false,
    "writing": false,
    "name": "Robotics",
    "fullname": "Introduction to Intelligent Robotic Systems",
    "info": "Transformations, kinematics and inverse kinematics, dynamics, and control. Sensing (robot vision, force control, tactile sensing), applications of sensor-based robot control, robot programming, mobile robotics, and micro-robotics.\n\nprereq: Grad SEng major",
    "prereq": {}
  },
  {
    "uid": "014287",
    "code": "SENG5707",
    "subject": "SENG",
    "number": "5707",
    "honors": false,
    "writing": false,
    "name": "Data Modeling",
    "fullname": "The Principles of Database Systems",
    "info": "Fundamental concepts; representing instances; prototypic model shapes; model evolution; interviewing user skills, reverse engineering; mapping to DBMS schema; database querying.\n\nprereq: Grad SEng major",
    "prereq": {}
  },
  {
    "uid": "014363",
    "code": "SENG5708",
    "subject": "SENG",
    "number": "5708",
    "honors": false,
    "writing": false,
    "name": "Advanced Database Management",
    "fullname": "Data Analytics",
    "info": "Applications/motivation. Extended relational, object-relational, and object-oriented data models. Object identifier, types/constructors. Versions, schema evolution. Query language (e.g., recursion, path expressions). Object indices, buffer management, and other implementation issues. Triggers, rules, complex objects, and case studies.\n\nprereq: Grad SEng major",
    "prereq": {}
  },
  {
    "uid": "818182",
    "code": "SENG5709",
    "subject": "SENG",
    "number": "5709",
    "honors": false,
    "writing": false,
    "name": "Event Driven Architecture",
    "fullname": "Event Driven Architecture & Real-time Data Processing",
    "info": "This course is a robust discussion of many topics to learn engineering concepts with regard to event-driven architectures and implementations. Students will gain experience analyzing, designing, and implementing an event-driven system leveraging technologies such as Apache Kafka, Apache Druid, OpenTelemetry, Kafka Streams, and more.\nAt the conclusion of the course, students will have experience or exposure to:\n● Modern data processing concepts\n● Analyzing/Designing event-driven data architectures\n● Kafka Streams and Apache Flink for data processing\n● Analytical Database solutions using Apache Pinot and/or Druid\n● Building observable and maintainable applications\n● Testing strategies and best practices\n● Additional engineering concepts applicable to large-scale enterprise development\nThe course will be a mix of lecture, discussion, use-case evaluation, and hands-on activities to cover the broad domain of modern data engineering",
    "prereq": {}
  },
  {
    "uid": "014285",
    "code": "SENG5801",
    "subject": "SENG",
    "number": "5801",
    "honors": false,
    "writing": false,
    "name": "Software Engr 1",
    "fullname": "Software Engineering I: Overview, Requirements, and Modeling",
    "info": "Software engineering as a discipline. Preview of topics to be covered in subsequent courses in master of science in software engineering program; in-depth study  of requirements engineering; modeling techniques applicable to requirements and specification, including UML and formal modeling.\n\nprereq: Grad SEng major",
    "prereq": {}
  },
  {
    "uid": "014288",
    "code": "SENG5802",
    "subject": "SENG",
    "number": "5802",
    "honors": false,
    "writing": false,
    "name": "Software Engr 2",
    "fullname": "Software Engineering II: Software Design",
    "info": "Software design quality, processes that produce quality design, graphical and textual representations, including UML, common problems and patterns that solve them, refactoring. Students develop fluency in object-oriented design, and ability to read, critique, and advocate design ideas. Students work in teams to complete a multiphase project.\n\nprereq: Grad SEng major",
    "prereq": {}
  },
  {
    "uid": "014354",
    "code": "SENG5811",
    "subject": "SENG",
    "number": "5811",
    "honors": false,
    "writing": false,
    "name": "Software Testing/Verification",
    "fullname": "Software Testing and Verification",
    "info": "Theoretical/practical aspects of testing software. Analyzing a requirements document for test conditions. Writing a test plan. Designing, creating, and executing test cases. Recording defects. Writing a test report.\n\nprereq: 5801, grad SEng major",
    "prereq": {
      "or": [
        "014285"
      ]
    }
  },
  {
    "uid": "014359",
    "code": "SENG5831",
    "subject": "SENG",
    "number": "5831",
    "honors": false,
    "writing": false,
    "name": "Software Dev RealT",
    "fullname": "Software Development for Real-Time Systems",
    "info": "Analysis, design, verification, and validation of real-time systems. Periodic, aperiodic, and sporadic processes, scheduling theory. Pragmatic issues.\n\nprereq: Grad SEng major",
    "prereq": {}
  },
  {
    "uid": "014361",
    "code": "SENG5841",
    "subject": "SENG",
    "number": "5841",
    "honors": false,
    "writing": false,
    "name": "Model-Based Development",
    "fullname": "Model-based Development",
    "info": "Formal specification of software artifacts. Applicability of formal specifications. Methods such as Z, SCR, and Satecharts. Formal analysis. Theorem proving. Reachability analysis. Model checking. Tools such as PVS, Statemate, SPIN, and SMV.\n\nprereq: Grad SEng major",
    "prereq": {}
  },
  {
    "uid": "014356",
    "code": "SENG5851",
    "subject": "SENG",
    "number": "5851",
    "honors": false,
    "writing": false,
    "name": "Software Proj Mgmt",
    "fullname": "Software Project Management",
    "info": "Concepts used to manage software projects. Project management cycle: initiation, planning/control, status reporting, review, post-project analysis. Leadership and motivation strategies. Lecture, discussion, individual/team presentations/projects.\n\nprereq: Grad SEng major",
    "prereq": {}
  },
  {
    "uid": "014357",
    "code": "SENG5852",
    "subject": "SENG",
    "number": "5852",
    "honors": false,
    "writing": false,
    "name": "Quality Assurance",
    "fullname": "Quality Assurance and Process Improvement",
    "info": "Theory and application of capability maturity model: process assessment, modeling, and improvement techniques. Life cycle issues related to development and maintenance; quality, safety, and security assurance; project management; and automated support environments. Group projects and case studies.\n\nprereq: Grad SEng major",
    "prereq": {}
  },
  {
    "uid": "794155",
    "code": "SENG5861",
    "subject": "SENG",
    "number": "5861",
    "honors": false,
    "writing": false,
    "name": "Software Architecture",
    "fullname": "Introduction to Software Architecture",
    "info": "Software/systems architecture. Representation/design, how they fit into software engineering process. Description of architectures, including representation and quality attributes.\n\nprereq: 2nd year, MSSE grad student",
    "prereq": {}
  },
  {
    "uid": "016871",
    "code": "SENG5899",
    "subject": "SENG",
    "number": "5899",
    "honors": false,
    "writing": false,
    "name": "Software Engineering Seminar",
    "fullname": "Software Engineering Seminar",
    "info": "Software engineering trends. Talks by invited speakers, selected readings.\n\nprereq: Grad SEng major, instr consent",
    "prereq": {}
  },
  {
    "uid": "787631",
    "code": "SENG5900",
    "subject": "SENG",
    "number": "5900",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Directed study/research in software engineering. Topics/scope decided in collaboration with instructor.",
    "prereq": {}
  },
  {
    "uid": "788276",
    "code": "SENG8333",
    "subject": "SENG",
    "number": "8333",
    "honors": false,
    "writing": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)\n\nprereq: Master's student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "014358",
    "code": "SENG8494",
    "subject": "SENG",
    "number": "8494",
    "honors": false,
    "writing": false,
    "name": "Capstone Project",
    "fullname": "Capstone Project (Plan B Project)",
    "info": "Students work in teams on software project using tools, techniques, and skills acquired during previous coursework. Each team works with a client to establish requirements, agree upon design, and achieve a successful acceptance test of resulting software system.\n\nprereq: SEng major",
    "prereq": {}
  },
  {
    "uid": "798496",
    "code": "SENG8891",
    "subject": "SENG",
    "number": "8891",
    "honors": false,
    "writing": false,
    "name": "Independent Project",
    "fullname": "Independent Project",
    "info": "Independent project arranged with faculty.",
    "prereq": {}
  }
]