[
  {
    "uid": "004749",
    "code": "SMGT1701",
    "subject": "SMGT",
    "number": "1701",
    "honors": false,
    "writing": false,
    "name": "Intro to Sport Management",
    "fullname": "Introduction to Sport Management",
    "info": "Scope/motive of the study of sport from sociological, psychological, historical, economic, and scientific perspective. Issues in sport.",
    "prereq": {}
  },
  {
    "uid": "809706",
    "code": "SMGT1904",
    "subject": "SMGT",
    "number": "1904",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar: Global Persp",
    "fullname": "Freshman Seminar: Global Perspectives",
    "info": "Reading, discussion, critical analysis, writing about global perspectives. Intensive, small-group setting.\n\nprereq: Fr",
    "prereq": {}
  },
  {
    "uid": "805457",
    "code": "SMGT1905",
    "subject": "SMGT",
    "number": "1905",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Interdisciplinary seminar. Topics specified in Class Schedule.\n\nprereq: Fr",
    "prereq": {}
  },
  {
    "uid": "816106",
    "code": "SMGT2751",
    "subject": "SMGT",
    "number": "2751",
    "honors": false,
    "writing": false,
    "name": "Sport and Wellness in China",
    "fullname": "Sport and Wellness in China",
    "info": "Course covers international and  governing body selection of host market, economic impact of hosting a sport event, media, communications, working with athletes, marketing, event operations, host politics and culture. Students will also participate in wellness and rec as presented by our Chinese partners.",
    "prereq": {}
  },
  {
    "uid": "004254",
    "code": "SMGT3111",
    "subject": "SMGT",
    "number": "3111",
    "honors": false,
    "writing": false,
    "name": "Sports Facility & Event Mgmt",
    "fullname": "Sports Facility and Event Management",
    "info": "Sport facilities and event management represents one of the fastest growing areas in the sport and entertainment industry. The construction of new stadiums, arenas, and other venues continues to evolve as new technologies and service experiences are incorporated into venue construction. Further, the organization and management of sport and other special events has become more challenging as the expectations of event goers have increased and standards of what makes a successful event experience have evolved. This course will review and examine the principles and practices associated with managing a sport facility and delivering sporting events. This course builds on the general principles of sport facility and event management by providing students with both in-depth theoretical knowledge and an industry-focused, practical understanding of the administrative and managerial functions that support venues and events.\n\nIn this course, students will explore topics such as ticket operations, scheduling, event marketing, event budgeting, sponsorship, risk and security, and environmental sustainability as they relate to all types of sport facilities and events. While a primary focus in the course will be on large sport facilities and major sporting events, students will also be given the opportunity to study cases of small venues and local events. As part of this course students will learn to conduct a venue feasibility study, create an event bid, and develop an event management plan. Through these projects students will also connect directly with industry partners to learn their perspectives on contemporary facility and event management as well as build their professional networks in this area of the sport industry.\n\n\nprereq: SMGT major or SMGT minor or CEHD IDP or instructor consent",
    "prereq": {}
  },
  {
    "uid": "004750",
    "code": "SMGT3112",
    "subject": "SMGT",
    "number": "3112",
    "honors": false,
    "writing": false,
    "name": "Appl. Spt. Sci.",
    "fullname": "Applied Sport Science",
    "info": "Introduction to historical discovery, transitional development, and current application of scientific principles/technology to improvement of sport performance.",
    "prereq": {}
  },
  {
    "uid": "826583",
    "code": "SMGT3141",
    "subject": "SMGT",
    "number": "3141",
    "honors": false,
    "writing": false,
    "name": "Esports Management",
    "fullname": "Contemporary Esports Management",
    "info": "This course provides an overview of the esports industry including an analysis of its history, development, and position within the broader sport management field. Esports is described as competitive video gaming delivered as a spectator sport. As such, this course examines the management of esports events, teams, leagues, players, and competitions as well as the important role technological proficiency plays in the field. Numerous sport management activities receive an in-depth focus in the esports context. Upon conclusion of the course, students will demonstrate a comprehensive understanding of the key stakeholders involved in esports and the role esports will play in driving future innovation in sport management.\n\nprereq: None",
    "prereq": {}
  },
  {
    "uid": "792156",
    "code": "SMGT3143",
    "subject": "SMGT",
    "number": "3143",
    "honors": false,
    "writing": false,
    "name": "Orgnztn & Mgmt of Sport",
    "fullname": "Organization and Management of Sport",
    "info": "This course is designed to provide the student with knowledge pertaining to the various aspects of organization, management, and administration within the sport industry. Students will have the opportunity to hear, learn, and share viewpoints as they relate to sport management through lectures, discussions on current events, and case study analysis. Upon the completion of this course, it is expected that students will (1) have a better understanding of the unique management characteristics of the sport industry, (2) understand the relationship between a sport organization and its environment, (3) have the capacity to diagnose critical issues in sport organizations and apply relevant conceptual framework for analysis, and (4) synthesize important managerial and leadership strategies and techniques to “real world” issues in sport.\n\nprereq: SMGT major or SMGT minor or CEHD IDP or instructor consent.",
    "prereq": {}
  },
  {
    "uid": "826584",
    "code": "SMGT3181",
    "subject": "SMGT",
    "number": "3181",
    "honors": false,
    "writing": false,
    "name": "Esports Performance",
    "fullname": "Esports Performance and Healthy Gaming",
    "info": "This course explores the esports industry from the perspectives of successful sport performance and health and wellbeing in the video game industry. This course offers students the opportunity to learn about the emergence of esports and examine the challenges facing esports programs from a performance, health, and wellbeing point of view. Students will also explore esports in society by examining topics such as: diversity, equity, and inclusion, corruption, and match fixing. In this course, students will learn how to ethically develop competitively successful esports programs while ensuring the physical and mental health of esports athletes. Upon conclusion of this course, students will understand the role of esports in sport from the perspective of the program manager and the participant in preparation for embarking on a successful career in the field.\n\nprereq: SMGT 3141 Contemporary Esports Management",
    "prereq": {
      "or": [
        "826583"
      ]
    }
  },
  {
    "uid": "004752",
    "code": "SMGT3301",
    "subject": "SMGT",
    "number": "3301",
    "honors": false,
    "writing": false,
    "name": "Gender Div in Sport",
    "fullname": "Gender and Diversity in Sport",
    "info": "Development of women and girls in sport; minority involvement and influence in sport and legal mandates; sexuality issues; feminism and political issues in sport.",
    "prereq": {}
  },
  {
    "uid": "004767",
    "code": "SMGT3421",
    "subject": "SMGT",
    "number": "3421",
    "honors": false,
    "writing": false,
    "name": "Business of Sport",
    "fullname": "Business of Sport",
    "info": "As the sport industry continues to evolve from a technological and service delivery perspective, the ability of future sport managers to think entrepreneurially about their business as they seek to solve industry problems is of paramount importance. This course examines the sport business ecosystem with a focus on fiscal responsibility and financial management while offering students the opportunity to use the principles of entrepreneurship, forecasting, and risk assessment to build ideas that can shape the future of sport industry offerings.\n\nIn this course, students will learn relevant theories and industry best practices as they consider how to build organizational capacity for, and willingness to, embrace change and risk-taking to innovate product and service offerings. \n\nProjects and assignments in this course will include learning directly from, and writing papers reflecting on, discussions with industry executives in sport organizations that embrace an entrepreneurial mentality. The culminating assignment in this course is a sport entrepreneurship project in which students will leverage on-campus resources to develop a new sport product or service idea.\n\nprereq: SMGT major or SMGT minor or CEHD IDP or instructor consent",
    "prereq": {}
  },
  {
    "uid": "004777",
    "code": "SMGT3501",
    "subject": "SMGT",
    "number": "3501",
    "honors": false,
    "writing": false,
    "name": "Sport in a Diverse Society",
    "fullname": "Sport in a Diverse Society",
    "info": "Relationship between sport and contemporary social institutions. Groups/individuals who have historically been marginalized or excluded from sport participation. Race, sex, social class, sexual orientation, physical (dis)abilities.",
    "prereq": {}
  },
  {
    "uid": "004778",
    "code": "SMGT3601",
    "subject": "SMGT",
    "number": "3601",
    "honors": false,
    "writing": false,
    "name": "Ethics and Values in Sport",
    "fullname": "Ethics and Values in Sport",
    "info": "In sport management, we have many opportunities to ask questions regarding acts and decisions as right or wrong. What does it mean to act in a way that characterizes good behavior? How do we develop morally? What are our personal values and moral orientations? Does sport perpetuate violence in society? What is moral and ethical conduct in sport management? What is meant by the term social responsibility? Do professional sport team owners have a responsibility to the community? How do we make decisions that are good, right and authentic? These questions and other ethical issues in sport will be explored from historical, philosophical, and sociological perspectives. The process of critical reading, thinking, writing, and discussion will be emphasized. Thoughtful reflection and respectful dialogue are encouraged. Critical thinking is a learned process and two activities are central to this process: 1) identifying and challenging assumptions and 2) exploring and imagining alternatives (Brookfield, 1987). \n\nprereq: SMGT major or minor and 60 credits completed or in progress",
    "prereq": {}
  },
  {
    "uid": "004754",
    "code": "SMGT3611",
    "subject": "SMGT",
    "number": "3611",
    "honors": false,
    "writing": false,
    "name": "Sport Psych",
    "fullname": "Sport Psychology",
    "info": "Introduction to sport psychology. People and their behavior in sport contexts.",
    "prereq": {}
  },
  {
    "uid": "004755",
    "code": "SMGT3631",
    "subject": "SMGT",
    "number": "3631",
    "honors": false,
    "writing": false,
    "name": "Sport Marketing",
    "fullname": "Sport Marketing",
    "info": "This course provides an overview of marketing management in sport organizations. The objectives of the course provide students with a broad introduction to sport marketing concepts, the role sport marketing plays in society, and the various factors that influence sport consumer decision making. In this course you will learn fundamental terms, concepts, and frameworks used by sport marketing professionals to cause consumer action. The course places an emphasis on understanding the unique nature of the sport service and emotional commitment sport consumers have toward their favorite sport brands. Basic concepts of market research will be introduced and utilized to help students learn how to uncover unique insights about their potential target markets. Additionally, students will learn the critical role sport sponsorship plays in the broader context of sport marketing. A particular emphasis will be placed on the unique dynamic of marketing sport and marketing through sport. The course will culminate in a marketing plan and sponsorship proposal written on behalf of a spectator sport organization.\n\nprereq: SMGT major or SMGT minor or CEHD IDP or instructor consent",
    "prereq": {}
  },
  {
    "uid": "803298",
    "code": "SMGT3632",
    "subject": "SMGT",
    "number": "3632",
    "honors": false,
    "writing": false,
    "name": "Sport Sales",
    "fullname": "Sport Sales and Fundraising",
    "info": "Effectively managing the revenue generating functions of sport organizations is critical to the long-term success and viability of those entities. This course will allow students to build their knowledge of theoretical approaches to selling and sales management in sport, and it will teach students a range of practical skills that they will be able to apply in addressing sport industry challenges in the revenue generating space. Students will learn the importance of strategic account management in the contexts of season ticket sales, group event sales, premium seating sales, and sponsorship sales. Additionally, students will explore the unique nature of the account management, relationship cultivation, and stewardship process in a sport fundraising context. Particular attention will be paid to fundraising in college athletics.\n\nThe primary projects in this course will include weekly sales simulations, industry case studies, and a sales campaign that is developed in partnership with a real-world, sport industry partner. Upon conclusion of this class, students will be able to clearly identify, define, and solve problems related to generating revenue in sport organizations through the sale of sport services and fundraising using sport as a platform to positively impact the lives of sport participants.\n\nprereq: SMGT major or SMGT minor or CEHD IDP or instructor consent",
    "prereq": {}
  },
  {
    "uid": "816050",
    "code": "SMGT3741",
    "subject": "SMGT",
    "number": "3741",
    "honors": false,
    "writing": false,
    "name": "Sustainability through Sport",
    "fullname": "Sustainability through Sport",
    "info": "With the growing globalization of sport and its influence on social and commercial activities worldwide, environmental sustainability has become a critical component of sport management strategy among socially responsible sport organizations. Sport organizations are increasingly seeking opportunities to be positive contributors to their communities with respect to reducing waste, improving energy efficiency, responsibly using land, developing and contributing to responsible supply chains, and conserving water and other natural resources. This course is designed to familiarize students with a wide-range of manners by which sport organizations are able to use their core competencies and elevated positions in their communities to deliver impactful sustainability programs",
    "prereq": {}
  },
  {
    "uid": "825862",
    "code": "SMGT3826",
    "subject": "SMGT",
    "number": "3826",
    "honors": false,
    "writing": false,
    "name": "Research Methods in SMGT",
    "fullname": "Research Methods in Sport Management",
    "info": "A solid understanding of research methods in sport management is becoming more and more important for students pursuing their career in the world of sport. This course is intended to provide students with an overview of research philosophy and useful research methods in Sport Management in academia and in practice. Students will have the opportunity to learn appropriate skills to conduct effective research on problems facing the decision-makers and practitioners in the sport industry. This course will begin with an overview of research concepts and topics in sport management, along with a discussion of the ethical issues with research projects. It will move on to examine the research process, including selecting a topic, reviewing the literature, formulating research questions, developing a conceptual framework, and establishing the research design. The course will then address qualitative research in sport management, including introducing basic qualitative data collection methods and analysis/coding strategies. The course will then shift to discussing quantitative research paradigms and introducing basic quantitative data analysis techniques.",
    "prereq": {}
  },
  {
    "uid": "004781",
    "code": "SMGT3861",
    "subject": "SMGT",
    "number": "3861",
    "honors": false,
    "writing": false,
    "name": "Sport Law",
    "fullname": "Sport Law",
    "info": "This course is designed to acquaint students to the US legal system, structure, processes, and terminology as they relate to legal issues in sport and physical activity settings. This knowledge will serve as the basis for developing managerial and programming strategies to recognize, analyze, and treat legal risks and provide a safe and productive work environment, therefore providing a competitive advantage to the organizations involved. The course provides sport practitioners an introduction to the legal aspects of contract law, tort law, statutory law, negligence, and constitutional law. A variety of instructional strategies will be utilized including legal case study analyses to understand legal implications in a sport and physical activity setting.  \n\nprereq: SMGT major or SMGT minor or instructor consent",
    "prereq": {}
  },
  {
    "uid": "004757",
    "code": "SMGT3881W",
    "subject": "SMGT",
    "number": "3881",
    "honors": false,
    "writing": true,
    "name": "Senior Seminar - Sport Mgmt",
    "fullname": "Senior Seminar in Sport Management",
    "info": "This course addresses the applicability of research in the management of sport through the culmination of a senior research project as well as providing students with career development. The course will engage participants in the systematic inquiry into their own understanding of various components in delivering a sports program. A major segment of course work involves working with a team of peers on a collaborative research project that will address an organization’s key business/management problem. Each group will identify a sport organization and work collaboratively with them to develop a plan that addresses the respective problem the organization is experiencing. \n\nprereq: SMGT major and Senior, and a C- or better in SMGT 3826 or KIN 3982",
    "prereq": {
      "or": [
        "825862",
        "810410"
      ]
    }
  },
  {
    "uid": "804642",
    "code": "SMGT3993",
    "subject": "SMGT",
    "number": "3993",
    "honors": false,
    "writing": false,
    "name": "Directed Study Sport Mgmt",
    "fullname": "Directed Study in Sport Management",
    "info": "Students have the opportunity to earn credit while working in a lab or field research setting to carry our scholarly or creative activities while under the guidance of a School of Kinesiology Sport Management faculty member.  Students can assist with faculty scholarship or carry out projects of their own.\n\nTo earn credit in this course, students must talk with the faculty member and then fill out a Directed Activity Contract (z.umn.edu/Directed_Activity) online.  This contract is an agreement between the student and faculty member and should establish expectations, credits, and the grading basis for the work.",
    "prereq": {}
  },
  {
    "uid": "004758",
    "code": "SMGT3996",
    "subject": "SMGT",
    "number": "3996",
    "honors": false,
    "writing": false,
    "name": "Practicum:The Sport Experience",
    "fullname": "Practicum: The Sport Experience",
    "info": "Practical experience in one or more sport settings.\n\nprereq: 3881, SMGT major, instr consent",
    "prereq": {
      "or": [
        "004757"
      ]
    }
  },
  {
    "uid": "826104",
    "code": "SMGT4520",
    "subject": "SMGT",
    "number": "4520",
    "honors": false,
    "writing": false,
    "name": "Current Topics in SMGT",
    "fullname": "Current Topics in Sport Management",
    "info": "Issues in Sport Management, or in areas not normally available through regular curriculum offerings.\n\nprereq: Upper div in Sport Management BS or Sport Management minor or Kinesiology BS or Physical Activity and Health Promotion BS or Physical Activity and Health Promotion minor or Sports Coaching minor\n\n",
    "prereq": {}
  }
]