[
  {
    "uid": "005365",
    "code": "SOIL1125",
    "subject": "SOIL",
    "number": "1125",
    "honors": false,
    "writing": false,
    "name": "The Soil Resource",
    "fullname": "The Soil Resource",
    "info": "Basic physical, chemical, and biological properties of soil. Soil genesis classification and principles of soil fertility. Soil survey information (WEB Soil Survey) used to make a land-use plan. WWW used for lab.",
    "prereq": {}
  },
  {
    "uid": "006578",
    "code": "SOIL2125",
    "subject": "SOIL",
    "number": "2125",
    "honors": false,
    "writing": false,
    "name": "Basic Soil Science",
    "fullname": "Basic Soil Science",
    "info": "Basic physical, chemical, and biological properties of soil. Soil genesis classification, principles of soil fertility. Use of soil survey information to make a land-use plan. WWW used for lab preparation information.\n\nprereq: [CHEM 1015, CHEM 1017] or CHEM 1021 or equiv",
    "prereq": {
      "or": [
        {
          "and": [
            "797614",
            "797615"
          ]
        },
        "002384"
      ]
    }
  },
  {
    "uid": "811491",
    "code": "SOIL2601",
    "subject": "SOIL",
    "number": "2601",
    "honors": false,
    "writing": false,
    "name": "The Social Life of Soil",
    "fullname": "The Social Life of Soil",
    "info": "Soil microorganisms can either promote plant health or wage chemical warfare. And alliances can turn on a dime. Learn about this fascinating dog-eat-dog world and how we can support a rich soil ecosystem that benefits plants and humans.",
    "prereq": {}
  },
  {
    "uid": "007601",
    "code": "SOIL3416",
    "subject": "SOIL",
    "number": "3416",
    "honors": false,
    "writing": false,
    "name": "Plant Nutrients in the Envnmt",
    "fullname": "Plant Nutrients in the Environment",
    "info": "Fundamental concepts in soil fertility and plant nutrition. Discuss dynamics of mineral elements in soil, plants, and the environment. Evaluation, interpretation, and correction of plant nutrient problems.\n\nprereq: SOIL 2125",
    "prereq": {
      "and": [
        "006578"
      ]
    }
  },
  {
    "uid": "008095",
    "code": "SOIL3521",
    "subject": "SOIL",
    "number": "3521",
    "honors": false,
    "writing": false,
    "name": "Soil Judging",
    "fullname": "Soil Judging",
    "info": "A field-based course which requires students to apply fundamental knowledge obtained from Basic Soil Science and Field Study of Soils to the description of soils in the field. This course includes an inter-collegiate Soil Judging contest that takes during the course of the class.  \n\nprereq: An introductory soils course and field studies course.",
    "prereq": {}
  },
  {
    "uid": "011137",
    "code": "SOIL3993",
    "subject": "SOIL",
    "number": "3993",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "A course in which a student designs and carries out a directed study on selected topics or problems under the direction of a faculty member; eg, literature review. Directed study courses may be taken for variable credit and special permission is needed for enrollment. Students enrolling in a directed study will be required to use the University-wide on-line directed study contract process in order to enroll. Prereq: Department consent, instructor consent, no more than 6 credits of directed research counts towards CFANS major requirements",
    "prereq": {}
  },
  {
    "uid": "011140",
    "code": "SOIL3994",
    "subject": "SOIL",
    "number": "3994",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "An opportunity in which a student designs and carries out a directed research project under the direction of a faculty member. Directed research may be taken for variable credit and special permission is needed for enrollment. Students enrolling in a directed research will be required to use the University-wide on-line directed research contract process in order to enroll. \n\nPrereq: Department consent, instructor consent, no more than 6 credits of directed research counts towards CFANS major requirements.",
    "prereq": {}
  },
  {
    "uid": "797727",
    "code": "SOIL4005",
    "subject": "SOIL",
    "number": "4005",
    "honors": false,
    "writing": false,
    "name": "Lab/Field Tech in Soil Sci.",
    "fullname": "Lab and Field Techniques in Soil Science",
    "info": "Field/lab experiences for analysis of soils/landscapes. Students describe soils along a hillslope sequence, take soil samples, and perform suite of chemical, biological, and physical soil analyses. Analytical techniques, safety, quality control issues.",
    "prereq": {}
  },
  {
    "uid": "789958",
    "code": "SOIL4111",
    "subject": "SOIL",
    "number": "4111",
    "honors": false,
    "writing": false,
    "name": "Intro to Precision Agricultur",
    "fullname": "Introduction to Precision Agriculture",
    "info": "Soil, landscape, and crop spatial variability. GIS, DEM, GPS technologies. Variable rate machinery, PA software, remote sensing. Geostatistics, sampling, experimental designs. Precision integrated crop management. Data acquisition, processing, and management. Socio-economical and e-marketing aspects.\n\nprereq: Basic sciences, statistics, soil, agronomy",
    "prereq": {}
  },
  {
    "uid": "793005",
    "code": "SOIL4121",
    "subject": "SOIL",
    "number": "4121",
    "honors": false,
    "writing": false,
    "name": "Microbial Ecology & Appl Micro",
    "fullname": "Microbial Ecology and Applied Microbiology",
    "info": "Interrelationship of microorganisms with terrestrial, aquatic, and organismal environments; survey of bacterial, fungal, and algal components of ecosystems; evolution and structure of microbial communities; population interactions within ecosystems; quantitative and habitat ecology; biogeochemical cycling; and biotechnological approaches to study of microbial ecology; molecular microbial ecology; gene transfer in the environment. Molecular phylogeny of microorganisms.",
    "prereq": {}
  },
  {
    "uid": "796040",
    "code": "SOIL4505",
    "subject": "SOIL",
    "number": "4505",
    "honors": false,
    "writing": false,
    "name": "Soil Geography",
    "fullname": "Soil Geography: Soil Variability on Planet Earth",
    "info": "Distribution/formation of soils on earth's surface. Soil variability/taxonomy. How various soils interact with water, plants, microorganisms, and pollutants. Use/management of land via appreciation of earth's varied soil resources.\n\nprereq: 1125 or 2125 or equiv",
    "prereq": {
      "or": [
        "005365",
        "006578"
      ]
    }
  },
  {
    "uid": "005364",
    "code": "SOIL4511",
    "subject": "SOIL",
    "number": "4511",
    "honors": false,
    "writing": false,
    "name": "Field Study of Soils",
    "fullname": "Field Study of Soils",
    "info": "Learn to write soil profile descriptions in the field. Class requires hands-on experience to determine soil texture, color, and horizon designations in the field.\n\nprereq: 2125",
    "prereq": {
      "and": [
        "006578"
      ]
    }
  },
  {
    "uid": "797729",
    "code": "SOIL5005",
    "subject": "SOIL",
    "number": "5005",
    "honors": false,
    "writing": false,
    "name": "Lab/Field Tech in Soil Sci",
    "fullname": "Lab and Field Techniques in Soil Science",
    "info": "Field/lab experiences for analysis of soils/landscapes. Students describe soils along a hillslope sequence, take soil samples, and perform a suite of chemical, biological, and physical soil analyses. Lab analytical techniques, safety, quality control issues.",
    "prereq": {}
  },
  {
    "uid": "008164",
    "code": "SOIL5111",
    "subject": "SOIL",
    "number": "5111",
    "honors": false,
    "writing": false,
    "name": "Internship in Precision Ag",
    "fullname": "Practicum Internship in Precision Agriculture",
    "info": "Practical experience in precision agriculture in agri-industry/business. Content and extent of work at the internship site is jointly decided by the instructor, host business representative, and student's principal adviser.",
    "prereq": {}
  },
  {
    "uid": "008161",
    "code": "SOIL5125",
    "subject": "SOIL",
    "number": "5125",
    "honors": false,
    "writing": false,
    "name": "Soil Sci Teacher Professional",
    "fullname": "Soil Science for Teachers and Professionals",
    "info": "Basic physical, chemical, and biological properties of soil. Soil genesis classification, principles of soil fertility. Use of soil survey information to make a land-use plan. WWW used for lab preparation information.",
    "prereq": {}
  },
  {
    "uid": "007291",
    "code": "SOIL5232",
    "subject": "SOIL",
    "number": "5232",
    "honors": false,
    "writing": false,
    "name": "Vadose Zone Hydrology",
    "fullname": "Vadose Zone Hydrology",
    "info": "Basic soil physical properties/processes governing transport of mass/energy in soils. Emphasizes water/solute transport through unsaturated root/vadose zones, their impact on subsurface hydrology and on water quality. Lectures, hands-on laboratory exercises, discussion of real world problems, problem solving.\n\nprereq: [Math 1271 or equiv], [Phys 1042 or equiv]",
    "prereq": {
      "and": [
        {
          "or": [
            "000120"
          ]
        }
      ]
    }
  },
  {
    "uid": "012746",
    "code": "SOIL5312",
    "subject": "SOIL",
    "number": "5312",
    "honors": false,
    "writing": false,
    "name": "Soil Chem & Mineralogy Lab",
    "fullname": "Soil Chemistry and Mineralogy Laboratory",
    "info": "Companion laboratory 5311. Clay mineral preparation for x-ray diffraction, selective mineral dissolution, cation exchange properties, absorption and solubility reactions and their modeling, carbonate equilibria, and organic matter extraction and identification. ",
    "prereq": {}
  },
  {
    "uid": "791011",
    "code": "SOIL5532",
    "subject": "SOIL",
    "number": "5532",
    "honors": false,
    "writing": false,
    "name": "Soil Morphology and Mapping",
    "fullname": "Soil Morphology and Mapping",
    "info": "Soil genesis, landscape interpretation, soil mapping. Describing soil properties. Creating mapping legends by sampling. Landscape interpretation for describing soil variability. Geographic information systems. Interpretation of aerial photography and topographic maps. Students delineate hillslope/geomorphic elements and prepare a soil map. Involves full days working in field, physical exertion.",
    "prereq": {}
  },
  {
    "uid": "007995",
    "code": "SOIL5555",
    "subject": "SOIL",
    "number": "5555",
    "honors": false,
    "writing": false,
    "name": "Wetland Soils",
    "fullname": "Wetland Soils",
    "info": "Morphology, chemistry, hydrology, formation of mineral/organic soils in wet environments. Soil morphological indicators of wet conditions, field techniques of identifying hydric soils for wetland delineations. Peatlands. Wetland benefits, preservation, regulation, mitigation. Field trips, lab, field hydric soil delineation project.\n\nprereq: SOIL 1125 or 2125 or equiv or instr consent; concurrent registration is required (or allowed) in SOIL 4511 recommended",
    "prereq": {
      "or": [
        "005365",
        "006578",
        "005364"
      ]
    }
  },
  {
    "uid": "005366",
    "code": "SOIL5611",
    "subject": "SOIL",
    "number": "5611",
    "honors": false,
    "writing": false,
    "name": "Soil Biology & Fertility",
    "fullname": "Soil Biology and Fertility",
    "info": "Properties of microorganisms that impact soil fertility, structure, and quality. Nutrient requirements of microbes and plants, and mineral transformations in biogeochemical cycling. Symbiotic plant/microbe associations and their role in sustainable agricultural production. Biodegradation of pollutants and bioremediation approaches.\n\nprereq: Biol 1009 or equiv, Chem 1021 or equiv; Soil 2125 recommended",
    "prereq": {
      "or": [
        "005416",
        "002384",
        "006578"
      ]
    }
  },
  {
    "uid": "007289",
    "code": "SOIL5711",
    "subject": "SOIL",
    "number": "5711",
    "honors": false,
    "writing": false,
    "name": "Forest Soils",
    "fullname": "Forest Soils",
    "info": "Factors affecting tree growth; estimation, modification, and management effects on site productivity; regeneration.",
    "prereq": {}
  },
  {
    "uid": "819579",
    "code": "SOIL5993",
    "subject": "SOIL",
    "number": "5993",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "A course in which a student designs and carries out a directed study on selected topics or problems under the direction of a faculty member; eg, literature review. Directed study courses may be taken for variable credit and special permission is needed for enrollment.  Students enrolling in a directed study will be required to use the University-wide on-line directed study contract process in order to enroll.\n \nPrereq: department consent, instructor consent, no more than 6 credits of directed study counts towards CFANS major requirements.",
    "prereq": {}
  },
  {
    "uid": "819580",
    "code": "SOIL5994",
    "subject": "SOIL",
    "number": "5994",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "An opportunity in which a student designs and carries out a directed research project under the direction of a faculty member. Directed research may be taken for variable credit and special permission is needed for enrollment.Students enrolling in a directed research will be required to use the\nUniversity-wide on-line directed research contract process in order to enroll.\n \nPrereq: department consent, instructor consent, no more than 6 credits of directed research counts towards CFANS major requirements.",
    "prereq": {}
  },
  {
    "uid": "797082",
    "code": "SOIL8005",
    "subject": "SOIL",
    "number": "8005",
    "honors": false,
    "writing": false,
    "name": "Supervised Teaching",
    "fullname": "Supervised Classroom or Extension Teaching Experience",
    "info": "Teaching experience in one of five departments: Biosystems and Agricultural Engineering; Agronomy and Plant Genetics; Horticultural Science; Soil, Water, and Climate; or Plant Pathology.  Participation in discussions about effective teaching to strengthen skills and develop a personal teaching philosophy.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "010653",
    "code": "SOIL8110",
    "subject": "SOIL",
    "number": "8110",
    "honors": false,
    "writing": false,
    "name": "Colloquium",
    "fullname": "Colloquium in Soil Science",
    "info": "Research or intellectual areas in soil science or climatology not covered in regular courses. Topics vary; contact department for current offerings.",
    "prereq": {}
  },
  {
    "uid": "792818",
    "code": "SOIL8123",
    "subject": "SOIL",
    "number": "8123",
    "honors": false,
    "writing": false,
    "name": "Research Ethics",
    "fullname": "Research Ethics in the Plant and Environmental Sciences",
    "info": "Ethics training to graduate students enrolled in plant/environmental graduate research programs and fulfill requirement for training in responsible conduct of research.",
    "prereq": {}
  },
  {
    "uid": "789463",
    "code": "SOIL8252",
    "subject": "SOIL",
    "number": "8252",
    "honors": false,
    "writing": false,
    "name": "Advanced Soil Physics",
    "fullname": "Advanced Soil Physics",
    "info": "Advances in measurements/modeling of soil physical properties/processes as they relate to water, solute, heat movement in soils. Measuring/estimating hydraulic/thermal properties. Scaling, media concepts. Applying fractals. Analytical/numerical solutions of non-steady state heat/water flow equations. Analytical solutions of diffusion-dispersive equation for solute movement. Spatial variability in soil physical properties/processes.\n\nprereq: [5232, differential equations] or instr consent",
    "prereq": {
      "and": [
        "007291"
      ]
    }
  },
  {
    "uid": "793185",
    "code": "SOIL8282",
    "subject": "SOIL",
    "number": "8282",
    "honors": false,
    "writing": false,
    "name": "Modeling Water,Carbon,Nitrogen",
    "fullname": "Modeling Water, Carbon, and Nitrogen Dynamics in the Soil-Plant-Air System",
    "info": "Integrative/quantitative treatment of dynamics of water, carbon, and nitrogen in soil-plant-air continuum.",
    "prereq": {}
  },
  {
    "uid": "010680",
    "code": "SOIL8510",
    "subject": "SOIL",
    "number": "8510",
    "honors": false,
    "writing": false,
    "name": "Advanced Pedology",
    "fullname": "Advanced Topics in Pedology",
    "info": "Sample topics: soil-landscape relations, soil genesis, landscape evolution, land use and management, precision agriculture, digital terrain modeling, forest soils.\n\nprereq: 5515",
    "prereq": {}
  },
  {
    "uid": "788973",
    "code": "SOIL8541",
    "subject": "SOIL",
    "number": "8541",
    "honors": false,
    "writing": false,
    "name": "Aquatic & Soil Chemistry",
    "fullname": "Aquatic and Soil Chemistry",
    "info": "Physical chemical principles, geochemical processes controlling chemical composition of natural waters, soil-/sediment-water interactions. Emphasizes behavior of inorganic contaminants in natural waters, engineered systems, dissolved natural organic matter.\n\nprereq: Credit will not be granted if credit has been received for: : CE 8541; 5311 or CE 4541",
    "prereq": {
      "or": [
        "788973"
      ]
    }
  }
]