[
  {
    "uid": "815055",
    "code": "ST5661",
    "subject": "ST",
    "number": "5661",
    "honors": false,
    "writing": false,
    "name": "Securing Cyberspace Fundamntls",
    "fullname": "Securing Cyberspace (Fundamentals)",
    "info": "The course is a two-course sequence which provides a comprehensive technical and logical foundation for defending an organization against cyber security threats. ST 5661 will be offered every fall and ST 5662 every spring.",
    "prereq": {}
  },
  {
    "uid": "815103",
    "code": "ST5662",
    "subject": "ST",
    "number": "5662",
    "honors": false,
    "writing": false,
    "name": "Securing Cyberspace - Advanced",
    "fullname": "Securing Cyberspace - Advanced",
    "info": "The course is a two-course sequence which provides a comprehensive technical and logical foundation for defending an organization against cyber security threats. ",
    "prereq": {}
  },
  {
    "uid": "827228",
    "code": "ST5663",
    "subject": "ST",
    "number": "5663",
    "honors": false,
    "writing": false,
    "name": "Hacking, Breaking, & Poisoning",
    "fullname": "Hacking, Breaking, and Poisoning: Red Teaming Cyber, Physical, and AI Systems",
    "info": "This course will focus on the methods, theory, applications, and techniques of conducting a practical vulnerability assessment from an adversarial point of view. From cybersecurity to physical security, from critical business functions to making organizational impact and articulating the need for change, this course will teach participants how to conduct, present, and leverage red team assessment methods to enhance organizational security and operational readiness. We will explore adversarial thinking, threat modeling, insider threats, and counterintelligence as we explore various ways to attack systems with the goal of making them stronger. The course builds on theories and research into red teaming and prepares students to be effective security practitioners and leaders. From breaking into government buildings to red teaming AI systems to hacking into websites, this course covers the wide world of red teaming as it applies across industries and departments.",
    "prereq": {}
  },
  {
    "uid": "811890",
    "code": "ST8109",
    "subject": "ST",
    "number": "8109",
    "honors": false,
    "writing": false,
    "name": "Cybersecurity Foundations",
    "fullname": "Cybersecurity Foundations - Technology, Risk & Communication",
    "info": "Explore cyber security risks through evaluation of consumer driven technology concepts and their applicability to enterprise. Core technology concepts that face both consumers and businesses. How technology works, how to understand and communicate risks to business management, deliver actionable risk mitigation approaches. Security standards and benchmarks that guide industry. This course is also open to non-ST graduate students and non-degree graduate students who may register with permission/consent from the ST program. (DGS, DGSA or teaching faculty.)",
    "prereq": {}
  },
  {
    "uid": "805571",
    "code": "ST8110",
    "subject": "ST",
    "number": "8110",
    "honors": false,
    "writing": false,
    "name": "Sec Sci & Tech Foundations",
    "fullname": "Security Science and Technology Foundations",
    "info": "Essential areas of emerging science and pivotal technology disciplines for homeland security. Nanotechnology, sensor networks (biosensing, critical infrastructure protection), food and biosafety, cyber and control systems security, and secure energy technologies. Current state-of-the-art status for each technology, together with barriers and opportunities for commercialization.\n\nprereq: Admitted student in security technologies program",
    "prereq": {}
  },
  {
    "uid": "805963",
    "code": "ST8111",
    "subject": "ST",
    "number": "8111",
    "honors": false,
    "writing": false,
    "name": "Methods, Theory & Applications",
    "fullname": "Methods, Theory, and Applications",
    "info": "Methods, theory, techniques and models for understanding risk and implementing security strategies. Processes, methods, and application of risk assessment and management. Approaches for building scenarios, assessing the effectiveness of alternative management strategies, and designing risk management and mitigation plans. Case studies/simulations. How to use emergency management tools, techniques, and resources.",
    "prereq": {}
  },
  {
    "uid": "805964",
    "code": "ST8112",
    "subject": "ST",
    "number": "8112",
    "honors": false,
    "writing": false,
    "name": "Tech for Homeland Security",
    "fullname": "Technology for Homeland Security",
    "info": "Technologies involved in homeland security issues from several perspectives, including science, engineering, business, policy, and society. Advanced tools for the analysis and forecasting of technology and developing strategies aligned with overall stakeholder and organizational goals. Micro- and nanotechnologies and biochemical/chemical, radiological agents. Readings/ discussion. Select a technology topic and analyze its current status and possible future trajectories for application or relevance to key issues of importance to security, both threats and opportunities. Present this in the last class session.",
    "prereq": {}
  },
  {
    "uid": "806202",
    "code": "ST8113",
    "subject": "ST",
    "number": "8113",
    "honors": false,
    "writing": false,
    "name": "Information and Cyber Security",
    "fullname": "Information and Cyber Security",
    "info": "Existing and emerging IT, cyber, communication networks, and coordination activities during emergencies. Technological and policy issues for the need to share information through the use of interoperable technologies and to rapidly collect and synthesize data in real time in order to achieve critical national security.\n\nIn addition to MSST grad students this course is also open to non-ST graduate students and non-degree graduate students who may register with permission/consent from the ST program (DGS, DGSA or teaching faculty).",
    "prereq": {}
  },
  {
    "uid": "807604",
    "code": "ST8200",
    "subject": "ST",
    "number": "8200",
    "honors": false,
    "writing": false,
    "name": "Special Topics",
    "fullname": "Special Topics in Security Technologies",
    "info": "Leaders in the field related to security technologies. Special speakers.",
    "prereq": {}
  },
  {
    "uid": "805966",
    "code": "ST8220",
    "subject": "ST",
    "number": "8220",
    "honors": false,
    "writing": false,
    "name": "Risk & Threat Assessment Mgmt",
    "fullname": "Vulnerability, Risk, and Threat Assessment and Management",
    "info": "Principles, methods, and practices of threat and vulnerability assessment/risk reduction. Integration of risk assessment and management principles into strategic planning/decision-making. Case studies. Examples of risk assessment/management.",
    "prereq": {}
  },
  {
    "uid": "805968",
    "code": "ST8221",
    "subject": "ST",
    "number": "8221",
    "honors": false,
    "writing": false,
    "name": "Comm of Risk & Security",
    "fullname": "Communications of Risk and Security",
    "info": "Analyze public speaking. How to be an effective listener, how to prepare for effective public speaking, how to be an effective writer, communicate by email, write for emphasis, tone, and business writing.\n\nprereq: MSST grad student",
    "prereq": {}
  },
  {
    "uid": "805585",
    "code": "ST8330",
    "subject": "ST",
    "number": "8330",
    "honors": false,
    "writing": false,
    "name": "Critical Infrastructure Protec",
    "fullname": "Critical Infrastructure Protection",
    "info": "Systems risk analysis, engineering, economics, and public policy. Investigate infrastructure security/support design and management of complex civil infrastructure systems. Systems' vulnerability assessment, asset and risk management, investigation of infrastructure interdependencies and couplings, along with judicious analyses of policies. Contribution of science and technology to strategically enhance security/quality of life.\n\nprereq: MSST grad student",
    "prereq": {}
  },
  {
    "uid": "805969",
    "code": "ST8331",
    "subject": "ST",
    "number": "8331",
    "honors": false,
    "writing": false,
    "name": "Dynamic Systems",
    "fullname": "Dynamic Systems Modeling and Simulation Tools",
    "info": "Techniques for modeling complex systems and predicting and evaluating consequences, risks and the potential utility of interventions and countermeasures in the context of intentional disruption or use of the system as an attack vehicle. Importance of inter/intra system modeling. Variety of modeling approaches. How systems can be characterized focusing on the parameters that are important for consequence assessment, risk assessment, capability benchmarking, and decision support. Develop a systems and simulation-based approach to risk assessment, preparedness, intervention assessment, and problem solving.",
    "prereq": {}
  },
  {
    "uid": "806862",
    "code": "ST8440",
    "subject": "ST",
    "number": "8440",
    "honors": false,
    "writing": false,
    "name": "Security Practicum",
    "fullname": "Security Practicum",
    "info": "Seminars and focused workshops on selected areas of security science and technology.\n\nprereq: Admitted to MSST grad program",
    "prereq": {}
  },
  {
    "uid": "805970",
    "code": "ST8441",
    "subject": "ST",
    "number": "8441",
    "honors": false,
    "writing": false,
    "name": "Internship (optional)",
    "fullname": "Internship (optional)",
    "info": "TLI internships offer a unique opportunity to bridge the gap between academic knowledge and practical experience. Interns work with industry professionals, through a combination of experiential learning, mentorship, and targeted projects, developing new skills and knowledge needed to thrive in leadership roles. ",
    "prereq": {}
  },
  {
    "uid": "805586",
    "code": "ST8510",
    "subject": "ST",
    "number": "8510",
    "honors": false,
    "writing": false,
    "name": "Psy/Beh Intel for Hmland Sec",
    "fullname": "Psychology/Behavior Intelligence for Homeland Security",
    "info": "Political, psychological, sociological, and economic foundations and dynamics of both terrorism and homeland security. Contemporary debates over terrorism, counterterrorism, and homeland security. Students develop their own (informed) perspectives.",
    "prereq": {}
  },
  {
    "uid": "805971",
    "code": "ST8511",
    "subject": "ST",
    "number": "8511",
    "honors": false,
    "writing": false,
    "name": "Public Policy",
    "fullname": "Public Policy",
    "info": "Key policies in the U.S. addressing safety and security of citizens, institutions, and systems. Complex network of actors/organizations involved in S&T and security-related areas and their multiple objectives and values. Legislative, policy, and organizational issues facing U.S. intelligence, business, academic, and S&T communities. Students reflect on how these issues relate to their own professional roles/experiences, as well as stakeholder communities with which they work. Consider a specific piece of security-related legislation/analyze associated policy problems and how they relate to security risks. Historical and contemporary examples used to illustrate related public policy questions.   ",
    "prereq": {}
  },
  {
    "uid": "806256",
    "code": "ST8512",
    "subject": "ST",
    "number": "8512",
    "honors": false,
    "writing": false,
    "name": "Coflict Mgmt: Sec Priv & Ethic",
    "fullname": "Partnership in Conflict Management: Security/Privacy Law, Social Responsibility and Ethics",
    "info": "An exploration of challenges to American civil liberties and national security in times of terrorism.\n\nprereq: MSST grad student",
    "prereq": {}
  },
  {
    "uid": "815102",
    "code": "ST8513",
    "subject": "ST",
    "number": "8513",
    "honors": false,
    "writing": false,
    "name": "Cyber Threat Intelligence",
    "fullname": "Cyber Threat Intelligence",
    "info": "The educational objective of this course is to provide students the foundational theory and applied skill in cyber threat intelligence analysis. This includes all phases of the intelligence life cycle: requirements development, collection, analysis methods, and reports and briefings for organizational leaders to influence risk-based cyber security decisions.  The class counts as an elective for the MSST major and is also open to other graduate students after consultation with the director of graduate studies and a background check.",
    "prereq": {}
  },
  {
    "uid": "806203",
    "code": "ST8620",
    "subject": "ST",
    "number": "8620",
    "honors": false,
    "writing": false,
    "name": "Capstone",
    "fullname": "Capstone",
    "info": "The Capstone project is an independent, original, and applied investigation on a relevant subject, problem, or issue in the area of security technologies and homeland security.\n\nprereq: MSST grad program student",
    "prereq": {}
  },
  {
    "uid": "807282",
    "code": "ST8660",
    "subject": "ST",
    "number": "8660",
    "honors": false,
    "writing": false,
    "name": "Independent Study Course",
    "fullname": "Independent Study",
    "info": "Focused study in security science, technology, business, policy or law, with a deliverable project report/presentation.",
    "prereq": {}
  }
]