[
  {
    "uid": "799700",
    "code": "SUST3003",
    "subject": "SUST",
    "number": "3003",
    "honors": false,
    "writing": false,
    "name": "Frameworks of Sustainability",
    "fullname": "Sustainable People, Sustainable Planet",
    "info": "Introduction to interdisciplinary Sustainability Studies minor. Scientific, cultural, ethical, and economic concepts that affect environmental sustainability and global economic justice. Key texts. Participatory classroom environment.\n\nprereq: Soph or jr or sr",
    "prereq": {}
  },
  {
    "uid": "817698",
    "code": "SUST3017",
    "subject": "SUST",
    "number": "3017",
    "honors": false,
    "writing": false,
    "name": "Environmental Justice",
    "fullname": "Environmental Justice",
    "info": "With a focus on understanding environmental justice, including interconnections between health, economic and environmental disparities, this course shows students how they can take action for sustainability. Students synthesize multiple disciplinary perspectives and participate in small group collaborative activities, service learning, and digital mapping, all related to contemporary challenges.",
    "prereq": {}
  },
  {
    "uid": "804483",
    "code": "SUST3480",
    "subject": "SUST",
    "number": "3480",
    "honors": false,
    "writing": false,
    "name": "Topics in Sustainability",
    "fullname": "Topics in Sustainability",
    "info": "Topics in sustainability encompass special courses related to issues such as renewable energy, food and waste systems, sustainable planning, water and climate change.",
    "prereq": {}
  },
  {
    "uid": "818158",
    "code": "SUST3501",
    "subject": "SUST",
    "number": "3501",
    "honors": false,
    "writing": false,
    "name": "Environment & Culture in China",
    "fullname": "Environmental and Cultural Diversity in China",
    "info": "This Global Seminar takes place in southwest China's Yunnan Province, a region of natural beauty and home to 26 ethnic minority groups. The program explores how an emerging international ecotourism sector affects the livelihoods and culture of remote ethnic communities at the edge of the Tibetan plateau. The ecology of the communities the class will visit, which are among the most biodiverse in the world, will be a focus for the program. Spectacular snow-capped mountains, alpine meadows, river gorges and grasslands are present. The climate is moderate and the air is clean in this region of China. A trek to a village not accessible by road and a homestay with a Tibetan farm family will be highlights for students in the course. ",
    "prereq": {}
  },
  {
    "uid": "799701",
    "code": "SUST4004",
    "subject": "SUST",
    "number": "4004",
    "honors": false,
    "writing": false,
    "name": "Sustainable Communities",
    "fullname": "Sustainable Communities",
    "info": "Students synthesize multiple disciplinary perspectives and integrate insights gained from various approaches/methods. Concepts/scholarship related to sustainability. Applying knowledge/experience to real sustainability problems.\n\nprereq: [3003 or GLOS 3304, [jr or sr] in sustainability studies minor] or instr consent",
    "prereq": {
      "or": [
        "799700",
        "800687"
      ]
    }
  },
  {
    "uid": "805509",
    "code": "SUST4096",
    "subject": "SUST",
    "number": "4096",
    "honors": false,
    "writing": false,
    "name": "Sustainability Internship",
    "fullname": "Sustainability Internship",
    "info": "This course will provide you with hands-on opportunities to learn about and help promote sustainability in nonprofits, businesses, or government agencies in the Twin Cities and across Minnesota or in operational units at the University of Minnesota. You may also propose to develop your own internship experience so long as you are able to identify an approved mentor to serve as your internship supervisor. This course will also help you build connections and learn about the rewards and challenges involved in sustainability.",
    "prereq": {}
  },
  {
    "uid": "820110",
    "code": "SUST5480",
    "subject": "SUST",
    "number": "5480",
    "honors": false,
    "writing": false,
    "name": "Topics in Sustainability",
    "fullname": "SUST 5480 Topics in Sustainability",
    "info": "Topics in sustainability encompass special courses related to issues such as renewable energy, food and waste systems, sustainable planning, water and climate change.",
    "prereq": {}
  }
]