[
  {
    "uid": "002093",
    "code": "TH1101W",
    "subject": "TH",
    "number": "1101",
    "honors": false,
    "writing": true,
    "name": "Intro to Theatre",
    "fullname": "Introduction to the Theatre",
    "info": "What is theatre? And what can it be? In this introductory course, we investigate the idea that while theatre is art, it also has consequences. Theatrical performance reflects, resists, and rewrites culture; it can (and does) perform the political by reimagining and transforming society. Through exciting examples of plays and productions from around the world, we investigate the history, politics, and aesthetics of theatre. We explore how the different components of theatre (from directing to acting, costume, and lighting design) come together to create powerful impact on stage. We read and discuss plays in class, see performances on stage, and hear from some of the Twin Cities’s most dynamic and committed artists. And we work on valuable writing skills that help us to deepen our understanding of theatre and communicate our insights to others. At the end of the class, we bring together everything we have been learning to make theatre in small groups. \n\nNo previous theatre experience is needed.",
    "prereq": {}
  },
  {
    "uid": "008247",
    "code": "TH1102",
    "subject": "TH",
    "number": "1102",
    "honors": false,
    "writing": false,
    "name": "Stage, Screen, Society",
    "fullname": "Stage, Screen, Society: Performance in the Media Age",
    "info": "From viral memes to ‘fake news,’ from video-gaming to vlogging, our rapidly changing media-scape is at the center of public debates about everything from mental health to the future of democracy. This course engages with these debates to understand the power of new media to shape our identities and values, our cultural habits and communities, our economy and political life. We discuss how we “perform ourselves” through media, giving rise to social anxieties about truth, authenticity, equality, and belonging, but also to tremendous opportunities for self-expression and connection. And we investigate how our performances are monetized or instrumentalized by governments, social movements, or corporations. How did our current media system develop, and whose interests has it served? How, for better or worse, has the social media age changed us and the world we live in? And how can we make sure that in the future that change is for the better?",
    "prereq": {}
  },
  {
    "uid": "016752",
    "code": "TH1111",
    "subject": "TH",
    "number": "1111",
    "honors": false,
    "writing": false,
    "name": "Intro to Theatre--Condensed",
    "fullname": "Introduction to the Theatre--Condensed Version",
    "info": "Art/craft of theatre. Appreciation, critical analysis of plays/performances. Ways theatre interacts with society. Examples from diverse theatre over the ages and from various cultural perspectives.  Seven weeks.",
    "prereq": {}
  },
  {
    "uid": "016753",
    "code": "TH1112",
    "subject": "TH",
    "number": "1112",
    "honors": false,
    "writing": false,
    "name": "Drama and the Media--Condensed",
    "fullname": "Drama and the Media--Condensed Version",
    "info": "Drama/cultural values implicit in media. Study of primary texts (biography, history, the novel, plays); video clips; complete films. How film/television shape collective cultural identity. Seven weeks.",
    "prereq": {}
  },
  {
    "uid": "016208",
    "code": "TH1301",
    "subject": "TH",
    "number": "1301",
    "honors": false,
    "writing": false,
    "name": "Acting/Non-Majors",
    "fullname": "Acting/Non-Majors",
    "info": "Have you ever wondered how actors learn all those lines?  Or if you could convincingly perform a character that doesn’t have your values or beliefs? In Acting for Non-Majors, you’ll be able to safely explore these questions and you don’t need to have any prior acting/stage experience. You’ll develop a vocabulary for discussing theater and recognize how studying acting can form new perceptions about yourself and others. You’ll be given opportunities to experiment with a variety of acting techniques and styles through exercises, readings, writings, rehearsals, and performances. After completing this course you’ll be amazed by what you’ve accomplished. Could the acting bug bite you?  You never know until you try.  ",
    "prereq": {}
  },
  {
    "uid": "008249",
    "code": "TH1321",
    "subject": "TH",
    "number": "1321",
    "honors": false,
    "writing": false,
    "name": "Fundamentals of Acting",
    "fullname": "Fundamentals of Acting & Performance",
    "info": "How is acting an art form?  What makes a performance powerful?  How can the actor create character and express intention and emotion?  This course is a theatrical laboratory where we actively investigate the art of acting - its relationship to ourselves, to theater as whole, and to society. In this course, we will explore the connections between voice, body, and imagination that make a performance vivid and alive. Through acting exercises, improvisation, and scene study, we will work to understand character motivations, relationships, and plot structure and find ways to express them dynamically onstage. Through experimentation, observation, and discussion we will work together to develop a common vocabulary to evaluate and improve our performances. Throughout this course we will develop a supportive community where we can take greater creative risks and grow as artists. This course offers the insight, skills, and deeper trust and self-confidence for dynamic performance. Come prepared to act, think, read, and write as you imagine the possibilities of theatre and discover your own potential as a performer.",
    "prereq": {}
  },
  {
    "uid": "790525",
    "code": "TH1322",
    "subject": "TH",
    "number": "1322",
    "honors": false,
    "writing": false,
    "name": "Creating the Performance",
    "fullname": "Creating the Performance",
    "info": "An introduction to techniques of creating and directing performance, this course introduces students to the multiple paradigms of creating new and scripted work. Students examine the shifting role of the playwright, actor, and director as primary creator, interpreter, collaborator, and interdisciplinary artist and their relationship to a variety of performance modes. Students will direct traditional scripted scenes and collaborate to devise new work, exploring acting, writing, directing, and design to create solo and group performances. \n\nThis course may be taken concurrently with some upper division courses. Specific approach may vary by instructor.",
    "prereq": {}
  },
  {
    "uid": "008250",
    "code": "TH1351",
    "subject": "TH",
    "number": "1351",
    "honors": false,
    "writing": false,
    "name": "Beg Vocal Prod/Move",
    "fullname": "Vocal Production and Beginning Movement for Actors",
    "info": "Part I: exercises to develop abdominal breathing, tonal placement, and clear articulation; analysis/performance of prose, poetry, and dramatic texts. Part II: body movement/relaxation combined with acting technique leading to individual/group performance.",
    "prereq": {}
  },
  {
    "uid": "788137",
    "code": "TH1361",
    "subject": "TH",
    "number": "1361",
    "honors": false,
    "writing": false,
    "name": "Singing for Musical Theatre",
    "fullname": "Singing for Musical Theatre",
    "info": "Do you love singing Musical Theatre? Whether you are Defying Gravity with Cynthia Erivo, bearing your soul along with Ben Platt, finding vulnerability and beauty with Kelli O’Hare, or rocking out with Jonathan Groff alone in the car or shower, we find ourselves connecting to the journey and stories told through song. This class explores the interpretation of song through vocal, acting, and audition techniques. This class dives deep into the exploration of song, vocal technique, and character analysis through lectures, workshops, and individual sessions.  This class is designed to build confidence not only for the individual and the performer as well. The class work cumulates to an end-of-the-semester cabaret performance.",
    "prereq": {}
  },
  {
    "uid": "793912",
    "code": "TH1362",
    "subject": "TH",
    "number": "1362",
    "honors": false,
    "writing": false,
    "name": "Dance for Musical Theatre",
    "fullname": "Dance for Musical Theatre",
    "info": "Do you get a thrill when you see a Broadway musical onstage or in film? Would you like to obtain the skills seen in shows such as \"Hamilton\" or \"Wicked\"? If so, this is the class for you! Dance for Musical Theatre, geared to all levels, incorporates many styles of dance found in musical theatre including jazz, hip hop, tap, ballet, and many more. Throughout this course, you will learn proper physical alignment and technique to enable you to safely explore these styles while gaining strength, flexibility, agility, and rhythm. Feel free to work at your level. You will be met wherever your skill level is. The final project will be an informal cabaret performance exhibiting the pieces worked on throughout the semester, some containing original Broadway choreography! You don't want to miss this class!",
    "prereq": {}
  },
  {
    "uid": "802419",
    "code": "TH1381",
    "subject": "TH",
    "number": "1381",
    "honors": false,
    "writing": false,
    "name": "New Voices",
    "fullname": "New Voices",
    "info": "Instructors lead students in four Saturday workshop intensives. Student forge interdisciplinary collaborations as they journey through their respective programs.\n\nprereq: [Fr or transfer] student from BFA actor training or BA or BFA dance or BA theater",
    "prereq": {}
  },
  {
    "uid": "789638",
    "code": "TH1391",
    "subject": "TH",
    "number": "1391",
    "honors": false,
    "writing": false,
    "name": "BFA Acting I",
    "fullname": "BFA Acting I",
    "info": "Acting.\n\nprereq: Accepted into BFA acting program",
    "prereq": {}
  },
  {
    "uid": "789902",
    "code": "TH1392",
    "subject": "TH",
    "number": "1392",
    "honors": false,
    "writing": false,
    "name": "BFA Voice and Speech I",
    "fullname": "BFA Voice and Speech I",
    "info": "Study/practice in breath centering/expansion; vocal resonance, musicality, placement; ear training; strengthening and making more flexible the muscles of speech.\n\nprereq: Accepted into BFA acting prog",
    "prereq": {}
  },
  {
    "uid": "790360",
    "code": "TH1393",
    "subject": "TH",
    "number": "1393",
    "honors": false,
    "writing": false,
    "name": "BFA Movement I",
    "fullname": "BFA Movement I",
    "info": "Focuses on building a foundation for further work in program.\n\nprereq: BFA-acting major",
    "prereq": {}
  },
  {
    "uid": "790361",
    "code": "TH1394",
    "subject": "TH",
    "number": "1394",
    "honors": false,
    "writing": false,
    "name": "Voice and Speech I",
    "fullname": "Voice and Speech I",
    "info": "Core curriculum for BFA Actor Training Program in area of voice. Focuses on building a foundation for further work in the program.",
    "prereq": {}
  },
  {
    "uid": "794820",
    "code": "TH1395",
    "subject": "TH",
    "number": "1395",
    "honors": false,
    "writing": false,
    "name": "BFA Acting II",
    "fullname": "BFA Acting II",
    "info": "Continuing the process of interpreting dramatic material.\n\nprereq: 1391",
    "prereq": {
      "and": [
        "789638"
      ]
    }
  },
  {
    "uid": "794821",
    "code": "TH1396",
    "subject": "TH",
    "number": "1396",
    "honors": false,
    "writing": false,
    "name": "BFA Voice & Speech II",
    "fullname": "BFA Voice and Speech II",
    "info": "Building a foundation for further work in the program. Emphasizes practicing the sounds of good American speech and of the written phonetic alphabet.\n\nprereq: 1392",
    "prereq": {
      "and": [
        "789902"
      ]
    }
  },
  {
    "uid": "794822",
    "code": "TH1397",
    "subject": "TH",
    "number": "1397",
    "honors": false,
    "writing": false,
    "name": "BFA Movement II",
    "fullname": "BFA Movement II",
    "info": "May include sections such as African dance, yoga, movement for actors, and circus techniques. Focuses on building a foundation for further work in the program.\n\nprereq: 1393",
    "prereq": {
      "and": [
        "790360"
      ]
    }
  },
  {
    "uid": "008248",
    "code": "TH1401",
    "subject": "TH",
    "number": "1401",
    "honors": false,
    "writing": false,
    "name": "Introduction to Performance",
    "fullname": "Introduction to Performance",
    "info": "Explore different dimensions of performance as they relate to theatre, dance, everyday life. Develop vocabulary with which to engage performance by viewing live/recorded performances, reading performing texts, collaborating on small group projects.",
    "prereq": {}
  },
  {
    "uid": "803321",
    "code": "TH1501",
    "subject": "TH",
    "number": "1501",
    "honors": false,
    "writing": false,
    "name": "Intro to Design",
    "fullname": "Introduction to Design for the Theatre",
    "info": "Introduction to Design for the Theatre explores the collaborative process of theatre making with a focus on theatrical design. Students will investigate scenic, costume, lighting, and sound design in an active environment through lectures, discussions, reading assignments, writing exercises, workshops, and experiential projects. This course aims to challenge students as creative thinkers and problem solvers along with preparing them for a future as collaborative theatre makers.",
    "prereq": {}
  },
  {
    "uid": "793628",
    "code": "TH1904",
    "subject": "TH",
    "number": "1904",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: freshman",
    "prereq": {}
  },
  {
    "uid": "791146",
    "code": "TH1905",
    "subject": "TH",
    "number": "1905",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "788189",
    "code": "TH1909W",
    "subject": "TH",
    "number": "1909",
    "honors": false,
    "writing": true,
    "name": "Topics: Freshman Seminar",
    "fullname": "Topics: Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: freshman",
    "prereq": {}
  },
  {
    "uid": "788190",
    "code": "TH1910W",
    "subject": "TH",
    "number": "1910",
    "honors": false,
    "writing": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "790401",
    "code": "TH1911W",
    "subject": "TH",
    "number": "1911",
    "honors": false,
    "writing": true,
    "name": "Attending (to) Theater",
    "fullname": "Attending (to) Theater",
    "info": "How do we attend and attend to theater in the Twin Cities? This seminar introduces non-theater (and potential) majors to the richness of small and mid-sized theater in the Twin Cities such as Penumbra, Open Eye, and Ten Thousand Things, attending 8-10 performances together. Workshops and discussions with theater professionals will help us to develop critical and creative language to think, write about, and potentially create live performance. We'll think together about how theater might forge a different kind of \"commonwealth.\"",
    "prereq": {}
  },
  {
    "uid": "816993",
    "code": "TH1912",
    "subject": "TH",
    "number": "1912",
    "honors": false,
    "writing": false,
    "name": "Art Lab: A Place to Play",
    "fullname": "Art Laboratory: A Place to Play",
    "info": "How do you define collaboration? This seminar presents the characteristics and the challenges of collaboration through representative approaches from the visual arts, music, literature, media, and theater. The seminar content is designed upon three pillars: the collaborative space, flow, and gesture. Through concrete problematic situations, in-class discussion, readings, and proposed themes students will work collaboratively to create a series of events/works to be presented in class. The art of collaboration is a laboratory, a place to play, inspire, question, and fail. It is a platform to unlock personal images, and to cross boundaries to further understand the role of creativity, and innovation while discovering expression across disciplines.",
    "prereq": {}
  },
  {
    "uid": "816994",
    "code": "TH1913",
    "subject": "TH",
    "number": "1913",
    "honors": false,
    "writing": false,
    "name": "Great Actresses and Divas",
    "fullname": "The Great Actresses and Divas of Theatre, Films, Opera, and Musicals",
    "info": "This seminar highlights actresses and divas from Byzantium's Empress Theodora in the sixth century to America's Barbra Streisand in the 21st. The activities of their male contemporaries are well documented, but the female performers have been sadly neglected. The names of Sarah Bernhardt, Maria Callas, Meryl Streep, and Julie Andrews are generally recognized, but what about Isabella Andreini, Lillian Gish, Marian Anderson, and Josephine Baker? All have made unique contributions to theatre, film, opera, and the musical as leading female performers of their time. They were and are the role models who inspire future generations.",
    "prereq": {}
  },
  {
    "uid": "818046",
    "code": "TH1914",
    "subject": "TH",
    "number": "1914",
    "honors": false,
    "writing": false,
    "name": "Ethics of Digital Life",
    "fullname": "Cyborgs and Hackers: The Ethics of Digital Life",
    "info": "Beings with artificial intelligence have raised ethical questions ever since they were fictional characters, such as the robot in the silent film Metropolis (1927). As contemporary technology expands the use of artificial intelligence, principles of ethical responsibility are up for constant debate. We explore ethics in the age of technology by examining how humanity is imagined in the art, science, and everyday life of artificial intelligence. Theater plays and films about cyborgs invest them with feelings, and question their exploitation by humans. Meanwhile, contemporary drones and robots are programmed with data drawn from humans, and evoke different fears of machines taking over the planet. We compare cyborg and hacking cultures to see how human and artificial intelligence engage with each other, and how their battles shape our concepts of intention and responsibility.",
    "prereq": {}
  },
  {
    "uid": "817169",
    "code": "TH1915",
    "subject": "TH",
    "number": "1915",
    "honors": false,
    "writing": false,
    "name": "Musical Theatre and America",
    "fullname": "Musical Theatre and America",
    "info": "Nothing is more American than musical theatre! From \"Oklahoma!\" to \"Hamilton,\" musical theatre has embodied the American Idea, staging stories about opportunity, patriotism, tolerance, and community. It has taken on American problems too, like racism, exclusion, or corporate greed. Some argue that musical theatre has contributed to those same problems, circulating stereotypes, justifying injustices, and acting as a tool of cultural imperialism. \n\nIn this class, we’ll delve into this history, asking what musical theatre can tell us about America’s past, and how recent innovations in the form might help us imagine America’s future. We will analyze production numbers, exploring how each of a musical’s elements — lyrics, plot, score, choreography, and design — builds meaning. We’ll watch lots of examples, look at archival documents from original productions, and talk with visiting directors, choreographers, and designers about how they interpret and reinterpret classic musicals. There will be a short paper putting a production in its historical context, a photo-essay in which you analyze a musical number, and a couple of field trips to productions on and off campus. We will end with a group assignment in which you pitch a revival of a classic musical to a panel of Broadway producers.",
    "prereq": {}
  },
  {
    "uid": "819889",
    "code": "TH1916",
    "subject": "TH",
    "number": "1916",
    "honors": false,
    "writing": false,
    "name": "Living Well With the Dead",
    "fullname": "Living Well With the Dead: Afterlives and Ethics in Contemporary Culture",
    "info": "Zombies fill our television screens, dead pop icons come back as holograms in massive arena concerts, immortal cell-lines derived from long-dead humans fill laboratories around the world, and now we can even pay an AI service to maintain our social media life indefinitely after our death. What are the dead doing in contemporary culture? We live in an age when the boundaries between the living and the dead are being redefined. But what are the ethical consequences of this redefinition? Who owns the dead and who gets to profit from them? Do the dead have rights? How do those who are dead but not gone remind us of what we owe to history? What are the responsibilities of the dead to the living and the living to the dead?To answer these questions, this course analyzes examples from popular culture, film, literature, science, and media, past and present. It trains students in skills of research and cultural analysis that are used in several disciplines, from anthropology or literary studies, to media, communications, theatre, sociology, and art history.  ",
    "prereq": {}
  },
  {
    "uid": "798175",
    "code": "TH1950",
    "subject": "TH",
    "number": "1950",
    "honors": false,
    "writing": false,
    "name": "Topics in Theater",
    "fullname": "Topics in Theater",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "794160",
    "code": "TH2391",
    "subject": "TH",
    "number": "2391",
    "honors": false,
    "writing": false,
    "name": "BFA Acting III",
    "fullname": "BFA Acting III",
    "info": "Applying concepts of first year of training to an ensemble performance project. Beginning of Shakespeare foundation unit.\n\nprereq: BFA student in theatre arts",
    "prereq": {}
  },
  {
    "uid": "793914",
    "code": "TH2392",
    "subject": "TH",
    "number": "2392",
    "honors": false,
    "writing": false,
    "name": "BFA Voice and Speech III",
    "fullname": "BFA Voice and Speech III",
    "info": "Continuing to build a strong, healthy voice. Mastering written phonetics, sounds of good American speech for stage. Students begin to explore speaking of heightened verse, particularly Shakespearean text.\n\nprereq: BFA student in theatre arts",
    "prereq": {}
  },
  {
    "uid": "793915",
    "code": "TH2393",
    "subject": "TH",
    "number": "2393",
    "honors": false,
    "writing": false,
    "name": "BFA Movement III",
    "fullname": "BFA Movement III",
    "info": "Deepens/refines foundation laid in BFA Movement I/II.\n\nprereq: BFA student in theatre arts",
    "prereq": {}
  },
  {
    "uid": "794831",
    "code": "TH2395",
    "subject": "TH",
    "number": "2395",
    "honors": false,
    "writing": false,
    "name": "BFA Acting IV",
    "fullname": "BFA Acting IV",
    "info": "Application of process towards performance. Emphasizes Shakespeare.\n\nprereq: BFA-Acting sophomore",
    "prereq": {}
  },
  {
    "uid": "794832",
    "code": "TH2396",
    "subject": "TH",
    "number": "2396",
    "honors": false,
    "writing": false,
    "name": "BFA Voice & Speech IV",
    "fullname": "BFA Voice and Speech IV",
    "info": "Continuing to build a strong, healthy voice. Mastering written phonetics and the sounds of good American speech for the stage. Students begin basic dialect acquisition work for the stage. Emphasizes English/Irish dialects.\n\nprereq: BFA-acting, sophmore",
    "prereq": {}
  },
  {
    "uid": "794833",
    "code": "TH2397",
    "subject": "TH",
    "number": "2397",
    "honors": false,
    "writing": false,
    "name": "BFA Movement IV",
    "fullname": "BFA Movement IV",
    "info": "May include sections such as jazz dance, partner dances, and movement for actors.\n\nprereq: BFA-acting sophmore",
    "prereq": {}
  },
  {
    "uid": "008251",
    "code": "TH3100",
    "subject": "TH",
    "number": "3100",
    "honors": false,
    "writing": false,
    "name": "Theatre Lab Practicum",
    "fullname": "Theatre Lab Practicum",
    "info": "This course is for the student to gain more experience, develop new skills, or possibly hone current ones through practical application in the Theatre Arts Shops. Students will complete hours in the Scenery/Properties shop, Costume Shop, Sound/Media Lab, or Light Lab throughout the semester. Registration in TH 3100 is also available for students using show hours to serve in a production capacity on a main stage show, such as technical direction or master electrician.",
    "prereq": {}
  },
  {
    "uid": "008616",
    "code": "TH3115",
    "subject": "TH",
    "number": "3115",
    "honors": false,
    "writing": false,
    "name": "Intro/Playwriting",
    "fullname": "Introduction to Playwriting",
    "info": "Study of traditional play structure, characterization, dialogue, dramatic action, and theme. Final project is a one-act play.",
    "prereq": {}
  },
  {
    "uid": "791327",
    "code": "TH3120",
    "subject": "TH",
    "number": "3120",
    "honors": false,
    "writing": false,
    "name": "Theatre/Theory/Practice",
    "fullname": "Theatre: Theory and Practice",
    "info": "Introdution to diverse ways of thinking about theatre and its representational practices. Students explore traditional/non-traditional modes of performance through readings, discussions, and hands-on performance projects. Seminar-style course.\n\nprereq: 1101",
    "prereq": {
      "and": [
        "002093"
      ]
    }
  },
  {
    "uid": "817549",
    "code": "TH3152W",
    "subject": "TH",
    "number": "3152",
    "honors": false,
    "writing": true,
    "name": "Global Avant-Gardes",
    "fullname": "Global Avant-Gardes: Theatre, Music, Modernity",
    "info": "What does it mean to be an avant-garde artist in the Global South? In postcolonial Africa and Asia, where arts were linked to national modernization projects, artists have played a key role in shaping citizens? identity, alongside schools and universities. While participating in modernizing projects, avant-garde artists maintained independence from state institutions and voiced criticism of dictators. This course examines avant-garde performance in several locations of the Global South, analyzing dramas of national history, modernist music, activist theater, cosmopolitan dance, transnational cultural circuits, and politically radical performances. \n\nReading historical, social, and performance studies, we will develop methods for analyzing performances that aim to make transformative social interventions. These include textual analysis, ethnography, performance analysis, and tracking transnational cultural exchange. You will apply select methods in your final research paper, which centers on an avant-gardist cultural phenomenon in the contemporary Global South.",
    "prereq": {}
  },
  {
    "uid": "008252",
    "code": "TH3171",
    "subject": "TH",
    "number": "3171",
    "honors": false,
    "writing": false,
    "name": "Theatre Historiography: Pt I",
    "fullname": "Western Theatre & Performance Historiography: Part I",
    "info": "What does it mean to represent? By focusing on a critical examination of this and similar questions, this course will investigate how performance events from the Ancient Greece to the French Revolution are brought to our attention, how they are made worthy of notice, and how they are rationalized as significant for theatre and performance history. By studying the theories of the Western origins of theatre and drama, the censoring of creative activities in the Ancient Rome or in the Renaissance England, the appearance of female actors and playwrights in Restoration, and the fashioning of a new economic type the eighteenth century, this course will ask: what are the consequences today of using or promoting these and not other representational practices?",
    "prereq": {}
  },
  {
    "uid": "008253",
    "code": "TH3172",
    "subject": "TH",
    "number": "3172",
    "honors": false,
    "writing": false,
    "name": "Theatre Historiography Pt II",
    "fullname": "Western Theatre & Performance Historiography: Part II",
    "info": "“Dare to Think” is the motto for a critical examination of representational practices from the Age of Enlightenment until the Postmodern Condition today. We will discuss how theatre makers and thinkers responded to this call by offering playtexts and performance practices which challenged mainstream theatre in the era of the revolutions in time and space—Naturalism, Symbolism, Futurism, Dada, Surrealism; Agit-Prop, Theatre of the Oppressed, Theatre for Social Change; Black, Feminist, Queer Theatres; and Pixelated Revolutions. We will investigate histories, politics, and aesthetics of theatre and performance in a variety of cultural and ideological contexts. While reviewing these representational practices, which materialize as play-texts, performances, theatre architecture, theatre rebellions and regulations, theoretical writings, etc., we will discuss how they were produced, given intelligibility, and disseminated.  One may ask: what are the consequences of using or promoting these and not other representational practices? How are performance events brought to our attention by the past and present imaginations? How are they made worthy of notice are rationalized as significant for theatre history.",
    "prereq": {}
  },
  {
    "uid": "797116",
    "code": "TH3261",
    "subject": "TH",
    "number": "3261",
    "honors": false,
    "writing": false,
    "name": "20C French Theatre",
    "fullname": "Dramas of Culture: 20th-Century French and Francophone Theater",
    "info": "Key movements, dramatists, and contexts of 20th-century French and Francophone theatre.  Naturalist and symbolist legacies as well as existentialist, avant-garde, and contemporary performance and drama.",
    "prereq": {}
  },
  {
    "uid": "825855",
    "code": "TH3300",
    "subject": "TH",
    "number": "3300",
    "honors": false,
    "writing": false,
    "name": "Performance Practicum",
    "fullname": "Performance Practicum",
    "info": "This course is for students to gain more experience or hone their skills through participation in a main stage production. Students cast as an actor in a main stage production would participate through TH 3300.",
    "prereq": {}
  },
  {
    "uid": "817334",
    "code": "TH3311",
    "subject": "TH",
    "number": "3311",
    "honors": false,
    "writing": false,
    "name": "Asian American Theater",
    "fullname": "Asian American Theater",
    "info": "Through submerging students in both theater history and practice, this class brings students closer to the history, experiences, and politics of Asian Americans. Why are Asian American stories needed, and how do we tell them? What are the artistic and social agendas driving the making of Asian American theater? How have the styles of performance shifted? While we will be actively working on readings and original theater projects, you don't need to be a theater expert to enjoy this class. Topics will include reading plays by Frank Chin, David Henry Hwang, Wakako Yamauchi, Naomi Iizuka, and others; looking at the history of Asian American theater companies; discussing creative approaches to casting, acting, directing, and design; and building collaborations among companies, audiences, and communities.",
    "prereq": {}
  },
  {
    "uid": "790362",
    "code": "TH3314",
    "subject": "TH",
    "number": "3314",
    "honors": false,
    "writing": false,
    "name": "Text and the Actor",
    "fullname": "Text and the Actor",
    "info": "Standard stage speech, international phonetic alphabet transcription, and textual analysis to perform heightened language texts such as Shakespearean/Shavian monologues, Chaucer's Canterbury Tales, and Beowulf. Videos viewed/discussed.\n\nprereq: 1101, 1321, 1322",
    "prereq": {
      "and": [
        "002093",
        "008249",
        "790525"
      ]
    }
  },
  {
    "uid": "800666",
    "code": "TH3316",
    "subject": "TH",
    "number": "3316",
    "honors": false,
    "writing": false,
    "name": "Voice for the Actor",
    "fullname": "Voice for the Actor",
    "info": "Anatomy/physiology of vocal/respiratory mechanisms. Abdominal breathing, forward tonal placement, articulation of consonants, vocal projection. IPA phonetic transcription and vowel standardization for American Standard Stage Speech. Techniques applied to performance of monologues.\n\nprereq: 1101, 1321, 1322",
    "prereq": {
      "and": [
        "002093",
        "008249",
        "790525"
      ]
    }
  },
  {
    "uid": "008254",
    "code": "TH3321",
    "subject": "TH",
    "number": "3321",
    "honors": false,
    "writing": false,
    "name": "Acting I",
    "fullname": "Acting I",
    "info": "Acting I explores the acting process using the canon of 20th century realism. The class will cover the basics of embodiment for the actor, observation as the root of character creation, analysis of text from an actors perspective, and rehearsal techniques. The core of the course is the preparation of scenes and monologues in class. Students will also complete a variety of class compositions, readings, and will see and analyze live performances.",
    "prereq": {}
  },
  {
    "uid": "008255",
    "code": "TH3322",
    "subject": "TH",
    "number": "3322",
    "honors": false,
    "writing": false,
    "name": "Acting II",
    "fullname": "Acting II",
    "info": "Acting II explores the acting process using scripts from primarily heightened or non-realistic texts. This can include a range of genres from Shakespeare to absurdism to contemporary performance and plays. This course covers the basics of embodiment for the actor, creativity and observation as the roots of character creation, analysis of text from an actors perspective and rehearsal techniques. The core of the course is the preparation of scenes and monologues in class. Students will also complete a variety of class compositions, readings and will see and analyze live performances.",
    "prereq": {}
  },
  {
    "uid": "791175",
    "code": "TH3330",
    "subject": "TH",
    "number": "3330",
    "honors": false,
    "writing": false,
    "name": "Physical Approaches to Acting",
    "fullname": "Physical Approaches to Acting",
    "info": "This course will empower students to create and evaluate theater by providing them with tools to identify and develop compelling and dynamic performance qualities, dramatic intention, and physical metaphor along with a vocabulary to articulate their observations and experience.\n\nStudents will be trained comprehensively by exploring and strengthening the vital connection between physical and vocal expression. In a demanding, yet supportive atmosphere, this course will foster ensemble awareness as well as improvisational and play development skills. Technique, theory, structured improvisation, and collaborative/solo performance projects will give each student the opportunity to assimilate important principles into their working process.\n\nThrough this rigorous course, students will broaden their expressive range and garner the skills that allow them to create meaningful original theater productions that place the actor at the center of the creative process as well as interpret written plays and work of others.",
    "prereq": {}
  },
  {
    "uid": "803015",
    "code": "TH3332",
    "subject": "TH",
    "number": "3332",
    "honors": false,
    "writing": false,
    "name": "Circus Performance",
    "fullname": "Circus Performance",
    "info": "Strength/conditioning, aerial techniques. Acrobatics to improve timing/muscular structure. Juggling to improve hand-eye coordination and showmanship.",
    "prereq": {}
  },
  {
    "uid": "008280",
    "code": "TH3361",
    "subject": "TH",
    "number": "3361",
    "honors": false,
    "writing": false,
    "name": "Introductory Musical Theatre",
    "fullname": "Introductory Musical Theatre",
    "info": "Always wanted to be a triple threat? Do you want to learn how to sing, act, and dance? Do you love hip-hopping with Hamilton, doing the can-can in Moulin Rouge, or strutting your stuff with Kinky Boots? Then this class is for you. This class teaches you the basic skills of the musical theater art form. Through weekly singing and dance classes from beginner to advanced, we meet you at your level to give you the tools to sharpen your skills as a triple threat. This class culminates to a fun musical theatre group dance and performance at the end of the semester.",
    "prereq": {}
  },
  {
    "uid": "789610",
    "code": "TH3365",
    "subject": "TH",
    "number": "3365",
    "honors": false,
    "writing": false,
    "name": "Intermediate Musical Theatre",
    "fullname": "Intermediate Musical Theatre",
    "info": "Musical theatre varying styles. Incorporating music into devised work, as well as strategies on updating traditional performance. Singing, interpretation, dance techniques. Culminates in presentations in public class performance.\n\nprereq: 3361 or instr consent",
    "prereq": {
      "or": [
        "008280"
      ]
    }
  },
  {
    "uid": "811249",
    "code": "TH3370",
    "subject": "TH",
    "number": "3370",
    "honors": false,
    "writing": false,
    "name": "BA Masterclass",
    "fullname": "BA Masterclass",
    "info": "Prepare BA theatre performance majors/minors with essential skills that will enhance performing careers as actors, directors, playwrights. Attend non-traditional performances by national/international touring companies. Engage in vigorous discussions led by those artists who are at the forefront of creation models. Rigorous skill-building workshops led by artists, scholars, technicians.",
    "prereq": {}
  },
  {
    "uid": "791541",
    "code": "TH3381",
    "subject": "TH",
    "number": "3381",
    "honors": false,
    "writing": false,
    "name": "Theatre Storytelling",
    "fullname": "Theater Storytelling",
    "info": "From The Diary of Anne Frank to The Laramie Project and from Evita to Amadeus, many of the most powerful plays ever produced are based on true stories and real people. Is there a historical figure or moment you think is ripe for the limelight? Does your own family history contain a fascinating person or story? Maybe you even have a powerful story about your own life that you feel would make a great performance? Theatre Storytelling gives you the tools to research, write, and share real stories in the form of new short plays. The class includes hands-on activities for teaching interview techniques, researching methods, writing prompts, and supporting other creators in the class. You will emerge with a brand-new ten-minute play or performance about a real story from your life, your family, or our collective human story. We all have stories. Come tell yours!",
    "prereq": {}
  },
  {
    "uid": "790363",
    "code": "TH3391",
    "subject": "TH",
    "number": "3391",
    "honors": false,
    "writing": false,
    "name": "BFA Acting V",
    "fullname": "BFA Acting V",
    "info": "Experiencing a foreign theater culture/history. Applying process of interpreting dramatic material to plays of that culture.",
    "prereq": {}
  },
  {
    "uid": "790364",
    "code": "TH3392",
    "subject": "TH",
    "number": "3392",
    "honors": false,
    "writing": false,
    "name": "BFA Voice and Speech V",
    "fullname": "BFA Voice and Speech V",
    "info": "Experiencing a foreign theater culture/history. Applying voice training to dramatic material of that culture.",
    "prereq": {}
  },
  {
    "uid": "793913",
    "code": "TH3393",
    "subject": "TH",
    "number": "3393",
    "honors": false,
    "writing": false,
    "name": "BFA Movement V",
    "fullname": "BFA Movement V",
    "info": "Experiencing a foreign theatre culture/history, applying training to dramatic material of that culture.\n\nprereq: BFA student in theatre arts",
    "prereq": {}
  },
  {
    "uid": "794836",
    "code": "TH3395",
    "subject": "TH",
    "number": "3395",
    "honors": false,
    "writing": false,
    "name": "BFA Intensive I",
    "fullname": "BFA Intensive I",
    "info": "Incorporating disciplines of acting/voice/movement.\n\nprereq: BFA-acting jr",
    "prereq": {}
  },
  {
    "uid": "794837",
    "code": "TH3398",
    "subject": "TH",
    "number": "3398",
    "honors": false,
    "writing": false,
    "name": "BFA Rehearsal & Performance I",
    "fullname": "BFA Rehearsal & Performance I",
    "info": "Continuing the application of process towards performance.\n\nprereq: BFA-acting jr",
    "prereq": {}
  },
  {
    "uid": "794838",
    "code": "TH3399",
    "subject": "TH",
    "number": "3399",
    "honors": false,
    "writing": false,
    "name": "BFA Rehearsal & Performance II",
    "fullname": "BFA Rehearsal and Performance II",
    "info": "Continuing the application of process towards performance.\n\nprereq: BFA-acting jr",
    "prereq": {}
  },
  {
    "uid": "825857",
    "code": "TH3500",
    "subject": "TH",
    "number": "3500",
    "honors": false,
    "writing": false,
    "name": "Design Practicum",
    "fullname": "Design Practicum",
    "info": "This course is for undergraduate students to gain more experience and hone their skills through design of a main stage or studio production. Students would participate as a main stage designer (2 credits), main stage assistant designer (1 credit), or studio project designer (1 credit) for one of the following: Scenery/Properties, Costumes, Lighting, Sound, or Media. ",
    "prereq": {}
  },
  {
    "uid": "791302",
    "code": "TH3503",
    "subject": "TH",
    "number": "3503",
    "honors": false,
    "writing": false,
    "name": "Design/Tech I - BFA",
    "fullname": "Design and Technical Production I: BFA",
    "info": "Theory, process, and execution of design/technology from script to production on stage. Scenery/properties.",
    "prereq": {}
  },
  {
    "uid": "791328",
    "code": "TH3505",
    "subject": "TH",
    "number": "3505",
    "honors": false,
    "writing": false,
    "name": "Design/Tech II - BFA",
    "fullname": "Design and Technical Production II: BFA",
    "info": "Theory, process, and execution of design/technology from script to production on stage. Costumes/lighting.",
    "prereq": {}
  },
  {
    "uid": "008256",
    "code": "TH3513",
    "subject": "TH",
    "number": "3513",
    "honors": false,
    "writing": false,
    "name": "Design/Tech I",
    "fullname": "Design and Technical Production I",
    "info": "Theory, process, and execution of design/technology from script to production on stage. Scenery/properties.",
    "prereq": {}
  },
  {
    "uid": "008257",
    "code": "TH3515",
    "subject": "TH",
    "number": "3515",
    "honors": false,
    "writing": false,
    "name": "Design/Tech II",
    "fullname": "Design and Technical Production II",
    "info": "Theory, process, and execution of design/technology from script to production on stage. Costumes/lighting.",
    "prereq": {}
  },
  {
    "uid": "803536",
    "code": "TH3521",
    "subject": "TH",
    "number": "3521",
    "honors": false,
    "writing": false,
    "name": "Introduction to Scenic Design",
    "fullname": "Introduction to Scenic Design for Theatre and Performance",
    "info": "This course explores the role of the scenic designer in imagining theatre in space and time. We will shape the arena of dialogue between performer and audience. We will propel action through spatial composition. We will make concrete the tensions and conflicts of the play. We will investigate the composition of emotional and visual space of the theatre. We will communicate ideas by honing skills of drawing, drafting, rendering, modeling, and presentation.",
    "prereq": {}
  },
  {
    "uid": "805379",
    "code": "TH3531",
    "subject": "TH",
    "number": "3531",
    "honors": false,
    "writing": false,
    "name": "Theatrical Costume Design",
    "fullname": "Introduction to Theatrical Costume Design",
    "info": "Costume design process, including, researching, script analysis, the costume designer's role throughout the production process, and design problems.\n\nprereq: TH 3571",
    "prereq": {
      "and": [
        "803322"
      ]
    }
  },
  {
    "uid": "806411",
    "code": "TH3541",
    "subject": "TH",
    "number": "3541",
    "honors": false,
    "writing": false,
    "name": "Intro to Lighting Design",
    "fullname": "Introduction to Lighting Design for the Theatre",
    "info": "Principles and processes in lighting design and lighting technology. Collaborative process of the lighting designer through individual and group projects in a theater, including script analysis and visual literacy through sketching, drafting, and light lab projects. Individual and group projects in composition, color theory, instrumentation, control (dimming), and programming as they apply to theater, opera, and dance.",
    "prereq": {}
  },
  {
    "uid": "810858",
    "code": "TH3559",
    "subject": "TH",
    "number": "3559",
    "honors": false,
    "writing": false,
    "name": "Intro to Sound Design",
    "fullname": "Introduction to Sound Design for the Theatre",
    "info": "Basics of audio design for theatre. Script analysis, audio editing, music research, basic system design, paperwork, cue building. Basic components of audio design. Final project will involve applying skills to partially realized design.\n\nprereq: 1501",
    "prereq": {
      "and": [
        "803321"
      ]
    }
  },
  {
    "uid": "803322",
    "code": "TH3571",
    "subject": "TH",
    "number": "3571",
    "honors": false,
    "writing": false,
    "name": "Intro: Technology for Theatre",
    "fullname": "Introduction to Technology for the Theatre",
    "info": "This course is constructed to help each student experience the processes of theater production by working hands-on with production technologies and methodologies. Students will be divided into three teams for the entire semester which will move through several production disciplines and instructors: Scenic, Costumes, and Lighting in rotations of eight class sessions each and Audio for two class sessions. These classroom projects are reinforced with 4 hours per week of Lab [practical application and practice] in one of the shops. We will explore the interrelationship of Production Practice through three key elements: Production Processes and Modes of Communication (Visual, Narrative, Data Sets), Production Space Systems and Equipment (Large Tools, Permanent Infrastructure, Auxiliary/Temporary Infrastructure), and Production Skills and Techniques (Small Tools, Proprietary Theater Equipment, Construction/Installation Techniques).\nprereq: 1501",
    "prereq": {
      "and": [
        "803321"
      ]
    }
  },
  {
    "uid": "825858",
    "code": "TH3700",
    "subject": "TH",
    "number": "3700",
    "honors": false,
    "writing": false,
    "name": "Directing/Dramaturgy Practicum",
    "fullname": "Directing & Dramaturgy Practicum",
    "info": "This course is for students to gain more experience or hone their skills through participation on a main stage production. Students would participate through one of the following: as an Assistant Director to a faculty director or guest artist OR as a dramaturg for the process.",
    "prereq": {}
  },
  {
    "uid": "008246",
    "code": "TH3711",
    "subject": "TH",
    "number": "3711",
    "honors": false,
    "writing": false,
    "name": "Beginning Directing",
    "fullname": "Beginning Directing",
    "info": "The goal of this class is to introduce you to the basic work and process of the stage director. We will emphasize the practical tasks of analysis, casting, rehearsing, and staging. Our stylistic focus will be on contemporary realistic/naturalistic theater (rather than experimental forms or verse plays). The classwork will invite you to explore many aspects of the craft of directing, including the following:\n\n·\tDefining the role of the director: responsibility and relationships to playwright/actors/audience.\n·\tHow to think and conceptualize like a director.  \n·\tWhat is blocking? How does it work? Who creates it?  Staging actions and events.\n·\tUnderstanding the building blocks of life on stage through composition and scene work.\n·\tAnalysis of dramatic text from the director’s point of view (and expressing it in writing).\n·\tPreparation in the role of the director – historical/textual/visual research.\n·\tRehearsing and working with actors  - What makes a good rehearsal? What is the relationship between actors and director?",
    "prereq": {}
  },
  {
    "uid": "804921",
    "code": "TH3716",
    "subject": "TH",
    "number": "3716",
    "honors": false,
    "writing": false,
    "name": "Stage Management",
    "fullname": "Stage Management",
    "info": "Production process, pre-production to maintaining/closing. Managing rehearsals, communication, conflict resolution. Individual/group projects: promptbook building, blocking notation, Cue placement/execution, scene breakdowns, creating/maintaining checklist, building a form library.\n\nprereq: 1501 or instr consent",
    "prereq": {
      "or": [
        "803321"
      ]
    }
  },
  {
    "uid": "820223",
    "code": "TH3760",
    "subject": "TH",
    "number": "3760",
    "honors": false,
    "writing": false,
    "name": "Studio Stage Management",
    "fullname": "Studio Stage Management",
    "info": "This course is designed for students to gain early experience as a stage manager or assistant stage manager through participation on a stage management team of a BA or BFA Studio production. Students will actively participate in all aspects of the production process gaining hands-on, practical experience as they work to hone their stage management skills. Students will begin to refine their skills in communication, collaboration, organization, and leadership. Students will also meet weekly with their faculty mentor who will help to guide them as they build upon skills gained in TH3716 Stage Management.",
    "prereq": {}
  },
  {
    "uid": "818522",
    "code": "TH3896",
    "subject": "TH",
    "number": "3896",
    "honors": false,
    "writing": false,
    "name": "Internship for Academic Credit",
    "fullname": "Internship for Academic Credit",
    "info": "An applied learning experience in an agreed-upon, short-term, supervised workplace activity, with defined goals, which may be related to a student's major field or area of interest. The work can be full or part time, paid or unpaid, primarily in off-campus environments. Internships integrate classroom knowledge and theory with practical application and skill development in professional or community settings. The skills and knowledge learned should be transferable to other employment settings and not simply to advance the operations of the employer.  Typically the student’s work is supervised and evaluated by a site coordinator or instructor.",
    "prereq": {}
  },
  {
    "uid": "826342",
    "code": "TH3900",
    "subject": "TH",
    "number": "3900",
    "honors": false,
    "writing": false,
    "name": "Production Practicum",
    "fullname": "Production Practicum",
    "info": "This course is for students to gain more experience or hone their skills through participation in a main stage production. Students would participate through a run crew/board operator/assistant stage manager/house manager position",
    "prereq": {}
  },
  {
    "uid": "008258",
    "code": "TH3950",
    "subject": "TH",
    "number": "3950",
    "honors": false,
    "writing": false,
    "name": "Topics in Theatre",
    "fullname": "Topics in Theatre",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "790623",
    "code": "TH3993",
    "subject": "TH",
    "number": "3993",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Guided individual reading or study.\n\nprereq: 6 Th cr, instr consent, dept consent, college consent",
    "prereq": {}
  },
  {
    "uid": "798822",
    "code": "TH4115",
    "subject": "TH",
    "number": "4115",
    "honors": false,
    "writing": false,
    "name": "Intermediate Playwriting",
    "fullname": "Intermediate Playwriting",
    "info": "New methods of play construction. How characteristic plays from particular contemporary styles create original theatrical effects by using/breaking dramatic conventions. Writing exercises, workshoping of student plays.\n\nprereq: 3115 or [writing sample, instr consent]",
    "prereq": {
      "or": [
        "008616"
      ]
    }
  },
  {
    "uid": "008260",
    "code": "TH4131",
    "subject": "TH",
    "number": "4131",
    "honors": false,
    "writing": false,
    "name": "Shakes:Comedy/Rom",
    "fullname": "Shakespeare: Comedies, Romances, and Problem Plays",
    "info": "Shakespeare's plays as live theatre, both for the stage and in various media. Work of actors, directors, and designers in Shakespearean plays.",
    "prereq": {}
  },
  {
    "uid": "008261",
    "code": "TH4132",
    "subject": "TH",
    "number": "4132",
    "honors": false,
    "writing": false,
    "name": "Shakes:Hist/Tragedy",
    "fullname": "Shakespeare: Histories and Tragedies",
    "info": "Shakespeare's plays as live theatre, both for the stage and in various media. Work of actors, directors, and designers in Shakespearean plays.",
    "prereq": {}
  },
  {
    "uid": "008262",
    "code": "TH4177W",
    "subject": "TH",
    "number": "4177",
    "honors": false,
    "writing": true,
    "name": "Dramatic Literature",
    "fullname": "Analysis of Dramatic Literature",
    "info": "This course trains students in the analysis of dramatic literature and develops their research skills in theatre studies, helping them understand plays within their contexts of origin and production. Taking a single theme (ex. madness, or death and mourning) the class brings together contemporary and historical plays from around the world, exploring how theatre offers a unique site to stage differences, understand marginalized experiences, and imagine alternative visions of the world. Assignments break down the writing process into its component parts, and guide students in developing a sustained interpretation of a play of their choice.",
    "prereq": {}
  },
  {
    "uid": "008263",
    "code": "TH4178W",
    "subject": "TH",
    "number": "4178",
    "honors": false,
    "writing": true,
    "name": "Dramatic Lit II",
    "fullname": "Survey of Dramatic Literature II: Representation and its Effects",
    "info": "In-depth look at how plays actively participate in production of social values and of society itself. Emphasizes consequences of choices theatre artists make.\n\nprereq: [[3171, 3172], [jr or sr]] orr instr consent",
    "prereq": {
      "and": [
        {
          "and": [
            "008252",
            "008253"
          ]
        }
      ]
    }
  },
  {
    "uid": "818233",
    "code": "TH4181",
    "subject": "TH",
    "number": "4181",
    "honors": false,
    "writing": false,
    "name": "Aus Identity in Film/Drama/Lit",
    "fullname": "Convicts, Crocodiles, and Contrasts: Exploring Australian Identity in Film and Literature",
    "info": "What is \"Australian\"? The content of this course will employ a cultural, literary, and film studies approach to exploring the development and representation of Australian identity through the lens of film, drama, and literature. The course will be a 3-week long study abroad course with pre-departure readings and films, on-site readings and activities, and a final project due upon return.\nAustralia is an isolated place considered to be on the \"edge of the world,\" simultaneously the oldest continent and a young civil society. It is a place evocative of wild stunning landscape, exotic wildlife, and a history as a convict colony. Since the birth of the Australian film industry in the 1950's Australian filmmakers have sought to tell their own stories and to interrogate the idea of Australian culture. The global success of films such as Mad Max, Crocodile Dundee, and Priscilla Queen of the Desert have served to reinforce and disrupt stereotypes of Australia as a place and culture. In contrast, films such as Rabbit Proof Fence, Animal Kingdom and The Sapphires seek to tell alternative narratives. Themes such as the urban and rural divide, conquering nature, the place in society of indigenous communities, and fatalism are interrogated\nSimilarly, Australian writers such as Colleen McCullugh, Kate Grenville, Tim Winton, and Liane Morriarty have gained international readership. Their novels, as well as others, use landscape and storytelling to create and challenge simplistic ideas of Australian history and culture.\nBy studying the history and works engaged in creating and interpreting this idea of Australian identity, from Australian artists, students will be asked to engage in a more complex way with the ideas of heritage, culture, and national identity in general. Students will also read selected essays on Australian history and culture. The IDI (Intercultural Development Inventory) will also be used as a tool to engage with the dialogue on identity and culture in general.",
    "prereq": {}
  },
  {
    "uid": "008272",
    "code": "TH4321",
    "subject": "TH",
    "number": "4321",
    "honors": false,
    "writing": false,
    "name": "Career Preparation",
    "fullname": "Career Preparation for the Theatre Artist",
    "info": "From personal reflection to real-world insights and hands-on experiences, this course will delve deeply into the skill sets and mindsets important for arts professionals in theater and related fields. I envision our time together as a combined exploration of philosophical, political, and practical questions, thinking through who you want to BE as an artist, what you want your art to DO, and the TOOLS you'll need to manifest that vision in the world. The course will connect you with resources on and off campus, introduce you to professionals working in various facets of the field, engage you in readings and hands-on workshops to deepen your thinking and expand your toolkit, and will culminate in a portfolio project that you can take with you as you transition to life after college. Most importantly, I want this course to be useful and valuable to you, so I will be seeking your input about what you most need, and we'll shape the course accordingly. ",
    "prereq": {}
  },
  {
    "uid": "008273",
    "code": "TH4322",
    "subject": "TH",
    "number": "4322",
    "honors": false,
    "writing": false,
    "name": "Acting for the Camera",
    "fullname": "Acting for the Camera",
    "info": "Do you have favorite screen actors? Have you ever wondered how they DO what they do? Discover the art and technique of acting specifically tailored for film and television in our Acting for the Camera class. Whether your goal is to pursue a career in film, television, or simply deepen your understanding of screen acting, Acting for the Camera is a great hands on class taught by professionals in the field. Over the semester you will watch and perform several  scenes and will leave with copies for your own use. Come learn how the best actors achieve great performances on the small and big screen. ",
    "prereq": {}
  },
  {
    "uid": "795493",
    "code": "TH4380",
    "subject": "TH",
    "number": "4380",
    "honors": false,
    "writing": false,
    "name": "Studio Production",
    "fullname": "BA Studio Production:  Creative Collaboration",
    "info": "Creative Collaboration is the cornerstone class for BA Performance, turning research into practice through scripted and devised performance paradigms.  Each semester students will work with practitioners from eclectic backgrounds to develop original or scripted work focused in one of the six areas of performance; directing; physical theater; realism, playwriting, music driven theater, and object/puppet theater. Classes will culminate in a formal or workshop performance, depending on the goal of each specific collaboration.  Non-performers such as designers, dramaturgs and technicians may take the course for credit and serve as part of the collaborative team.  The course is open to any University of Minnesota student through the audition or interview process. ",
    "prereq": {}
  },
  {
    "uid": "820543",
    "code": "TH4382",
    "subject": "TH",
    "number": "4382",
    "honors": false,
    "writing": false,
    "name": "Inventing Ireland",
    "fullname": "Inventing Ireland",
    "info": "What does the idea of being “Irish” mean? The content of this course will employ a cultural studies and performative theory approach to exploring the development and representation of Irish identity and “Irishness” in the 20th Century through the lens of literature, drama, and film.  The course will be a three-week long study abroad course with pre-departure readings and films, on-site readings of plays and short stories, and a final project due upon return.  By studying the history and works engaged in creating and interpreting this idea of Irish identity, both from and external to Ireland, students will be asked to engage in a more complex way with the ideas of heritage, culture, and national identity in general.  Students will also read selected of essays on culture and Irish history. ",
    "prereq": {}
  },
  {
    "uid": "790365",
    "code": "TH4391",
    "subject": "TH",
    "number": "4391",
    "honors": false,
    "writing": false,
    "name": "BFA Intensive II",
    "fullname": "BFA Intensive II",
    "info": "Applying first three years of training toward performance. Seventh in sequence of eight. Acting, voice, and movement. Integrating the disciplines.\n\nprereq: BFA student in theatre arts",
    "prereq": {}
  },
  {
    "uid": "790366",
    "code": "TH4392",
    "subject": "TH",
    "number": "4392",
    "honors": false,
    "writing": false,
    "name": "BFA Acting VIII",
    "fullname": "BFA Acting VIII",
    "info": "Application of first three years of training toward performance. Career preparation. Eighth in sequence of eight.",
    "prereq": {}
  },
  {
    "uid": "794019",
    "code": "TH4393",
    "subject": "TH",
    "number": "4393",
    "honors": false,
    "writing": false,
    "name": "BFA Reh/Performance III",
    "fullname": "BFA Rehearsal and Performance III",
    "info": "Acting, voice, movement. Application of process toward performance.\n\nprereq: BFA student in theatre arts",
    "prereq": {}
  },
  {
    "uid": "794020",
    "code": "TH4394",
    "subject": "TH",
    "number": "4394",
    "honors": false,
    "writing": false,
    "name": "BFA Reh/Performance  IV",
    "fullname": "BFA Rehearsal and Performance IV",
    "info": "Acting, voice and movement. Application of process toward performance.\n\nprereq: BFA student in theatre arts",
    "prereq": {}
  },
  {
    "uid": "794839",
    "code": "TH4395",
    "subject": "TH",
    "number": "4395",
    "honors": false,
    "writing": false,
    "name": "BFA Intensive III",
    "fullname": "BFA Intensive III",
    "info": "Incorporating the disciplines of acting/voice/movement.\n\nprereq: BFA-acting sr",
    "prereq": {}
  },
  {
    "uid": "794840",
    "code": "TH4398",
    "subject": "TH",
    "number": "4398",
    "honors": false,
    "writing": false,
    "name": "BFA Rehearsal & Performance V",
    "fullname": "BFA Rehearsal and Performance V",
    "info": "Acting, voice and movement. Continuing the application of process towards performance.\n\nprereq: BFA-acting sr",
    "prereq": {}
  },
  {
    "uid": "794841",
    "code": "TH4399",
    "subject": "TH",
    "number": "4399",
    "honors": false,
    "writing": false,
    "name": "BFA Rehearsal & Performance VI",
    "fullname": "BFA Rehearsal and Performance VI",
    "info": "Acting, voice, and movement. Continuing the application of process towards performance.\n\nprereq: BFA-acting sr",
    "prereq": {}
  },
  {
    "uid": "008395",
    "code": "TH4532",
    "subject": "TH",
    "number": "4532",
    "honors": false,
    "writing": false,
    "name": "Makeup for  Actor",
    "fullname": "Makeup for the Actor",
    "info": "Topics vary. May include functions/aesthetics of stage makeup, application techniques, prosthetics, and facial hair.",
    "prereq": {}
  },
  {
    "uid": "791178",
    "code": "TH4550",
    "subject": "TH",
    "number": "4550",
    "honors": false,
    "writing": false,
    "name": "Video Technology",
    "fullname": "Video Technology",
    "info": "Lighting, camera operation, audio, and recording for video/film production, using the state-of-the-art equipment in Studio B. Hands-on training in tools of video technology. Students create a final group project.",
    "prereq": {}
  },
  {
    "uid": "791145",
    "code": "TH4553",
    "subject": "TH",
    "number": "4553",
    "honors": false,
    "writing": false,
    "name": "Advanced Video Technology",
    "fullname": "Advanced Video Technology",
    "info": "Video production techniques. Lighting, camera operation, control room equipment/operation. Chroma and other types of keying. Hands-on training with equipment, techniques necessary for video production. Students are involved with every aspect behind camera and explore within their own projects.",
    "prereq": {}
  },
  {
    "uid": "791149",
    "code": "TH4554",
    "subject": "TH",
    "number": "4554",
    "honors": false,
    "writing": false,
    "name": "Graphics/Animation",
    "fullname": "Graphics and Animation for Video",
    "info": "Students explore and experiment with graphic/animation software. Video production, live performance.",
    "prereq": {}
  },
  {
    "uid": "008292",
    "code": "TH4555",
    "subject": "TH",
    "number": "4555",
    "honors": false,
    "writing": false,
    "name": "Audio Technology",
    "fullname": "Audio Technology",
    "info": "Sound as science. Technology to create/manipulate sound. Recording techniques. Effects/signal processing. Microphone/mixing techniques.\n\nprereq: 1501 or instr consent",
    "prereq": {
      "or": [
        "803321"
      ]
    }
  },
  {
    "uid": "008294",
    "code": "TH4556",
    "subject": "TH",
    "number": "4556",
    "honors": false,
    "writing": false,
    "name": "Projection Design",
    "fullname": "Projection Media Design, Creation, and Development",
    "info": "Focus of this course is to develop skills and explore creativity in designing and creating multimedia for use in projections for live performance. The course will address topics in the field including; communication and collaboration with the rest of the artistic team (director, choreographer, other designers); ways to incorporate the images into the production and supporting the action and storytelling on stage; use of software and other technologies for design and development; paperwork, organization and communication to bring everything to a successful conclusion. Projects will include designing with multimedia and working with software and technologies to develop individual and group presentations. This course is about development and will not get into the specifics of projectors, playback, projection surfaces, systems design and hook up. That will be covered in TH4558 Projection Technology, Design, Engineering, and installation.",
    "prereq": {}
  },
  {
    "uid": "791179",
    "code": "TH4557",
    "subject": "TH",
    "number": "4557",
    "honors": false,
    "writing": false,
    "name": "Audio for Film and Video",
    "fullname": "Audio for Film and Video",
    "info": "Processes/techniques used in capturing, manipulating, and producing audio for use in film/television production. Students experiment and create audio. Challenges in creating audio for various mediums.",
    "prereq": {}
  },
  {
    "uid": "793916",
    "code": "TH4560",
    "subject": "TH",
    "number": "4560",
    "honors": false,
    "writing": false,
    "name": "Pre-Production for Video/Film",
    "fullname": "Pre-Production and Planning for Video and Film",
    "info": "Forum for pre-planning video projects. Students undertake pre-production planning for a specific video project, including script development, scheduling, location scouting, casting, fund-raising, equipment lists/rentals, and permits.",
    "prereq": {}
  },
  {
    "uid": "788738",
    "code": "TH4711",
    "subject": "TH",
    "number": "4711",
    "honors": false,
    "writing": false,
    "name": "Intermediate Stage Direction",
    "fullname": "Intermediate Stage Direction",
    "info": "The goal of the class is to introduce you to the basic work and process of the stage director with particular focus on directing of non-realistic theatre and performance. We will be focusing on analysis, casting, rehearsing, and composing moments and performances working from written plays, non- theatrical material and personal story.\n\nThe class will invite you to take on the following:\n\n•\tThinking and conceptualizing like a director\n•\tUnderstanding analysis for non-realistic texts\n•\tStaging actions and events\n•\tHoning critical analysis of performances from directors point of view\n•\tAnalysis of dramatic text from the director’s point of view (and expressing it in writing)\n•\tRehearsing and working with actors\n•\tResearching and communicating with designers\n•\tConfronting the assumptions about what theatre is and choosing to keep or discard them",
    "prereq": {}
  },
  {
    "uid": "008264",
    "code": "TH4901",
    "subject": "TH",
    "number": "4901",
    "honors": false,
    "writing": false,
    "name": "Project Development",
    "fullname": "Project Exploration & Development",
    "info": "TH 4901 is the prerequisite course for the Senior Capstone Project required for graduation by the College of Liberal Arts. Students will propose, refine, and plan their Capstone project through a structured feedback process and in close dialogue with an assigned faculty mentor. Projects may be connected to creative collaborative production as long as they go above and beyond basic requirements for participation. Projects may take of the form of, but are not limited to: a research paper, an internship with an arts organization, creation of an original work – play, dance, lighting, set design, sound score, etc., advanced technical position on a production, grant writing, portfolio development and presentation, educational curriculum development, film, and/or software projects. \n\nA faculty adviser will serve as a resource in the proposal development stage, advise on the progress of the research and planning and evaluate its effectiveness and quality.  Ideally this course will serve as the planning phase for the “Capstone” college experience, bringing together several years of coursework and productions in theatre arts and dance in order to prepare you for life and work after departing the University of Minnesota",
    "prereq": {}
  },
  {
    "uid": "826508",
    "code": "TH4994",
    "subject": "TH",
    "number": "4994",
    "honors": false,
    "writing": false,
    "name": "Capstone Project for Theatre",
    "fullname": "Capstone Project for Theatre:  Directed Research & Creative Activities",
    "info": "Capstone Project is the culminating phase of the Capstone process required for graduation by the College of Liberal Arts yearlong.  Seniors execute and thoroughly document a sustained project of their own design over the course of a semester.  Projects may be connected to creative collaborative production as long as they go above and beyond basic requirements for participation. Projects may take of the form of, but are not limited to: a research paper, an internship with an arts organization, creation of an original work – play, dance, lighting, set design, sound score, etc., advanced technical position on a production, grant writing, portfolio development and presentation, educational curriculum development, film, and/or software projects. \n\nA faculty adviser will serve as a resource to advise on the progress of the project, and evaluate its effectiveness and quality (including the quality of reflections on risky, noble failures). Ideally this will serve as the “capstone” college experience bringing together several years of coursework and productions in theatre arts and dance, and preparing you for life and work after departing the University of Minnesota.",
    "prereq": {}
  },
  {
    "uid": "008265",
    "code": "TH5100",
    "subject": "TH",
    "number": "5100",
    "honors": false,
    "writing": false,
    "name": "Theatre Practicum",
    "fullname": "Theatre Practicum",
    "info": "Individual creative projects in production of approved plays as an actor, director, dramaturg, or playwright.  (See 5500 for design practicums.)\n\nprereq: instr consent, dept consent; 4 cr of 3100 for undergrads",
    "prereq": {
      "or": [
        "008251"
      ]
    }
  },
  {
    "uid": "008308",
    "code": "TH5103",
    "subject": "TH",
    "number": "5103",
    "honors": false,
    "writing": false,
    "name": "The Theatre Dramaturg",
    "fullname": "The Theatre Dramaturg",
    "info": "Theoretical/practical aspects of dramaturgy in American theater. Historical perspectives. Research/production history of classics. Development of new scripts. Dramaturgical structure and interpretive choices. Dramaturgy as it relates to playwrights/directors. Preparing/editing the rehearsal script. Production dramaturgy.",
    "prereq": {}
  },
  {
    "uid": "793777",
    "code": "TH5117",
    "subject": "TH",
    "number": "5117",
    "honors": false,
    "writing": false,
    "name": "Performance and Social Change",
    "fullname": "Performance and Social Change",
    "info": "Reading, writing, research, presentations and workshops explore activist performance projects. Theories of social formation and ideology provide framework to discuss/animate theater's potential for social change.\n\nprereq: Jr or sr or grad student",
    "prereq": {}
  },
  {
    "uid": "817550",
    "code": "TH5152W",
    "subject": "TH",
    "number": "5152",
    "honors": false,
    "writing": true,
    "name": "Global Avant-Gardes",
    "fullname": "Global Avant-Gardes: Theatre, Music, Modernity",
    "info": "What does it mean to be an avant-garde artist in the Global South? In postcolonial Africa and Asia, where arts were linked to national modernization projects, artists have played a key role in shaping citizens? identity, alongside schools and universities. While participating in modernizing projects, avant-garde artists maintained independence from state institutions and voiced criticism of dictators. This course examines avant-garde performance in several locations of the Global South, analyzing dramas of national history, modernist music, activist theater, cosmopolitan dance, transnational cultural circuits, and politically radical performances.\n\nReading historical, social, and performance studies, we will develop methods for analyzing performances that aim to make transformative social interventions. These include textual analysis, ethnography, performance analysis, and tracking transnational cultural exchange. You will apply select methods in your final research paper, which centers on an avant-gardist cultural phenomenon in the contemporary Global South.",
    "prereq": {}
  },
  {
    "uid": "008268",
    "code": "TH5171",
    "subject": "TH",
    "number": "5171",
    "honors": false,
    "writing": false,
    "name": "Theatre History I",
    "fullname": "History of the Theatre I",
    "info": "Theatre as a mirror of society.  Aesthetics, philosophy, and  practices of theatre arts. Ancient to mid-18th century. ",
    "prereq": {}
  },
  {
    "uid": "008336",
    "code": "TH5172",
    "subject": "TH",
    "number": "5172",
    "honors": false,
    "writing": false,
    "name": "Theatre History II",
    "fullname": "History of the Theatre II",
    "info": "Theatre as a mirror of society.  Aesthetics, philosophy, and practices of theatre arts. Mid-18th century to the present.",
    "prereq": {}
  },
  {
    "uid": "793917",
    "code": "TH5178",
    "subject": "TH",
    "number": "5178",
    "honors": false,
    "writing": false,
    "name": "Performance Conventions",
    "fullname": "History and Theory of Performance Conventions",
    "info": "Draws on visual materials, practical exercises, and theories of spatial representation in context of political/social function. Historical/cross-cultural overview of performance conventions and theatrical space from City of Dionysia to site-specific happenings of 20th century.",
    "prereq": {}
  },
  {
    "uid": "793918",
    "code": "TH5179W",
    "subject": "TH",
    "number": "5179",
    "honors": false,
    "writing": true,
    "name": "Text and Performance",
    "fullname": "Text and Performance",
    "info": "How to read texts toward performance in various dramatic/nondramatic material.  Method of unlocking metaphoric energy of texts. Vocabulary/techniques of analysis that transform text from page to stage.\n\nprereq: [1322, [3171 or 3172]] or grad student",
    "prereq": {
      "and": [
        "790525",
        {
          "or": [
            "008252",
            "008253"
          ]
        }
      ]
    }
  },
  {
    "uid": "008269",
    "code": "TH5181W",
    "subject": "TH",
    "number": "5181",
    "honors": false,
    "writing": true,
    "name": "Blacks in American Theatre",
    "fullname": "Blacks in American Theatre",
    "info": "Historical survey of significant events in the development of American black theatre traditions. Essays, plays, playwrights, and theatres from early colonial references to the Black Arts Movement.",
    "prereq": {}
  },
  {
    "uid": "008270",
    "code": "TH5182",
    "subject": "TH",
    "number": "5182",
    "honors": false,
    "writing": false,
    "name": "Contemp Black Th",
    "fullname": "Contemporary Black Theatre: 1960-Present",
    "info": "Essays, plays, playwrights, and theatres that have contributed to contemporary Black theatre.  From the beginning of the Black Arts Movement to the present.",
    "prereq": {}
  },
  {
    "uid": "810106",
    "code": "TH5182W",
    "subject": "TH",
    "number": "5182",
    "honors": false,
    "writing": true,
    "name": "Contemp Black Drama",
    "fullname": "Contemporary Black Drama and Dramaturgies",
    "info": "This course is an exploration of the impact and evolution of Black Theatre in America, covering the period rising from the Black Arts Movement to the present. The exploration will entail an understanding of cultural and socio-political issues as they are reflected in key and significant plays written and produced from the late 1950’s to the present. The plays and essays will be read against the background of significant cultural, social and literary movements - the Civil Rights Movement, Cold War politics, the Women’s Movement, Gay Liberation, the Culture Wars, post-modernism, deconstruction, multiculturalism, afro-futurism, etc. as well as the evolution of identity nomenclature and racial classification from Colored to Negro to Black to African American. In addition to play analysis and criticism, students will garner a knowledge of significant Black cultural institutions and their impact on the ever-changing American theatre landscape.",
    "prereq": {}
  },
  {
    "uid": "807138",
    "code": "TH5183",
    "subject": "TH",
    "number": "5183",
    "honors": false,
    "writing": false,
    "name": "Crit Lit, Storytelling, Drama",
    "fullname": "Critical Literacy, Storytelling, and Creative Drama",
    "info": "This course examines and embodies how storytelling and creative drama can be used as tools to help develop students' critical literacy and to assist them in becoming more fluent readers and writers. Critical literacy is the focus; theater and storytelling are the vehicles. Key topics to be covered include: 1) A historical background on fairy and folk tales, legends, fables, myths, and the different oral traditions; 2) Tools for developing a critical view of diverse tales; 3) Practical instruction on how to use storytelling and story genres in the classroom to develop critical literacy; and 4) Assessing storytelling work in the classroom. Students will meet in the first week at the University to learn tools of the Neighborhood Bridges program and in the second week will practice and observe each other's teaching with local school classrooms. In the past we have worked with 4th graders and 6th graders, though we will also discuss how course content applies to high school students. The class meets for two intensive weeks in person, however, we additionally assign pre-readings and post-class reflections and papers.",
    "prereq": {}
  },
  {
    "uid": "008271",
    "code": "TH5310",
    "subject": "TH",
    "number": "5310",
    "honors": false,
    "writing": false,
    "name": "MFA Actors Studio",
    "fullname": "MFA Actors Studio",
    "info": "Application of elements of performance, including research, creative thinking, and rhearsal.",
    "prereq": {}
  },
  {
    "uid": "803016",
    "code": "TH5330",
    "subject": "TH",
    "number": "5330",
    "honors": false,
    "writing": false,
    "name": "Comedy: Physical",
    "fullname": "Comedy: Advanced Physical Performance Studio",
    "info": "Mechanics of creating physical comedy. Focuses on process using clown, Comedia dell'arte, Bouffons, or improvisational comedy. Exercises on how comedy is born from tragedy and state of conflict within one's self.\n\nprereq: 3330, audition",
    "prereq": {
      "and": [
        "791175"
      ]
    }
  },
  {
    "uid": "008274",
    "code": "TH5331",
    "subject": "TH",
    "number": "5331",
    "honors": false,
    "writing": false,
    "name": "Physical App/Acting",
    "fullname": "Physical Approaches to Acting: Use of Self",
    "info": "Movement for advanced actors:  awareness, flexibility,  observation, release, improvisation in both verbal and nonverbal physical modes.",
    "prereq": {}
  },
  {
    "uid": "008275",
    "code": "TH5332",
    "subject": "TH",
    "number": "5332",
    "honors": false,
    "writing": false,
    "name": "Stage Combat",
    "fullname": "Physical Approaches to Acting: Stage Combat",
    "info": "Movement for advanced actors:  awareness, flexibility, observation, release, improvisation in both verbal and nonverbal physical modes; focus on stage combat.",
    "prereq": {}
  },
  {
    "uid": "008276",
    "code": "TH5333",
    "subject": "TH",
    "number": "5333",
    "honors": false,
    "writing": false,
    "name": "Period Styles",
    "fullname": "Physical Approaches to Acting: Period Styles",
    "info": "Movement for advanced actors:  awareness, flexibility, observation, release, improvisation in both verbal and nonverbal physical modes; focus on period styles of movement.",
    "prereq": {}
  },
  {
    "uid": "008277",
    "code": "TH5334",
    "subject": "TH",
    "number": "5334",
    "honors": false,
    "writing": false,
    "name": "Mask",
    "fullname": "Physical Approaches to Acting: Mask",
    "info": "Movement for advanced actors:  awareness, flexibility, observation, release, improvisation in both verbal and nonverbal physical modes; focus on mask work.",
    "prereq": {}
  },
  {
    "uid": "803150",
    "code": "TH5340",
    "subject": "TH",
    "number": "5340",
    "honors": false,
    "writing": false,
    "name": "Adv Acting: Tragedy/Poetry",
    "fullname": "Advanced Acting Studio:  Tragedy/Poetry",
    "info": "Specific training paradigms in actor training employed by Stanislavski, Grotowski, Brecht, Lecoq, etc. Psychological, emotional, technical, and physical work. Tragic action in Greek tragedy, Shakespeare, Melodrama, operatic characterization, Brecht. Original tragic/poetical work for embodying dramatic text effectively.\n\n",
    "prereq": {}
  },
  {
    "uid": "008278",
    "code": "TH5341",
    "subject": "TH",
    "number": "5341",
    "honors": false,
    "writing": false,
    "name": "Speech for Actors",
    "fullname": "Speech for Actors",
    "info": "Theories of professional voice production, anatomy and physiology of the vocal mechanism and respiratory system, phonetics, tonal placement, vowel standardization, and articulation are applied to dramatic texts.",
    "prereq": {}
  },
  {
    "uid": "008279",
    "code": "TH5342",
    "subject": "TH",
    "number": "5342",
    "honors": false,
    "writing": false,
    "name": "Classical Text",
    "fullname": "Classical Text for Actors",
    "info": "Metrical and rhetorical techniques used in the dramatic texts of Shakespeare and Shaw, as well as textual performance styles from Elizabethan to contemporary. Discussion, presentation, oral reports, and performances.",
    "prereq": {}
  },
  {
    "uid": "791176",
    "code": "TH5355",
    "subject": "TH",
    "number": "5355",
    "honors": false,
    "writing": false,
    "name": "Puppetry in Theatre",
    "fullname": "Puppetry: Techniques and Practice in Contemporary Theater",
    "info": "Fundamentals of puppet and object theater/performance are introduced through traditional/contemporary puppetry forms. Focuses on object theater, toy theater, hand puppets, and shadow/Bunraku-style puppets. Readings, in-class screenings of videos/slides. Students build/create series of short works for in-class performance.\n\nprereq: [[3513 or concurrent registration is required (or allowed) in 3513], instr consent] or grad student",
    "prereq": {
      "or": [
        "008256"
      ]
    }
  },
  {
    "uid": "810886",
    "code": "TH5370",
    "subject": "TH",
    "number": "5370",
    "honors": false,
    "writing": false,
    "name": "Hand, Mind and Gesture",
    "fullname": "Hand, Mind, and Gesture:  An Independent Study in the Creation of Image Driven Performance",
    "info": "Create single or collaborative performance/event that lives in time/space. Work will draw from personal investigation, amplify personal signature, explore modalities of image driven forms. Propose, develop, construct, rehearse, present finished public performance.\n\nprereq: 5355, instr consent",
    "prereq": {
      "and": [
        "791176"
      ]
    }
  },
  {
    "uid": "796200",
    "code": "TH5394",
    "subject": "TH",
    "number": "5394",
    "honors": false,
    "writing": false,
    "name": "BFA Acting VII",
    "fullname": "BFA Acting VII",
    "info": "Applying first three years of training toward performance. Seventh in sequence of eight.",
    "prereq": {}
  },
  {
    "uid": "796201",
    "code": "TH5395",
    "subject": "TH",
    "number": "5395",
    "honors": false,
    "writing": false,
    "name": "BFA Acting VII",
    "fullname": "BFA Acting VII",
    "info": "Applying first three years of training toward performance. Seventh in sequence of eight.",
    "prereq": {}
  },
  {
    "uid": "796202",
    "code": "TH5396",
    "subject": "TH",
    "number": "5396",
    "honors": false,
    "writing": false,
    "name": "BFA Acting VIII",
    "fullname": "BFA Acting VIII",
    "info": "Application of first three years of training toward performance. Career preparation. Eighth in sequence of eight.",
    "prereq": {}
  },
  {
    "uid": "796203",
    "code": "TH5397",
    "subject": "TH",
    "number": "5397",
    "honors": false,
    "writing": false,
    "name": "BFA Acting VIII",
    "fullname": "BFA Acting VIII",
    "info": "Application of first three years of training toward performance. Career preparation. Eighth in sequence of eight.",
    "prereq": {}
  },
  {
    "uid": "796204",
    "code": "TH5398",
    "subject": "TH",
    "number": "5398",
    "honors": false,
    "writing": false,
    "name": "BFA Acting VIII",
    "fullname": "BFA Acting VIII",
    "info": "Application of first three years of training toward performance. Career preparation. Eighth in sequence of eight.",
    "prereq": {}
  },
  {
    "uid": "008281",
    "code": "TH5500",
    "subject": "TH",
    "number": "5500",
    "honors": false,
    "writing": false,
    "name": "Design Practicum",
    "fullname": "Theatre Design Practicum",
    "info": "Individual projects in production of approved plays as a designer of scenery/properties, costumes, lighting, or sound.  (See 5100 for other creative practicums.)\n\nprereq: Th 3521, 3531, or 3541",
    "prereq": {
      "or": [
        "803536",
        "805379",
        "806411"
      ]
    }
  },
  {
    "uid": "826110",
    "code": "TH5505",
    "subject": "TH",
    "number": "5505",
    "honors": false,
    "writing": false,
    "name": "History of Stage Design",
    "fullname": "History of Stage Design",
    "info": "This class is intended to provide an in-depth understanding of the origins and development of all design elements common to the western theatrical tradition. The focus of this course is the history of design for live performance, with an emphasis on Europe and the United States. The course will address topics including theater architecture, scenic and costume design from ancient Greece to the late 19th Century.  From there begins an in-depth exploration of 20th Century disciplines and designers, including lighting, audio and media design and technology. Students will be expected to extensively research a minimum of two notable stage designers and/or design movements from the late 19th, 20th and/or early 21st Century.",
    "prereq": {}
  },
  {
    "uid": "008282",
    "code": "TH5510",
    "subject": "TH",
    "number": "5510",
    "honors": false,
    "writing": false,
    "name": "Drwg/Rndrg/Ptg I",
    "fullname": "Drawing, Rendering, and Painting for the Theatre Designer I",
    "info": "Development of skills necessary for presentation of theatre scene/costume designs. Materials, layout, and techniques in scene painting. Basic drawing/graphic skills.\n\nprereq: 1501 or grad",
    "prereq": {
      "or": [
        "803321"
      ]
    }
  },
  {
    "uid": "008284",
    "code": "TH5515",
    "subject": "TH",
    "number": "5515",
    "honors": false,
    "writing": false,
    "name": "Design Comp/Collab",
    "fullname": "Design Composition and Collaboration",
    "info": "Classical composition of art and its application to stage design and directing through the collaborative process. \n",
    "prereq": {}
  },
  {
    "uid": "008285",
    "code": "TH5520",
    "subject": "TH",
    "number": "5520",
    "honors": false,
    "writing": false,
    "name": "Scene Design",
    "fullname": "Scene Design",
    "info": "Conceiving/communicating design ideas in both two-dimensional sketches and three-dimensional models for theatre and allied venues. Drafting.\n\nprereq: 3521",
    "prereq": {
      "and": [
        "803536"
      ]
    }
  },
  {
    "uid": "008286",
    "code": "TH5530",
    "subject": "TH",
    "number": "5530",
    "honors": false,
    "writing": false,
    "name": "Costume Design",
    "fullname": "Costume Design",
    "info": "Theory and process of costume design for theatrical productions (e.g., dance, opera, film) through hypothetical productions.\n\nprereq: 3531",
    "prereq": {
      "and": [
        "805379"
      ]
    }
  },
  {
    "uid": "008287",
    "code": "TH5540",
    "subject": "TH",
    "number": "5540",
    "honors": false,
    "writing": false,
    "name": "Lighting Design",
    "fullname": "Lighting Design for the Theatre",
    "info": "Design aesthetics and exploration of design for various stage forms and venues. Development of the lighting plot and paperwork; use of the computer in lighting design.\n\nprereq: 3541",
    "prereq": {
      "and": [
        "806411"
      ]
    }
  },
  {
    "uid": "008291",
    "code": "TH5545",
    "subject": "TH",
    "number": "5545",
    "honors": false,
    "writing": false,
    "name": "Lighting Technology",
    "fullname": "Stage Lighting Technology",
    "info": "The lighting technician's skills and crafts: equipment, techniques, control operation, wiring, and maintenance.\n\nprereq: 3515 or grad or instr consent",
    "prereq": {
      "or": [
        "008257"
      ]
    }
  },
  {
    "uid": "795492",
    "code": "TH5550",
    "subject": "TH",
    "number": "5550",
    "honors": false,
    "writing": false,
    "name": "Video Project",
    "fullname": "Video Project",
    "info": "Students participate in a video-shoot project serving in various positions, including camera operator, gaffer, grip, audio engineer, cast, and possibly director and director of photography.",
    "prereq": {}
  },
  {
    "uid": "791180",
    "code": "TH5551",
    "subject": "TH",
    "number": "5551",
    "honors": false,
    "writing": false,
    "name": "Video Post Production",
    "fullname": "Editing and Post Production for Video and Film",
    "info": "Students manipulate software and other technologies used in post production. Editing, audio, image manipulation.",
    "prereq": {}
  },
  {
    "uid": "791181",
    "code": "TH5553",
    "subject": "TH",
    "number": "5553",
    "honors": false,
    "writing": false,
    "name": "Video Design and Aesthetics",
    "fullname": "Video Production Design and Aesthetics",
    "info": "Use of technologies in video/film in making a statement or communicating an idea/emotion. Creativity, sensitivity to an audience. Students explore different creative uses of technologies/medium.",
    "prereq": {}
  },
  {
    "uid": "791182",
    "code": "TH5554",
    "subject": "TH",
    "number": "5554",
    "honors": false,
    "writing": false,
    "name": "Multimedia Production",
    "fullname": "Multimedia Production for Live Performance",
    "info": "Use of multimedia production technologies in actual production. Students apply knowledge/skill in conjunction with an artistic team on a production and are an integral part of the development/realization of that production.\n\nprereq: 5553 or instr consent",
    "prereq": {
      "or": [
        "791181"
      ]
    }
  },
  {
    "uid": "791183",
    "code": "TH5556",
    "subject": "TH",
    "number": "5556",
    "honors": false,
    "writing": false,
    "name": "Audio Engineering",
    "fullname": "Audio Engineering",
    "info": "Miking/recording techniques specific to music/dramatic dialogue. Recording different styles of music. Hands-on recording of bands, doing final mixes to demo CD. Field trips to professional studios and club/concert recordings.\n\nprereq: 4555, instr consent",
    "prereq": {
      "and": [
        "008292"
      ]
    }
  },
  {
    "uid": "791184",
    "code": "TH5558",
    "subject": "TH",
    "number": "5558",
    "honors": false,
    "writing": false,
    "name": "Audio Systems",
    "fullname": "Audio Systems Analysis and Installation",
    "info": "Analyzing, designing, developing specifications, and installing sound systems. Students work from client program lists, with given resources and given spaces, to arrive at best possible audio system. Hands-on experience.",
    "prereq": {}
  },
  {
    "uid": "008288",
    "code": "TH5559",
    "subject": "TH",
    "number": "5559",
    "honors": false,
    "writing": false,
    "name": "Sound Design",
    "fullname": "Sound Design for Performance",
    "info": "Audio technology/psychology, their impact on audience in a performance. Communication, design process, psychoacoustics, script analysis.\n\nprereq: 4555 or instr consent",
    "prereq": {
      "or": [
        "008292"
      ]
    }
  },
  {
    "uid": "008283",
    "code": "TH5560",
    "subject": "TH",
    "number": "5560",
    "honors": false,
    "writing": false,
    "name": "Drwg/Rndrg/Ptg II",
    "fullname": "Drawing, Rendering, and Painting for the Theatre Designer II",
    "info": "Development of skills necessary for presentation of theatre scene/costume designs. Materials, layout, and techniques in scene painting. Rendering and scene painting skills.\n\nprereq: 5510",
    "prereq": {
      "and": [
        "008282"
      ]
    }
  },
  {
    "uid": "008290",
    "code": "TH5570",
    "subject": "TH",
    "number": "5570",
    "honors": false,
    "writing": false,
    "name": "Props/Sc Technology",
    "fullname": "Properties/Scenery Technology",
    "info": "Management, structures, upholstery, mask-making, furniture construction, stage mechanics, soft properties, faux finishes. Topics specified in Class Schedule.\n\nprereq: 3515 or grad or instr consent",
    "prereq": {
      "or": [
        "008257"
      ]
    }
  },
  {
    "uid": "008289",
    "code": "TH5580",
    "subject": "TH",
    "number": "5580",
    "honors": false,
    "writing": false,
    "name": "Costume Technology",
    "fullname": "Costume Technology",
    "info": "Fabric enhancement techniques, masks, wig-making, millinery, makeup prosthetics, pattern drafting, and draping. Topics specified in Class Schedule.\n\nprereq: 3571 or grad or instr consent",
    "prereq": {
      "or": [
        "803322"
      ]
    }
  },
  {
    "uid": "008295",
    "code": "TH5590",
    "subject": "TH",
    "number": "5590",
    "honors": false,
    "writing": false,
    "name": "Tech Practicum",
    "fullname": "Theatre Technology Practicum",
    "info": "Individual creative project in technology/craft area of theatre. Practical work in costume, lighting, makeup, props, scenery, sound, or theatre management.\n\nprereq: 3515, instr consent, dept consent;  4 cr max for undergrads",
    "prereq": {
      "or": [
        "008257"
      ]
    }
  },
  {
    "uid": "008296",
    "code": "TH5711",
    "subject": "TH",
    "number": "5711",
    "honors": false,
    "writing": false,
    "name": "Advanced Stage Direction",
    "fullname": "Advanced Stage Direction",
    "info": "Realistic/non-realistic dramatic forms.  Theory/technique of rehearsal.  Production problems.  Includes directing  of three one-act plays.\n\nprereq: [4711, instr consent] or grad student",
    "prereq": {
      "and": [
        "788738"
      ]
    }
  },
  {
    "uid": "790577",
    "code": "TH5713",
    "subject": "TH",
    "number": "5713",
    "honors": false,
    "writing": false,
    "name": "Performance Theory & Practice",
    "fullname": "Theory and Practice of Performance",
    "info": "Traditions of thinking about theatre, from ancient Greece to present, in practical applications. Focuses on epistemological significance of performance in current critical practices of postmodernism, psychoanalysis, and phenomenology.",
    "prereq": {}
  },
  {
    "uid": "791185",
    "code": "TH5714",
    "subject": "TH",
    "number": "5714",
    "honors": false,
    "writing": false,
    "name": "The Drama of Myth",
    "fullname": "The Drama of Myth",
    "info": "Role of myth in performance. Students choose a myth and study its iconography, tracing its journey in painting, sculpture, music, and other texts that accumulated around it throughout history. Course culminates in creation of a non-traditional performance score that embodies/reveals energies of contemporary culture within ancient metaphor of a chosen myth.",
    "prereq": {}
  },
  {
    "uid": "008298",
    "code": "TH5715",
    "subject": "TH",
    "number": "5715",
    "honors": false,
    "writing": false,
    "name": "Act/Dir Collab",
    "fullname": "Actor-Director Collaboration",
    "info": "Applying advanced acting and directing technique to an artistic, collaborative process that promotes flexibility and creativity. Actors and directors are exposed to a challenging range of roles, styles, and scenes.",
    "prereq": {}
  },
  {
    "uid": "008299",
    "code": "TH5716",
    "subject": "TH",
    "number": "5716",
    "honors": false,
    "writing": false,
    "name": "Stage Management",
    "fullname": "Stage Management for the Theatre",
    "info": "Theories, practicalities, and techniques for rehearsal/performance.  Organizing/managing various types of performance venues.\n\nprereq: [1101, 1321, soph] or grad",
    "prereq": {
      "and": [
        "002093",
        "008249"
      ]
    }
  },
  {
    "uid": "008300",
    "code": "TH5718",
    "subject": "TH",
    "number": "5718",
    "honors": false,
    "writing": false,
    "name": "Arts Management",
    "fullname": "Principles of Arts Management",
    "info": "This course will introduce students to the practical skills required for the successful management of arts organizations. Areas covered will include marketing/publicity, fundraising, audience development, board governance, and issues associated with the founding of a nonprofit arts organization. Each class we will engage in discussion relating to articles shared by the instructor. You will participate in group and solo projects aimed to hone your skills in various areas of management. Additionally, students will engage in discussions with a number of professionals in the field of arts administration, and discover advanced concepts applied by arts administrators.",
    "prereq": {}
  },
  {
    "uid": "791542",
    "code": "TH5725",
    "subject": "TH",
    "number": "5725",
    "honors": false,
    "writing": false,
    "name": "The Alchemy of an Object",
    "fullname": "The Alchemy of an Object",
    "info": "Stage object as vehicle for investigating role of drama in culture from Middle Ages to present. Object as first connection that dramatic text makes with material world. Object as culturally inscribed link between language of drama and world of action in a historically given moment. Object as metaphor of cultural praxis.",
    "prereq": {}
  },
  {
    "uid": "008301",
    "code": "TH5753",
    "subject": "TH",
    "number": "5753",
    "honors": false,
    "writing": false,
    "name": "Text Analysis",
    "fullname": "Text Analysis for Drama",
    "info": "Tools for intensive textual analysis for advanced directors/designers. Traditional, Aristotelian analysis and contemporary approaches covered through theories/writings of Bertolt Brecht and Howard Barker.\n",
    "prereq": {}
  },
  {
    "uid": "008302",
    "code": "TH5760",
    "subject": "TH",
    "number": "5760",
    "honors": false,
    "writing": false,
    "name": "Stage Management Practicum",
    "fullname": "Stage Management Practicum",
    "info": "This course is designed as an opportunity for students with prior experience on a stage management team to gain hands-on, practical experience and continue to hone their skills through participation on a stage management team of a Main Stage production. Students in this course will serve as Stage Manager or Assistant Stage Manager and while doing so will actively participate in all aspects of the production process collaborating with the production team and student actors to mount a fully produced production to a paying audience. This course allows students to refine communication, organization, and leadership skills. Students will also meet weekly with their faculty mentor who will help to guide them as they build upon skills gained in TH3716 Stage Management and TH3760.",
    "prereq": {}
  },
  {
    "uid": "008303",
    "code": "TH5780",
    "subject": "TH",
    "number": "5780",
    "honors": false,
    "writing": false,
    "name": "Adv Topics: Arts Mgmt",
    "fullname": "Advanced Topics in Arts Management",
    "info": "Students apply non-profit arts management theories/techniques learned in 5718. Marketing/audience development, fundraising and grant writing strategies, and financial management of a nonprofit arts organization.",
    "prereq": {}
  },
  {
    "uid": "008304",
    "code": "TH5950",
    "subject": "TH",
    "number": "5950",
    "honors": false,
    "writing": false,
    "name": "Topics in Theatre",
    "fullname": "Topics in Theatre",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "008305",
    "code": "TH5993",
    "subject": "TH",
    "number": "5993",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Guided individual reading or study.\nPrereq 6 Th cr, instr consent, dept consent, college consent.",
    "prereq": {}
  },
  {
    "uid": "008306",
    "code": "TH8100",
    "subject": "TH",
    "number": "8100",
    "honors": false,
    "writing": false,
    "name": "Theatre Practicum",
    "fullname": "Theatre Practicum",
    "info": "Individual creative projects in production of approved plays as an actor, director, dramaturg, or playwright (see 8500 for design practicums).\n\nprereq: instr consent, dept consent",
    "prereq": {}
  },
  {
    "uid": "008307",
    "code": "TH8102",
    "subject": "TH",
    "number": "8102",
    "honors": false,
    "writing": false,
    "name": "Thr Historiography",
    "fullname": "Theatre Historiography",
    "info": "Current trends in historiography; research strategies and methods.\n",
    "prereq": {}
  },
  {
    "uid": "008309",
    "code": "TH8111",
    "subject": "TH",
    "number": "8111",
    "honors": false,
    "writing": false,
    "name": "History/Theory I",
    "fullname": "History and Theory of Western Theatre: Ancient World and Early Medieval",
    "info": "History, theories, arts, and crafts of western theatre from the ancient world to the present.",
    "prereq": {}
  },
  {
    "uid": "008310",
    "code": "TH8112",
    "subject": "TH",
    "number": "8112",
    "honors": false,
    "writing": false,
    "name": "History/Theory II",
    "fullname": "History and Theory of Western Theatre:  Medieval Through Renaissance",
    "info": "History, theories, arts, and crafts of western theatre from the ancient world to the present.",
    "prereq": {}
  },
  {
    "uid": "008311",
    "code": "TH8113",
    "subject": "TH",
    "number": "8113",
    "honors": false,
    "writing": false,
    "name": "History/Theory III",
    "fullname": "History and Theory of Western Theatre:  National Theatres to the French Revolution",
    "info": "History, theories, arts, and crafts of western theatre from the ancient world to the present.",
    "prereq": {}
  },
  {
    "uid": "008312",
    "code": "TH8114",
    "subject": "TH",
    "number": "8114",
    "honors": false,
    "writing": false,
    "name": "Performance & Pol Modernity",
    "fullname": "Theatre: Performance and Political Modernity",
    "info": "History, theories, arts, and crafts of western theatre from the ancient world to the present.",
    "prereq": {}
  },
  {
    "uid": "008313",
    "code": "TH8115",
    "subject": "TH",
    "number": "8115",
    "honors": false,
    "writing": false,
    "name": "History/Theory V",
    "fullname": "History and Theory of Western Theatre: 20th Century Through World War II",
    "info": "History, theories, arts, and crafts of western theatre from the ancient world to the present.",
    "prereq": {}
  },
  {
    "uid": "008314",
    "code": "TH8116",
    "subject": "TH",
    "number": "8116",
    "honors": false,
    "writing": false,
    "name": "History/Theory VI",
    "fullname": "History and Theory of Western Theatre: 20th Century From 1945 to the Present",
    "info": "History, theories, arts, and crafts of western theatre from the ancient world to the present.",
    "prereq": {}
  },
  {
    "uid": "008315",
    "code": "TH8120",
    "subject": "TH",
    "number": "8120",
    "honors": false,
    "writing": false,
    "name": "Seminar in Theatre",
    "fullname": "Seminar",
    "info": "Selected research topics from various theatre fields and periods. Sample topics: Border Crossings--Theatre History and Representation; The Theatre and Drama of the Third Reich, 1927-1944.",
    "prereq": {}
  },
  {
    "uid": "008316",
    "code": "TH8321",
    "subject": "TH",
    "number": "8321",
    "honors": false,
    "writing": false,
    "name": "MFA Acting I",
    "fullname": "MFA Acting I",
    "info": "Advanced acting technique and theory. Eclectic approach emphasizing Stanislavski-based vocabulary. Improvisation and prepared exercises as preparation for text-based work.",
    "prereq": {}
  },
  {
    "uid": "008317",
    "code": "TH8322",
    "subject": "TH",
    "number": "8322",
    "honors": false,
    "writing": false,
    "name": "MFA Acting II",
    "fullname": "MFA Acting II",
    "info": "Continuation of 8321. Advanced acting technique and theory. Eclectic approach emphasizing Stanislavski-based vocabulary. Prepared exercises and scenes from plays.",
    "prereq": {}
  },
  {
    "uid": "008318",
    "code": "TH8323",
    "subject": "TH",
    "number": "8323",
    "honors": false,
    "writing": false,
    "name": "MFA Acting III",
    "fullname": "MFA Acting III",
    "info": "Advanced techniques for performing classical texts with increasingly extended vocal and physical demands using Shakespearean scenes and monologues.",
    "prereq": {}
  },
  {
    "uid": "008319",
    "code": "TH8324",
    "subject": "TH",
    "number": "8324",
    "honors": false,
    "writing": false,
    "name": "MFA Acting IV",
    "fullname": "MFA Acting IV",
    "info": "Advanced techniques for performing contemporary texts with increasingly extended vocal and physical demands using modern and postmodern scenes and monologues.",
    "prereq": {}
  },
  {
    "uid": "008320",
    "code": "TH8325",
    "subject": "TH",
    "number": "8325",
    "honors": false,
    "writing": false,
    "name": "MFA Showcase Prep",
    "fullname": "MFA Showcase Preparation",
    "info": "Research, preparation, and rehearsal for the MFA actor's final creative project.",
    "prereq": {}
  },
  {
    "uid": "008321",
    "code": "TH8326",
    "subject": "TH",
    "number": "8326",
    "honors": false,
    "writing": false,
    "name": "MFA Showcase",
    "fullname": "MFA Showcase",
    "info": "Research, rehearsal, production, promotion, and performance of the MFA actor's final creative project.",
    "prereq": {}
  },
  {
    "uid": "008322",
    "code": "TH8330",
    "subject": "TH",
    "number": "8330",
    "honors": false,
    "writing": false,
    "name": "Alexander Technique",
    "fullname": "Alexander Technique for the MFA Actor",
    "info": "Principles for improving performance; developing body/mind awareness, ease of movement, and range of physical/emotional expression. Group and individual work.",
    "prereq": {}
  },
  {
    "uid": "788285",
    "code": "TH8333",
    "subject": "TH",
    "number": "8333",
    "honors": false,
    "writing": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)\n\nprereq: Master's student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "008323",
    "code": "TH8341",
    "subject": "TH",
    "number": "8341",
    "honors": false,
    "writing": false,
    "name": "MFA Vocal Prod I",
    "fullname": "MFA Vocal Production I",
    "info": "Using voice for the stage; fundamentals of body awareness, breath and support, resonance.",
    "prereq": {}
  },
  {
    "uid": "008327",
    "code": "TH8342",
    "subject": "TH",
    "number": "8342",
    "honors": false,
    "writing": false,
    "name": "MFA Dialects I",
    "fullname": "MFA Dialects I",
    "info": "Skills and resources for learning stage dialects.",
    "prereq": {}
  },
  {
    "uid": "008324",
    "code": "TH8343",
    "subject": "TH",
    "number": "8343",
    "honors": false,
    "writing": false,
    "name": "MFA Vocal Prod II",
    "fullname": "MFA Vocal Production II",
    "info": "Using voice for the stage; pitch, rate, volume; application to poetic texts.",
    "prereq": {}
  },
  {
    "uid": "008328",
    "code": "TH8344",
    "subject": "TH",
    "number": "8344",
    "honors": false,
    "writing": false,
    "name": "MFA Dialects II",
    "fullname": "MFA Dialects II",
    "info": "Skills and resources for learning stage dialects.",
    "prereq": {}
  },
  {
    "uid": "008325",
    "code": "TH8345",
    "subject": "TH",
    "number": "8345",
    "honors": false,
    "writing": false,
    "name": "MFA Vocal Prod III",
    "fullname": "MFA Vocal Production III",
    "info": "For the third-year MFA actor.",
    "prereq": {}
  },
  {
    "uid": "008326",
    "code": "TH8346",
    "subject": "TH",
    "number": "8346",
    "honors": false,
    "writing": false,
    "name": "MFA Vocal Prod IV",
    "fullname": "MFA Vocal Production IV",
    "info": "For the third-year MFA actor.",
    "prereq": {}
  },
  {
    "uid": "788419",
    "code": "TH8444",
    "subject": "TH",
    "number": "8444",
    "honors": false,
    "writing": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)\n\nprereq: Doctoral student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "008329",
    "code": "TH8500",
    "subject": "TH",
    "number": "8500",
    "honors": false,
    "writing": false,
    "name": "Design Practicum",
    "fullname": "Theatre Design Practicum",
    "info": "Individual creative projects in production of approved plays as a designer for scenery/properties, costumes, lighting, or sound (see 8100 for other creative practicums).\n\nprereq: instr consent, dept consent",
    "prereq": {}
  },
  {
    "uid": "810920",
    "code": "TH8510",
    "subject": "TH",
    "number": "8510",
    "honors": false,
    "writing": false,
    "name": "Professional Design Workshop",
    "fullname": "Professional Design Workshop",
    "info": "Development of graduate student as individual artist working collaboratively in performing arts industry. Further mastery of designer collaboration, self-promotion, management, displaying of job materials. Attend both professional/university productions throughout semester.\n\nprereq: MFA candidate",
    "prereq": {}
  },
  {
    "uid": "008330",
    "code": "TH8590",
    "subject": "TH",
    "number": "8590",
    "honors": false,
    "writing": false,
    "name": "Tech Practicum",
    "fullname": "Theatre Technology Practicum",
    "info": "Individual creative projects in the technology or craft of costume, lighting, makeup, props, scenery, sound, or theatre management.\n\nprereq: instr consent, dept consent",
    "prereq": {}
  },
  {
    "uid": "788540",
    "code": "TH8666",
    "subject": "TH",
    "number": "8666",
    "honors": false,
    "writing": false,
    "name": "Doct Pre-Thesis Cr*",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "tbd\n\nprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": {}
  },
  {
    "uid": "008332",
    "code": "TH8711",
    "subject": "TH",
    "number": "8711",
    "honors": false,
    "writing": false,
    "name": "Directing Theory",
    "fullname": "Theory and Practice of the Modern Stage Director",
    "info": "Survey of principal stage directors (e.g., Saxe-Meiningen, Meyerhold, Brecht, Strehler, Mnouchkine, Brook) and their theories and practices from 1871 to today using books, journals, firsthand accounts, and videos. ",
    "prereq": {}
  },
  {
    "uid": "008333",
    "code": "TH8750",
    "subject": "TH",
    "number": "8750",
    "honors": false,
    "writing": false,
    "name": "MFA Directing Prac",
    "fullname": "MFA Directing Practicum",
    "info": "Rehearsed and performed production of published or original one-act (2 cr) or full-length play (3 cr) with budgeted design and technical support.\n\nprereq: MFA directing specialization",
    "prereq": {}
  },
  {
    "uid": "788669",
    "code": "TH8777",
    "subject": "TH",
    "number": "8777",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": {}
  },
  {
    "uid": "787940",
    "code": "TH8888",
    "subject": "TH",
    "number": "8888",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": {}
  },
  {
    "uid": "791543",
    "code": "TH8950",
    "subject": "TH",
    "number": "8950",
    "honors": false,
    "writing": false,
    "name": "Topics in Theatre",
    "fullname": "Topics in Theatre",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "008334",
    "code": "TH8980",
    "subject": "TH",
    "number": "8980",
    "honors": false,
    "writing": false,
    "name": "Internship",
    "fullname": "Internship",
    "info": "tbd\n\nprereq: instr consent, dept consent",
    "prereq": {}
  },
  {
    "uid": "008331",
    "code": "TH8990",
    "subject": "TH",
    "number": "8990",
    "honors": false,
    "writing": false,
    "name": "MFA Creative Thesis",
    "fullname": "MFA Creative Thesis",
    "info": "tbd\n\nprereq: instr consent, dept consent",
    "prereq": {}
  },
  {
    "uid": "008335",
    "code": "TH8994",
    "subject": "TH",
    "number": "8994",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "tbd\n\nprereq: instr consent, dept consent",
    "prereq": {}
  }
]