[
  {
    "uid": "002604",
    "code": "WRIT1001",
    "subject": "WRIT",
    "number": "1001",
    "honors": false,
    "writing": false,
    "name": "Intro to Tech Writing & Comm",
    "fullname": "The Art of Explaining Things: Introduction to Technical Writing and Communication",
    "info": "This course introduces students to the field of technical writing and communication. What do technical communicators do? They explain things!\u2029 Technical communicators are often tasked with explaining complex ideas to specific audiences through various means.\u2029 Students will explore the history and current and future trends of the field through a variety of readings including journal articles and industry publications. Topics in the course include ethics, global communication, collaboration, usability, digital writing technologies, and content management, as well as the rhetorical principles of audience, purpose, and context. Students will gain exposure to current practices in the field through guest speakers and assignments. Other assignments include oral presentations, analytical and research writing, and writing for the web. The format of the class includes lecture, student-led discussions, group activities, and peer review.",
    "prereq": {}
  },
  {
    "uid": "003177",
    "code": "WRIT1011",
    "subject": "WRIT",
    "number": "1011",
    "honors": false,
    "writing": false,
    "name": "Univ Writing Crit R",
    "fullname": "University Writing and Critical Reading",
    "info": "Critical reading/interpretation of selected texts. Research in various types of resources. Writing through several drafting steps. Finished writing is revised/edited to meet university-level standards of persuasiveness, precision, and correctness.",
    "prereq": {}
  },
  {
    "uid": "800371",
    "code": "WRIT1201",
    "subject": "WRIT",
    "number": "1201",
    "honors": false,
    "writing": false,
    "name": "Writing Studio",
    "fullname": "Writing Studio",
    "info": "Note: this course does not fulfill the first-year writing requirement. WRIT 1201: This course gives students a foundation in the study and practice of writing process and rhetorical frameworks for a variety of genres and skills to enhance writing in and beyond college. This course is for students who want more instruction, practice, and time to develop familiarity with writing tools and processes to support their future college writing and successful completion of WRIT 1301 (fulfillment of FYW requirement).",
    "prereq": {}
  },
  {
    "uid": "003025",
    "code": "WRIT1223",
    "subject": "WRIT",
    "number": "1223",
    "honors": false,
    "writing": false,
    "name": "Oral Presentations",
    "fullname": "Oral Presentations in Professional Settings",
    "info": "Techniques for analyzing an audience, determining a purpose, developing an argument, and delivering a presentation. Emphasizes using presentations, basic communication theories.\n",
    "prereq": {}
  },
  {
    "uid": "800372",
    "code": "WRIT1301",
    "subject": "WRIT",
    "number": "1301",
    "honors": false,
    "writing": false,
    "name": "University Writing",
    "fullname": "University Writing",
    "info": "WRIT 1301 introduces students to rhetorical principles that provide a framework for successful written communication in college and beyond. Students study and write in a variety of genres and disciplines and in multimodal forms. The course focuses on writing as a way of knowing and learning to develop ideas through critical thinking, including analysis and synthesis. Based on the assumption that writing is a social activity, the course is a workshop format and requires active engagement in the writing process, including pre-writing, peer review, revision, and editing. Students develop information literacy and hone the ability to locate, evaluate, and effectively and ethically incorporate information into their own texts. The blended model combines two credit hours/week of small face-to-face class with two credit hours of online instruction in Canvas. Some sections are dedicated to international and multilingual students. WRIT 1301 fulfills the first-year writing requirement.",
    "prereq": {}
  },
  {
    "uid": "002628",
    "code": "WRIT1311",
    "subject": "WRIT",
    "number": "1311",
    "honors": false,
    "writing": false,
    "name": "Family American Experience",
    "fullname": "The Family in American Experience",
    "info": "The American family as portrayed in fiction, poetry, drama, and autobiography. Introduction to literature both as artistic and as ideological construct. Analysis of the social critique of American family life. \n\n",
    "prereq": {}
  },
  {
    "uid": "800373",
    "code": "WRIT1401",
    "subject": "WRIT",
    "number": "1401",
    "honors": false,
    "writing": false,
    "name": "University Writing - CEL",
    "fullname": "University Writing - Community Engaged Learning",
    "info": "Students in WRIT 1401 work with a local community organization as they explore writing processes and practices and rhetorical principles that provide a framework for successful written communication in college and beyond. Students analyze how writing works in varying contexts/genres and how it presents complex arguments with an emphasis on exploring ways that writing works to support change in communities and promote social justice. Students use and expand their writing process and revision to develop writing form/style and rhetorical content that contributes to conversations and provides new insight. Students develop information literacy and hone the ability to locate, evaluate, and effectively and ethically incorporate information into their own texts. The blended course modality combines two credit hours/week of small face-to-face class with two credit hours of online instruction in Canvas, in addition to weekly homework assignments. An additional 2 lab hours/week provide a common time and place reserved for work on and with our community partners. These are considered homework hours. WRIT 1401 fulfills the first-year writing requirement.",
    "prereq": {}
  },
  {
    "uid": "802083",
    "code": "WRIT1905",
    "subject": "WRIT",
    "number": "1905",
    "honors": false,
    "writing": false,
    "name": "Topics: Freshman Seminar",
    "fullname": "Topics: Freshman Seminar",
    "info": "Topics vary.\n\nprereq: Fr",
    "prereq": {}
  },
  {
    "uid": "802126",
    "code": "WRIT1908W",
    "subject": "WRIT",
    "number": "1908",
    "honors": false,
    "writing": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "797438",
    "code": "WRIT1910W",
    "subject": "WRIT",
    "number": "1910",
    "honors": false,
    "writing": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics vary.",
    "prereq": {}
  },
  {
    "uid": "817116",
    "code": "WRIT1915W",
    "subject": "WRIT",
    "number": "1915",
    "honors": false,
    "writing": true,
    "name": "Arguing w/Authority: Higher Ed",
    "fullname": "Arguing with Authority: The Past, Present, and Future of Higher Education",
    "info": "This freshman seminar will introduce students to the intellectual projects of studying and participating in higher education as a participatory institution by inviting freshmen into critical dialogue with past, present, popular, and academic representations of higher education and its civic purposes. We will examine the shifting role of the university in public life and the roles that students and other constituencies have played in shaping the character of higher education through writing and other activities. Designed specifically for first-year students, the course will combine academic skill-building with personal and collective reflection on the actual and possible purposes and values of higher education for individuals and the society.",
    "prereq": {}
  },
  {
    "uid": "817098",
    "code": "WRIT1925W",
    "subject": "WRIT",
    "number": "1925",
    "honors": false,
    "writing": true,
    "name": "Magazines and New Media",
    "fullname": "Magazines and New Media",
    "info": "In this seminar, we will study magazines and other smaller publications—some of which you've already read, some of which you haven't—to discuss and write about their significance as cultural artifacts. How can magazines, when seen as \"composed\" objects, help us with our own writing? How is the rise of the zine and e-zine responding to the evolving digital age? We will examine all aspects of the magazine, including its art, political statements, target audience, and history. Students will practice some of the forms that the class reads and create an e-magazine. ",
    "prereq": {}
  },
  {
    "uid": "818990",
    "code": "WRIT1935W",
    "subject": "WRIT",
    "number": "1935",
    "honors": false,
    "writing": true,
    "name": "Writing Medicine",
    "fullname": "Writing Medicine",
    "info": "Medicine, as a field, is most often considered an expert, scientific enterprise. However, as the COVID-19 pandemic has acutely demonstrated, communication plays an integral role in how the public and experts alike understand and engage with medicine, medical research and recommendations, pharmaceuticals, diseases, and more. This seminar explores the relationship between language and medicine through a range of books, essays, podcasts, videos, infographics, and other forms of writing and communication. By examining popular and technical writing, we will study the diverse factors that impact medicine and how we communicate about it, including politics, clinical trials, racism, emotions, empathy, biomedical technology, social media, popular culture, and ethics. In addition to studying the relationships between medicine and language, we will also practice writing for a variety of audiences and on a range of topics. ",
    "prereq": {}
  },
  {
    "uid": "801796",
    "code": "WRIT3029W",
    "subject": "WRIT",
    "number": "3029",
    "honors": false,
    "writing": true,
    "name": "Business and Prof.  Writing",
    "fullname": "Business and Professional Writing",
    "info": "In this course students practice writing and revising common business documents for today’s business world. Students write memos, proposals, cover letters, resumes, and digital and web content as well as practice choice of appropriate formats and media. The course draws from current business practices and stresses workplace collaboration, broader issues of professional literacy, and responsive writing styles. Students practice rhetorical analysis and discuss concepts such as audience, purpose, tone, and context when writing and revising their documents. Students analyze and write from a variety of perspectives and contexts including formal (researched reports, proposals) and informal (email, social media) communication. Students also build a professional online presence through such platforms as LinkedIn.\n",
    "prereq": {}
  },
  {
    "uid": "002605",
    "code": "WRIT3101W",
    "subject": "WRIT",
    "number": "3101",
    "honors": false,
    "writing": true,
    "name": "Writing Arguments",
    "fullname": "Writing Arguments",
    "info": "Students learn about argument, drawn from a number of theories of argument. This goal is pragmatic: those theories provide a vocabulary for talking about argument and for developing and refining students' own written arguments. Students get regular practice, coaching, and feedback on their writing skills, primarily as these concern argumentative writing. Students also learn how to analyze argumentative texts, drawn from popular culture, academic fields, and the public realm.",
    "prereq": {}
  },
  {
    "uid": "806924",
    "code": "WRIT3102W",
    "subject": "WRIT",
    "number": "3102",
    "honors": false,
    "writing": true,
    "name": "Public Writing",
    "fullname": "Public Writing",
    "info": "Students in this class examine public documents and apply critical/rhetorical analysis regarding audience, purpose, message, power, and context. Students conduct research and write documents for public audiences on contemporary issues of interest.  ",
    "prereq": {}
  },
  {
    "uid": "002687",
    "code": "WRIT3108",
    "subject": "WRIT",
    "number": "3108",
    "honors": false,
    "writing": false,
    "name": "Gender&Ethnicity:Rhet Sci&Tech",
    "fullname": "Gender and Ethnicity and the Rhetoric of Science and Technology",
    "info": "How cultural gender roles are affected by science/technology. Influence of gender roles on scientific/technological thinking (e.g., communication strategies, language, image). Values/goals of past/present scientific/technological communities.",
    "prereq": {}
  },
  {
    "uid": "003024",
    "code": "WRIT3152W",
    "subject": "WRIT",
    "number": "3152",
    "honors": false,
    "writing": true,
    "name": "Writing Sci/Tech",
    "fullname": "Writing on Issues of Science and Technology",
    "info": "Science and technology are key parts of nearly every aspect of our lives, and, just as important, science and technology are highly debated topics in political, economic, social, public, and personal spheres. For example, consider debates regarding genetically modified foods, space exploration, vaccines, oil pipelines, or clean drinking water. \n\nThis course will push you to consider the ways you think, feel, and write about science and technology. This course will ask you to examine the relationship between language and science and technology. We will spend the semester reading about science and technology, in addition to studying and practicing different strategies, techniques, and approaches for communicating about science and technology. Using rhetorical studies as a foundation, this course will give you the tools to more effectively engage with scientific and technological topics and debates.   \n\nFinally, and perhaps most importantly, this course aims to foster engagement with scientific and technological conversations. Put simply, students should leave this course caring about scientific and technological issues and wanting to participate in the conversations that surround such issues.",
    "prereq": {}
  },
  {
    "uid": "002641",
    "code": "WRIT3221W",
    "subject": "WRIT",
    "number": "3221",
    "honors": false,
    "writing": true,
    "name": "Communication Modes & Methods",
    "fullname": "Communication Modes and Methods",
    "info": "This course presents a survey of fundamental theories and philosophies of communication. Students will become acquainted with several theories of language and linguistic meaning and with principles of non-verbal and relational communication, and will engage in reflection on differences between older and newer media or “modes” of discourse (speaking vs. writing; conventional print vs. digital text, etc.). In addition to introducing theories and concepts, the course seeks to develop competencies in evaluating and applying them in the analysis of communication in various contexts including face-to-face conversations, ongoing interpersonal relationships, and digitally-mediated interactions.",
    "prereq": {}
  },
  {
    "uid": "803796",
    "code": "WRIT3244W",
    "subject": "WRIT",
    "number": "3244",
    "honors": false,
    "writing": true,
    "name": "How Words Change the World",
    "fullname": "Critical Literacies: How Words Change the World",
    "info": "This course is focused on understanding and using the insights into language and writing that animate Critical Literacy movements in the United States. Literacy is usually thought of in terms of fundamental abilities to read and write about a reality outside of language. Critical Literacy is an intellectual and social movement that challenges this dominant understanding of literacy. Critical Literacy’s fundamental claim is that texts (and our practices for working with them) invite readers (and writers) to accept particular versions of reality as the Real Truth.  Through historical and contemporary models, students will learn how efforts to question and transform dominant ways of using language have played an especially important role in struggles for greater justice by and for oppressed groups. Here, people have used the ideas and methods of Critical Literacy to question how racial, gender, social class, and other privileges structure our language practices and our daily experiences. Students will be invited to apply a critical understanding of literacy to their own writing as they analyze course texts and produce original essays on topics of interest to them.",
    "prereq": {}
  },
  {
    "uid": "002642",
    "code": "WRIT3257",
    "subject": "WRIT",
    "number": "3257",
    "honors": false,
    "writing": false,
    "name": "Tech & Prof Presentations",
    "fullname": "Technical and Professional Presentations",
    "info": "In this course students develop oral presentation skills for technical or professional topics. Areas of study in the course include visual communication, audience analysis, presentation strategies, and presentation of complex research material. The course emphasizes use of digital technologies. Recommend that students take Comm 1101 or equivalent first",
    "prereq": {}
  },
  {
    "uid": "002643",
    "code": "WRIT3266",
    "subject": "WRIT",
    "number": "3266",
    "honors": false,
    "writing": false,
    "name": "Group Process: Team Leadership",
    "fullname": "Group Process, Team Building, and Leadership",
    "info": "Group processes, team building from perspective of managers/leaders. Communication techniques in small group decision making process. Theories of team/small-group communication. Case studies. Group project for each student.",
    "prereq": {}
  },
  {
    "uid": "003027",
    "code": "WRIT3270",
    "subject": "WRIT",
    "number": "3270",
    "honors": false,
    "writing": false,
    "name": "Special Topics",
    "fullname": "Special Topics",
    "info": "See Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "003028",
    "code": "WRIT3291",
    "subject": "WRIT",
    "number": "3291",
    "honors": false,
    "writing": false,
    "name": "Tech Comm Certificate Capstone",
    "fullname": "Technical Communication Certificate Capstone Project",
    "info": "The capstone project is taken in conjunction with a concurrent WRIT course for the Technical Communication Certificate. The project extends an assignment in the selected WRIT course to further explore an aspect of technical communication. Students develop their project in consultation with the instructor of the selected course. Project formats include a paper, report, podcast, video, scientific poster, or electronic presentation.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "002624",
    "code": "WRIT3302",
    "subject": "WRIT",
    "number": "3302",
    "honors": false,
    "writing": false,
    "name": "Sci, Religion & Srch Hum Ntr",
    "fullname": "Science, Religion, and the Search for Human Nature",
    "info": "Relationship of religion and science as ways of explaining human nature/behavior. Focuses on 19th century: impact of Darwin's theory and historical study of Biblical texts. Existentialism and political ecology as modern efforts that problematize \"human nature.\"",
    "prereq": {}
  },
  {
    "uid": "002626",
    "code": "WRIT3315",
    "subject": "WRIT",
    "number": "3315",
    "honors": false,
    "writing": false,
    "name": "Writ on Issues of Land & Env",
    "fullname": "Writing on Issues of Land and the Environment",
    "info": "This course explores how written texts help shape understandings of the land in the U.S. Students read and analyze historical texts that have contributed to colonialist understandings of nature and the land. Students will study how the rhetorical strategies of such texts helped to form exploitive relations with the land and enact violence against indigenous peoples. Historical and current texts written by native peoples provide a counter-narrative to the myth of progress. Emphasis in the course is placed on analyzing texts with an eye toward setting the ground for conversations aimed at achieving sustainability and justice. Students will also study how written texts are composed within material contexts that contribute to their understanding.",
    "prereq": {}
  },
  {
    "uid": "788364",
    "code": "WRIT3361",
    "subject": "WRIT",
    "number": "3361",
    "honors": false,
    "writing": false,
    "name": "Lit Social Movements",
    "fullname": "Literature of Social Movements in the United States: 1950 to Present",
    "info": "Literature (fictional, nonfictional) of social movements in United States in last half of 20th century. Artistic truth in relation to historical truth. Roles/obligations of citizens to protest/change social structures.\n\nprereq: Soph or jr or sr or instr consent",
    "prereq": {}
  },
  {
    "uid": "799034",
    "code": "WRIT3362",
    "subject": "WRIT",
    "number": "3362",
    "honors": false,
    "writing": false,
    "name": "Applied Environmental Ethics",
    "fullname": "Applied Environmental Ethics",
    "info": "Ethical theories/obligations, systems of value. Issues of justice for individual behavior and public policy: population growth, animal welfare, pollution prevention, ecological restoration.",
    "prereq": {}
  },
  {
    "uid": "002664",
    "code": "WRIT3371W",
    "subject": "WRIT",
    "number": "3371",
    "honors": false,
    "writing": true,
    "name": "Technology, Self, and Society",
    "fullname": "Technology, Self, and Society",
    "info": "Cultural history of American technology. Social values that technology represents in shifts from handicraft to mass production/consumption, in modern transportation, communication, bioengineering. Ethical issues in power, work, identity, our relation to nature.",
    "prereq": {}
  },
  {
    "uid": "002645",
    "code": "WRIT3381W",
    "subject": "WRIT",
    "number": "3381",
    "honors": false,
    "writing": true,
    "name": "Writing and Modern Culture",
    "fullname": "Writing and Modern Cultural Movements",
    "info": "This course explores how written texts help to shape modern art and cultural movements. Writ 3381 first develops an understanding of the manifesto form by reading primary examples written by artists from such movements as Cubism and Expressionism.  Students study the complex written and visual strategies of those texts and how they contributed to social and political change in the modern world. Out of those attempts to change culture, students will be challenged to consider how particular writing strategies developed in the U.S. aimed at bringing about change in 1960s culture in areas such as the women's movement, the move toward racial equality, and the environmental movement. Toward the end of the course, the writings of current movements are taken up as building on and departing from past writing and rhetorical strategies. Students both read about and practice writing strategies studied in the course.",
    "prereq": {}
  },
  {
    "uid": "002665",
    "code": "WRIT3383",
    "subject": "WRIT",
    "number": "3383",
    "honors": false,
    "writing": false,
    "name": "In Search of Nature",
    "fullname": "In Search of Nature",
    "info": "The human need for a relationship with nature and the ways we organize our environment to reflect this need. Various images such as the pastoral and wilderness are traced historically. Tensions between rural and urban views of nature.",
    "prereq": {}
  },
  {
    "uid": "789960",
    "code": "WRIT3384",
    "subject": "WRIT",
    "number": "3384",
    "honors": false,
    "writing": false,
    "name": "From Soil to Civilization",
    "fullname": "From Soil to Civilization: Agriculture and the Emergence of the Modern World",
    "info": "Central importance of emergence of agriculture (i.e., domestication of plants/animals) in development of settled communities, cities, nations, and empires. How it happened, how we know. Differences among agricultural developments on different continents.",
    "prereq": {}
  },
  {
    "uid": "002666",
    "code": "WRIT3401",
    "subject": "WRIT",
    "number": "3401",
    "honors": false,
    "writing": false,
    "name": "Internet Tools/Issues",
    "fullname": "Internet Communication: Tools and Issues",
    "info": "E-mail, e-commerce, social/cultural context of communication. Discussion topics vary, depending on current issues in existing or emerging technologies. Active online participation required.",
    "prereq": {}
  },
  {
    "uid": "799035",
    "code": "WRIT3404",
    "subject": "WRIT",
    "number": "3404",
    "honors": false,
    "writing": false,
    "name": "Environmental Communication",
    "fullname": "Environmental Communication",
    "info": "Framing, audience analysis, message design, usability. Case studies of campaigns related to wilderness protection, pesticide use, and climate change. Team building, public speaking, document design, Web development.",
    "prereq": {}
  },
  {
    "uid": "809404",
    "code": "WRIT3405W",
    "subject": "WRIT",
    "number": "3405",
    "honors": false,
    "writing": true,
    "name": "Humanistic Healthcare and Comm",
    "fullname": "Humanistic Healthcare and Communication",
    "info": "Humanistic Healthcare and Communication focuses on critically therapeutic patient-provider communication. Topics surveyed include: health literacy, cultural and risk communication, health communication, narrative theory and digital medicine. These topics are brought to bear on three historical moments in the history of medicine when humanism entered or was displaced in medical practice. Students will be exposed to writings, visual arts and music created by physicians and nurses throughout history and write critical essays on these. These will prep students for the new MCAT exam. A variety of guest lecturers from the medical profession will discuss case histories that demonstrate the course themes in practice.  ",
    "prereq": {}
  },
  {
    "uid": "796934",
    "code": "WRIT3441",
    "subject": "WRIT",
    "number": "3441",
    "honors": false,
    "writing": false,
    "name": "Editing, Critique & Style",
    "fullname": "Editing, Critique, and Style",
    "info": "In this course, students will increase their understanding of how language works and will learn to make choices about language, style, and punctuation to create messages that are clear, concise, and useful. The course emphasizes technical communication, but the skills learned can be applied to any communication situation. Editing practice will include three levels of editing to make the documents comprehensible and useful in which students will not only polish their grammar and punctuation skills, but they will also learn how to explain and justify changes they make in documents. Topics also included in the course are editing methods for both paper and electronic copy and editing for organization and visual design. ",
    "prereq": {}
  },
  {
    "uid": "793911",
    "code": "WRIT3470",
    "subject": "WRIT",
    "number": "3470",
    "honors": false,
    "writing": false,
    "name": "Special Topics in Comm Skills",
    "fullname": "Special Topics in Communication Skills",
    "info": "Topics vary, see current Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "803601",
    "code": "WRIT3533",
    "subject": "WRIT",
    "number": "3533",
    "honors": false,
    "writing": false,
    "name": "Roles of the Reader",
    "fullname": "Roles of the Reader",
    "info": "Broad perspective on reading. Reading as a cognitive process, as strategic activity, as aesthetic experience, as central social practice. Historical, technological,  social, and cultural conditions and contexts. Reciprocity between reading and writing.\n\nprereq: Jr or sr or instr consent",
    "prereq": {}
  },
  {
    "uid": "002668",
    "code": "WRIT3562W",
    "subject": "WRIT",
    "number": "3562",
    "honors": false,
    "writing": true,
    "name": "Tech & Professional Writing",
    "fullname": "Technical and Professional Writing",
    "info": "This course introduces students to technical and professional writing through various readings and assignments in which students analyze and create texts that work to communicate complex information, solve problems, and complete tasks. Students gain knowledge of workplace genres as well as to develop skills in composing such genres. This course allows students to practice rhetorically analyzing writing situations and composing genres such as memos, proposals, instructions, research reports, and presentations. Students work in teams to develop collaborative content and to compose in a variety of modes including text, graphics, video, audio, and digital. Students also conduct both primary and secondary research and practice usability testing. The course emphasizes creating documents that are goal-driven and appropriate for a specific context and audience.",
    "prereq": {}
  },
  {
    "uid": "790672",
    "code": "WRIT3577W",
    "subject": "WRIT",
    "number": "3577",
    "honors": false,
    "writing": true,
    "name": "Rhetoric, Tech., &  Internet",
    "fullname": "Rhetoric, Technology, and the Internet",
    "info": "This course examines the rich and complex ways people are seeking to inform and persuade others via the internet. Western rhetorical theories have adapted to address spoken, written, visual, and digital communication. The internet incorporates aspects of all of these modes of communication, but it also requires us to revisit how we have understood them. Students in Rhetoric, Technology, and the Internet will reinforce their understandings of rhetorical theories and the internet as a technology. The class will also ask students to read current scholarly work about the internet, and develop the critical tools needed to complement, extend, or challenge that work.",
    "prereq": {}
  },
  {
    "uid": "002672",
    "code": "WRIT3671",
    "subject": "WRIT",
    "number": "3671",
    "honors": false,
    "writing": false,
    "name": "Visual Rhetoric & Doc Design",
    "fullname": "Visual Rhetoric and Document Design",
    "info": "This course approaches the challenges of document design by drawing upon principles from rhetorical theory and scholarship. In practical terms, this means that the design questions addressed in this class are understood in terms of specific audiences and specific contexts. Students in this class will pursue a blend of critical analysis — drawing on rhetorical principles —  and document design. While Visual Rhetoric and Document Design assumes no baseline design training, class assignments will encourage students to put theory into practice and develop documents that reflect current best practices in print and digital spaces. ",
    "prereq": {}
  },
  {
    "uid": "002673",
    "code": "WRIT3672W",
    "subject": "WRIT",
    "number": "3672",
    "honors": false,
    "writing": true,
    "name": "Project Design/Develop",
    "fullname": "Project Design and Development",
    "info": "If you want to put design thinking, agile project management, teamwork, writing, research, analysis, and critical thinking on your resume, join Project Design and Development. You will study, plan, research, design, and develop technical communication materials in a design-thinking, collaborative-writing environment. You’ll work in teams to create a user manual and information graphic, promotional materials, and a social media campaign while planning and documenting your projects and productivity. You will leave the course with knowledge and skills you can put to work in any organization: small business, nonprofit, and corporate. The course develops competencies that the National Association of Colleges and Employers has named as most-valued by employers: critical thinking, written communication, collaboration, digital technology, leadership, and professionalism. ",
    "prereq": {}
  },
  {
    "uid": "002669",
    "code": "WRIT3701W",
    "subject": "WRIT",
    "number": "3701",
    "honors": false,
    "writing": true,
    "name": "Rhet Theory For Writ Studies",
    "fullname": "Rhetorical Theory for Writing Studies",
    "info": "This course is designed to explore major issues and perspectives in rhetorical criticism, including foundational concepts from the history of rhetorical theory, elements of rhetorical studies, and methods of rhetorical analysis. Rhetoric is an art form with a diverse theoretical landscape, meaning that there is no singular, stable definition of the term; rather, rhetoric is a practice that has been used as an organizing principle for a variety of communicative acts – written, spoken, and enacted. As such, the study of rhetorical theory and criticism begins with the understanding that human beings use language and symbols to shape our many worldviews. The skills obtained in this class will help you to understand the nature and function of the persuasive strategies that structure our everyday lives and arguments. As a writing-intensive course, you will also learn how to construct a piece of rhetorical criticism that draws upon a toolbox of ideas and methods to successfully articulate a rhetorical argument.",
    "prereq": {}
  },
  {
    "uid": "004324",
    "code": "WRIT3751W",
    "subject": "WRIT",
    "number": "3751",
    "honors": false,
    "writing": true,
    "name": "Writing Consultancy",
    "fullname": "Seminar: Theory and Practice of Writing Consultancy",
    "info": "This course is a seminar in the theory and practice of teaching writing through one-to-one consultations. Our goal in this seminar is to develop as writers and writing consultants through investigating into, experimenting with, and reflecting upon our own literacy practices; reading carefully and discussing published research and theory as well as examples of our own and other students’ writing; posing and exploring questions about writers, writing consulting, language and literacy learning, linguistic diversity, and the role of writing centers within higher education; observing, practicing, and reflecting on a variety of consulting strategies; and designing, conducting, and presenting our own writing center inquiry projects. Through reflective writing, in-class consultations, class discussions, and collaborative activities, we will learn together many approaches for conducting one-to-one conferences and for coaching students in their development as writers.\n\nprereq: Currently working in a University writing center, instr consent",
    "prereq": {}
  },
  {
    "uid": "003029",
    "code": "WRIT3896",
    "subject": "WRIT",
    "number": "3896",
    "honors": false,
    "writing": false,
    "name": "Technical Writ & Comm Intrnshp",
    "fullname": "Internship in Technical Writing and Communication",
    "info": "This is an online course for students who are working in an approved internship in the field of technical communication. Students have the opportunity to apply the skills they have learned in the TWC major in a real-world situation. In the course, students are required to read materials, to submit bi-weekly progress reports on their position to an online forum, and respond to other students. Students are also asked to post examples of their projects and to rate their skills using the CLA Competencies and Rate Tool. The final project in the course is a 10-12 page final report that involves submitting a draft and meeting with the instructor.\n\nprereq: Writ 3562W and 24 credits completed in the Technical Writing & Communication major",
    "prereq": {
      "or": [
        "002668"
      ]
    }
  },
  {
    "uid": "812248",
    "code": "WRIT3993",
    "subject": "WRIT",
    "number": "3993",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Supervised reading/research on topics not covered in regularly scheduled offerings. Intended primarily for upper division undergraduate students.\n\nprereq: instr consent, dept consent, college consent",
    "prereq": {}
  },
  {
    "uid": "002670",
    "code": "WRIT4105W",
    "subject": "WRIT",
    "number": "4105",
    "honors": false,
    "writing": true,
    "name": "Corporate Video for Tech Comm",
    "fullname": "Corporate Video for Technical Communicators",
    "info": "Introduction to products, professionals, and processes of corporate video. Students analyze corporate video; submit a proposal, treatment, and script; maintain a journal; complete an interactive unit on production; and conduct research on a video-related topic of their choice.\n\n",
    "prereq": {}
  },
  {
    "uid": "002671",
    "code": "WRIT4165",
    "subject": "WRIT",
    "number": "4165",
    "honors": false,
    "writing": false,
    "name": "Managerial & Organization Comm",
    "fullname": "Managerial and Organizational Communication, Planning, and Change",
    "info": "A study of organizational theory, communication processes, planning, and change with emphasis on action research in scientific and/or technical settings. Study of organization and management theory to develop organizational consultative skills.",
    "prereq": {}
  },
  {
    "uid": "003032",
    "code": "WRIT4258",
    "subject": "WRIT",
    "number": "4258",
    "honors": false,
    "writing": false,
    "name": "Info Gathering Tech: STC",
    "fullname": "Information-Gathering Techniques in Scientific and Technical Communication",
    "info": "Informational, employment-cycle, and problem-solving interviews. Guides, schedules, questioning techniques, communication theories. Descriptive statistics used to analyze data for various projects.",
    "prereq": {}
  },
  {
    "uid": "803603",
    "code": "WRIT4320",
    "subject": "WRIT",
    "number": "4320",
    "honors": false,
    "writing": false,
    "name": "Topics in Travel Writing",
    "fullname": "Topics in Travel Writing",
    "info": "Readings about travel, imaginary/historical, from different civilizations/periods. Colonialism, postcolonialism, aesthetics, tourism. Quality of scientific and social scientific methods/results. Topics listed in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "798886",
    "code": "WRIT4431W",
    "subject": "WRIT",
    "number": "4431",
    "honors": false,
    "writing": true,
    "name": "Science, Technology, & the Law",
    "fullname": "Science, Technology, and the Law",
    "info": "In this course students explore the effects of scientific and technological development on the law—and the effects of the law on scientific and technological development. In particular, students will read and discuss government regulation, constitutional guidelines and rights, and federal and state court precedents regarding privacy, intellectual property (patients and copyright), and health law. Specific topics include the following: Search warrants and Four Amendment rights, electronic surveillance law, national security and foreign intelligence, copyright and fair use, citizens’ access to creative works, informed consent, medical expert testimony in the courtroom, and the right to medical treatment. Students will have the opportunity to express their opinions and display their analytical skills in three take-home essay exams. Students from all majors are welcome, including those students interested in law school.",
    "prereq": {}
  },
  {
    "uid": "007476",
    "code": "WRIT4501",
    "subject": "WRIT",
    "number": "4501",
    "honors": false,
    "writing": false,
    "name": "Usability & Human Factors",
    "fullname": "Usability and Human Factors in Technical Communication",
    "info": "Usability is concerned with how people interact with design and technology; usability is commonly known as the \"ease of use\" of products and technologies by a range of users. This course emphasizes usability and user research and will explore the intersection of usability and technical communication. We will investigate definitions of usability and user-centered design principles, and we will explore a variety of usability research methods including heuristic evaluation, personas, and usability testing. The course will focus heavily on usability testing of web sites, a common technical communication task that involves observation and interviews of human participants interacting with a web site.",
    "prereq": {}
  },
  {
    "uid": "796952",
    "code": "WRIT4562",
    "subject": "WRIT",
    "number": "4562",
    "honors": false,
    "writing": false,
    "name": "Int'l Prof Communication",
    "fullname": "International Professional Communication",
    "info": "This course prepares students to navigate the increasingly global nature of communication and the challenges and opportunities it presents. Students learn how to develop content for and work with clients and colleagues from other cultures, communicate with multicultural audiences, and collaborate in virtual global teams using multiple synchronous and asynchronous technologies. \n\nThe course includes work with peers and international scholars from various parts of the world. Projects include a metaphorical comparative analysis of cultures; management (global virtual team work) of a translation project with students from another country; interviews with managers/employees in multinational corporations; and curation work with an international archive on emerging technologies.",
    "prereq": {}
  },
  {
    "uid": "003031",
    "code": "WRIT4573W",
    "subject": "WRIT",
    "number": "4573",
    "honors": false,
    "writing": true,
    "name": "Writing Proposals & Grant Mgmt",
    "fullname": "Writing Proposals and Grant Management",
    "info": "This advanced-level Writing Studies course introduces students to the activities, responsibilities, challenges, and opportunities that characterize proposals for nonprofits and/or research/business. Students analyze unique proposal writing situations, including audiences (customers, reviewers, and teammates) and resources (collaborators, templates, and time). Students practice the entire process of proposal and grant writing: 1) describing the problem in context; 2) identifying sponsors and finding a match; 3) designing, writing, revising, and completing all proposal components; 4) conceptualizing and using persuasive visual elements; and 5) presenting and responding to stakeholders and sponsors.",
    "prereq": {}
  },
  {
    "uid": "002685",
    "code": "WRIT4662W",
    "subject": "WRIT",
    "number": "4662",
    "honors": false,
    "writing": true,
    "name": "Writing with Digital Tech",
    "fullname": "Writing With Digital Technologies",
    "info": "WRIT 4662W is an advanced level Writing Studies course that explores various digital writing technologies and provides multiple opportunities to assess writing situations and make appropriate decisions about digital form and production. Students will learn the basic building blocks of writing in Internet environments (text, sound, images, video) as well as the vocabularies, functionalities, and organizing structures of Web 2.0 environments, how these impact understanding and use of information, and how to produce these environments (i.e., multimedia internet documents) for interactivity and use. This course includes design projects and practice with apps, markup language, content management systems, video, and social media.\n\nprereq: Jr or sr or instr consent",
    "prereq": {}
  },
  {
    "uid": "808168",
    "code": "WRIT4664W",
    "subject": "WRIT",
    "number": "4664",
    "honors": false,
    "writing": true,
    "name": "Sci, Med and Health Writing",
    "fullname": "Science, Medical, and Health Writing",
    "info": "This course explores the theories and practices of rhetoric and writing in science, medicine, and health (SMH). Students learn about genres of SMH communication including regulatory documents from the FDA, podcasts created by scientists for the public, patient blogs, and published research articles. The course also engages topics including accessibility, writing in regulated environments, writing for complex audiences, and engaging biomedical and scientific research in writing. Students are challenged to consider how language, science, biomedicine, and health intersect and how different stakeholders such as patients, healthcare providers, scientists, government officials, and insurance companies engage in SMH communication.",
    "prereq": {}
  },
  {
    "uid": "803624",
    "code": "WRIT4980",
    "subject": "WRIT",
    "number": "4980",
    "honors": false,
    "writing": false,
    "name": "Senior Seminar",
    "fullname": "Senior Seminar in Writing Studies",
    "info": "Research questions/topics in writing studies. Combines theory, history, and writing practice. Theme/problem in writing studies. Semester paper. Topics listed in Class Schedule.\n\nprereq: Major in [scientific/technical communication or writing studies], upper div",
    "prereq": {}
  },
  {
    "uid": "808529",
    "code": "WRIT4995",
    "subject": "WRIT",
    "number": "4995",
    "honors": false,
    "writing": false,
    "name": "Tech Writing & Comm Capstone",
    "fullname": "Technical Writing and Communication Capstone",
    "info": "Capstone project addressing topic in writing studies related to WRIT course. Must be done in conjunction with concurrent 3xxx or 4xxx level course in Writing Studies that student is taking. Instructor permission required for registration.",
    "prereq": {}
  },
  {
    "uid": "820049",
    "code": "WRIT4999",
    "subject": "WRIT",
    "number": "4999",
    "honors": false,
    "writing": false,
    "name": "TWC Capstone",
    "fullname": "Technical Writing and Communication Capstone",
    "info": "The Senior Capstone course is a culminating experience for all Technical Writing and Communication majors. This course is designed to facilitate individualized student projects that combine previous knowledge, skills, and experiences developed as a TWC major into a senior project. Specifically, students will design and carry out a project of their own design under the guidance of the instructor. \n\nStudents taking this course should have completed the majority of the TWC core requirements. It is recommended students take it the last semester of their senior year.",
    "prereq": {}
  },
  {
    "uid": "798386",
    "code": "WRIT5001",
    "subject": "WRIT",
    "number": "5001",
    "honors": false,
    "writing": false,
    "name": "Foundations of Tech Comm",
    "fullname": "Foundations and Futures of Technical Communication",
    "info": "This course offers an overview of the field of technical communication. Students learn about the history of the field including job titles, industries that hire technical communicators, and trends in the field. Students also learn about research methods (including audience analysis and usability testing); software and apps commonly used in technical communication; social issues in technical communication (including legal, ethical, and organizational); and international issues (including writing for regulated environments such as in the medical device industry).\n\nProjects are multi-modal and include written reports; slide presentations with and without voice recordings; visual communication including user documentation and movies. Some projects are done individually but most are done in virtual teams. Weekly discussion forums provide students with opportunities to lead and summarize key themes from each week’s topic. Students in this class participate within a community of technical communication professionals and typically have a background in technical communication, medical/science communication, engineering, software, usability, customer support, writing and communication, marketing, or similar area. ",
    "prereq": {}
  },
  {
    "uid": "016850",
    "code": "WRIT5051",
    "subject": "WRIT",
    "number": "5051",
    "honors": false,
    "writing": false,
    "name": "Graduate Research Writing",
    "fullname": "Graduate Research Writing for International Students",
    "info": "Graduate research writing emphasizes writing techniques, structures, style, and formal language for scholarly writing including research proposals and abstracts, critiques/reviews, and thesis/dissertations and publications. Special focus on field-specific scholarly expectations, documentation, structure/style, grammar, formal or scholarly vocabulary, and extensive revising/editing based on instructor and mentor feedback to meet graduate standards. Discussions.\nprereq: Grad student",
    "prereq": {}
  },
  {
    "uid": "792481",
    "code": "WRIT5052",
    "subject": "WRIT",
    "number": "5052",
    "honors": false,
    "writing": false,
    "name": "Presentation/Conf. Writing",
    "fullname": "Graduate Research Presentations and Conference Writing for Non-Native Speakers of English",
    "info": "Practice in writing/presenting graduate-level research for conferences or professional seminars. Delivery of professional academic presentations to U.S. audiences. Conference abstract, paper, and poster presentation. Communication in the research process. Students select topics from their own research/studies. Format, style, transitions, topic narrowing, non-verbal presentation skills.\n\nprereq: [Grad student, non-native speaker of English] or instr consent",
    "prereq": {}
  },
  {
    "uid": "002674",
    "code": "WRIT5111",
    "subject": "WRIT",
    "number": "5111",
    "honors": false,
    "writing": false,
    "name": "Information Design I",
    "fullname": "Information Design: Theory and Practice I",
    "info": "Audience analysis, media selection, message design through various theoretical perspectives, including cognitive/schema, social construction, feminist, intercultural theories. Usability testing, contextual inquiry as means to study effectiveness of messages.",
    "prereq": {}
  },
  {
    "uid": "002675",
    "code": "WRIT5112",
    "subject": "WRIT",
    "number": "5112",
    "honors": false,
    "writing": false,
    "name": "Information Design",
    "fullname": "Information Design: Theory and Practice",
    "info": "This course examines how verbal, visual, and multimedia content can be designed and combined to create meaning, improve comprehension, and make information more usable. Emphasis is placed on the rhetorical roles of visual elements in print and digital communications, and how technical communicators can use visual means to reach audiences, convey information, and achieve rhetorical goals. Students read and discuss theory, practice information design skills, and apply  both to real communications projects suitable for inclusion in a professional portfolio.    \t\n\nProjects focus on print and web content design and development; the information design process (plan, design, develop, layout, testing); project planning toward deliverables (web sites, signage, wayfinding); and universal design (color, symbols, etc.)\n",
    "prereq": {}
  },
  {
    "uid": "002676",
    "code": "WRIT5196",
    "subject": "WRIT",
    "number": "5196",
    "honors": false,
    "writing": false,
    "name": "Internship in Sci & Tech Comm",
    "fullname": "Internship in Scientific and Technical Communication",
    "info": "Internship sites may include the University, industry, or government agencies. An internship proposal, progress report, internship journal (optional), and final report with a letter from the internship supervisor are required.",
    "prereq": {}
  },
  {
    "uid": "003033",
    "code": "WRIT5270",
    "subject": "WRIT",
    "number": "5270",
    "honors": false,
    "writing": false,
    "name": "Special Topics",
    "fullname": "Special Topics",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "003034",
    "code": "WRIT5291",
    "subject": "WRIT",
    "number": "5291",
    "honors": false,
    "writing": false,
    "name": "Ind Study Read & Research",
    "fullname": "Independent Study, Reading, and Research",
    "info": "Supervised reading/research on advanced projects not covered in regularly scheduled offerings.\n\nprereq: instr consent, dept consent",
    "prereq": {}
  },
  {
    "uid": "820349",
    "code": "WRIT5501",
    "subject": "WRIT",
    "number": "5501",
    "honors": false,
    "writing": false,
    "name": "Usability & Human Factors",
    "fullname": "Usability and Human Factors in Technical Communication",
    "info": "Usability is concerned with how people interact with design and technology; usability is commonly known as the \"ease of use\" of products and technologies by a range of users. This course emphasizes usability and user research and will explore the intersection of usability and technical communication. We will investigate definitions of usability and user-centered design principles, and we will explore a variety of usability research methods including heuristic evaluation, personas, and usability testing. The course will focus heavily on usability testing of web sites, a common technical communication task that involves observation and interviews of human participants interacting with a web site.",
    "prereq": {}
  },
  {
    "uid": "002677",
    "code": "WRIT5511",
    "subject": "WRIT",
    "number": "5511",
    "honors": false,
    "writing": false,
    "name": "Research in Sci & Tech Comm",
    "fullname": "Research in Scientific and Technical Communication",
    "info": "Experimental/survey research techniques for quantitative/qualitative methodologies in scientific/technical communication. Face-to-face, phone, focus group interviewing. Questionnaire development, contextual inquiry. Using rating, ranking, q-sort methods. Ethics, experimental bias, inferential statistical analysis.",
    "prereq": {}
  },
  {
    "uid": "002678",
    "code": "WRIT5531",
    "subject": "WRIT",
    "number": "5531",
    "honors": false,
    "writing": false,
    "name": "Writ Theory & Pedagogies",
    "fullname": "Introduction to Writing Theory and Pedagogies",
    "info": "This course explores the nexus of theory and practice in terms of writing instruction and of technical writing and communication to help students identify their pedagogical positions and concrete practices. Designed as a collaborative, exploratory space for a community of teacher-scholars, it approaches the teaching of writing as a process that is both practiced and studied, is aided by reflection with others, and requires ongoing revision. Course texts address the scholarship of Composition, Rhetoric, and Technical Writing. Students put these texts in dialog, including with the “texts” of their classrooms, to examine and reflect on their teaching practices. \n \nThe course centers acts of engagement and reflection and emphasizes pedagogical inquiry. Students learn to: place a range of theories on writing instruction in conversation with their teaching; reflect on classroom practices and pedagogical theories; articulate individual philosophies of teaching; explore pedagogical issues of personal interest; foster pedagogical “habits of mind” that serve students in classrooms at the UMN and beyond; and contribute to an active, supportive, and collaborative teaching community.\n\nprereq: Grad student",
    "prereq": {}
  },
  {
    "uid": "002680",
    "code": "WRIT5532",
    "subject": "WRIT",
    "number": "5532",
    "honors": false,
    "writing": false,
    "name": "Practicum: Writing Pedagogies",
    "fullname": "Practicum in Writing Pedagogies",
    "info": "WRIT 5532 is designed to be a collaborative, developmental, and exploratory space for new graduate instructors in the First Year Writing (FYW) program. Students will engage texts and podcasts, as well as their experience teaching WRIT1301 as we focus on: \n-How do people learn, how do they learn writing, and how can instructors teach writing based on those understandings? \n-How can instructors design environments, materials, and practices that equitably help students learn about writing and develop as writers? \n\nClass discussions and assignments also invite students to identify and address challenges, tensions, and pedagogical issues of personal interest; to develop habits of mind that will serve them in other classrooms in their teaching careers; and to articulate the classroom practices and pedagogies informing their teaching philosophies. \n\nCourse meetings/structure: hybrid, students will meet in person, 1:1 with instructor, and complete guided and supported asynchronous work.",
    "prereq": {}
  },
  {
    "uid": "002681",
    "code": "WRIT5534",
    "subject": "WRIT",
    "number": "5534",
    "honors": false,
    "writing": false,
    "name": "Intercultural Tech Training",
    "fullname": "Designing Technical Training for Intercultural Audiences",
    "info": "Select and research a training topic, write learning objectives and outcomes, set the conditions for learning, complete a comprehensive course outline and one training module.",
    "prereq": {}
  },
  {
    "uid": "003030",
    "code": "WRIT5561",
    "subject": "WRIT",
    "number": "5561",
    "honors": false,
    "writing": false,
    "name": "Editing/Style for Tech Comm",
    "fullname": "Editing and Style for Technical Communicators",
    "info": "In this course, students learn strategies for editing and revising writing for technical and non-technical audiences. Students practice three levels of editing skills: proofreading, copyediting, and comprehensive editing. Strategies include advanced grammar and style, editing tools, quantitative data, global documents, and various style guides.  Students also examine an editor’s role with authors, in organizations, in global contexts, and in ethical situations. Editing projects focus on the three levels of editing, using proficient methods,  collaborating between authors and editors, identifying audience and contexts, editing documents according to style guides, and using rhetorical principles to analyze and edit final documents.",
    "prereq": {}
  },
  {
    "uid": "787618",
    "code": "WRIT5570",
    "subject": "WRIT",
    "number": "5570",
    "honors": false,
    "writing": false,
    "name": "MWP Dir St",
    "fullname": "Minnesota Writing Project Directed Studies",
    "info": "Guided individual research into current theories/practices of writing and writing pedagogy.",
    "prereq": {}
  },
  {
    "uid": "818687",
    "code": "WRIT5662",
    "subject": "WRIT",
    "number": "5662",
    "honors": false,
    "writing": false,
    "name": "Writing with Digital Tech",
    "fullname": "Writing With Digital Technologies",
    "info": "This course explores current and emerging digital writing technologies and teaches students to assess writing situations and make appropriate decisions about digital form, production, and scholarship. Students learn the basic building blocks of writing in Internet environments (text, sound, images, video, interactivity); the vocabularies, functionalities, and organizing structures of Web 2.0 environments and how each impacts understanding and use of information; and how to produce Web 2.0 environments (i.e., multimedia internet documents) that facilitate interactivity and use. This course includes design projects and practice with apps, markup language (html and xml), and content management systems.",
    "prereq": {}
  },
  {
    "uid": "002686",
    "code": "WRIT5664",
    "subject": "WRIT",
    "number": "5664",
    "honors": false,
    "writing": false,
    "name": "Science, Med, & Health Writing",
    "fullname": "Science, Medical, and Health Writing",
    "info": "This course explores the theories and practices of rhetoric and writing in science, medicine, and health (SMH). Students learn about genres of SMH communication including regulatory documents from the FDA, podcasts created by scientists for the public, patient blogs, and published research articles. The course also engages topics including accessibility, writing in regulated environments, writing for complex audiences, and engaging biomedical and scientific research in writing. Students are challenged to consider how language, science, biomedicine, and health intersect and how different stakeholders such as patients, healthcare providers, scientists, government officials, and insurance companies engage in SMH communication.",
    "prereq": {}
  },
  {
    "uid": "798304",
    "code": "WRIT5671",
    "subject": "WRIT",
    "number": "5671",
    "honors": false,
    "writing": false,
    "name": "Visual Rhetoric",
    "fullname": "Visual Rhetoric",
    "info": "This course investigates current understandings of how visuals participate in and extend the rhetorical strategies long associated with speech and writing. Students explore developments in the discipline of visual rhetoric by engaging with an emerging canon of texts that survey the work of rhetoricians, graphic designers, graphic novelists, commercial artists, fine artists, and technical communicators. Emphasis is placed on the use of visuals in science and technology; identifying shared principles of persuasion through visual information; developing the vocabulary to comment on, critique, and create visuals; and assessing whether visuals meet the needs of intended audiences. ",
    "prereq": {}
  },
  {
    "uid": "016459",
    "code": "WRIT5775",
    "subject": "WRIT",
    "number": "5775",
    "honors": false,
    "writing": false,
    "name": "Rhet Traditions: Classical",
    "fullname": "Rhetorical Traditions: Classical Period",
    "info": "This course provides an intensive survey of rhetoric as understood and practiced in ancient Greece and Rome, and serves as an introduction to graduate-level study of historical rhetoric more generally. The course attends to the development of the discipline of rhetoric in the Classical world and to the recurring themes that constitute \"the rhetorical tradition.\" Class discussions and assignments assess the epistemological foundations, ethical status, and socio-political importance of ancient rhetorical training and discourse. Primary readings (in English) include works by sophists and orators of the Greek Classical period, Isocrates, Plato, Aristotle, Cicero, Quintilian, and others. Secondary readings and class discussion will consider political, cultural, and philosophical contexts for ancient rhetorical theory, oratorial practice, and the teaching of speech and writing. This course will prepare graduate students for preliminary exams, research, and pedagogical encounters in rhetoric.",
    "prereq": {}
  },
  {
    "uid": "015569",
    "code": "WRIT5776",
    "subject": "WRIT",
    "number": "5776",
    "honors": false,
    "writing": false,
    "name": "Rhet Traditions: Modern Era",
    "fullname": "The Rhetorical Traditions: Modern Era",
    "info": "This course is designed to acquaint graduate students with different traditions of rhetorical theory. It surveys a range of rhetorical tools/methods, and sets out to assist students to find a clear purpose for using rhetorical theory and to develop a structured approach to their objects of criticism. It prioritizes Black, Indigenous, transnational, and anti-racist approaches to rhetoric, and situates those as foundational to the traditions of such theoretical traditions as semiotics, deconstruction, genealogy, affect theory, assemblage theory, and psychoanalysis. It is intended to prepare students for comprehensive exams, conference presentations, and pedagogical encounters with rhetoric.",
    "prereq": {}
  },
  {
    "uid": "799188",
    "code": "WRIT5777",
    "subject": "WRIT",
    "number": "5777",
    "honors": false,
    "writing": false,
    "name": "Rhetoric of Science",
    "fullname": "Rhetoric of Science",
    "info": "Relationship between rhetorical theory/science. Readings typically include works by rhetoricians, sociologists, historians, and philosophers on role that rhetoric/language play in establishing scientific claims.",
    "prereq": {}
  },
  {
    "uid": "002597",
    "code": "WRIT8011",
    "subject": "WRIT",
    "number": "8011",
    "honors": false,
    "writing": false,
    "name": "Research Methods",
    "fullname": "Research Methods in Writing Studies and Technical Communication",
    "info": "The primary objectives of this course are to provide students in the rhetoric and scientific & technical communication (RSTC) MA and PhD programs with an understanding of research literature and approaches in the field and help students gain insights into the arguments made by researchers. This course trains students in strategies for designing and developing their own research, and provides a groundwork in the field's most common approaches to gathering and analyzing data. Students also learn about the research of the RSTC graduate faculty and PhD alumni and complete a University-based course for ethics in human participants research. Upon completion of the course, students should be able to create a persuasive research proposal and justify the means of data collection, analysis, theory, and positioning of the project. ",
    "prereq": {}
  },
  {
    "uid": "790026",
    "code": "WRIT8012",
    "subject": "WRIT",
    "number": "8012",
    "honors": false,
    "writing": false,
    "name": "Applied Research Methods",
    "fullname": "Applied Research Methods in Writing Studies and Technical Communication",
    "info": "Introduction to one or two quantitative or qualitative research methods in scientific/technical communication or rhetoric (e.g., ethnography, case studies, discourse analysis).\n\nprereq: [grad student] or instr consent",
    "prereq": {}
  },
  {
    "uid": "788270",
    "code": "WRIT8333",
    "subject": "WRIT",
    "number": "8333",
    "honors": false,
    "writing": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)\n\nprereq: Master's student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "788406",
    "code": "WRIT8444",
    "subject": "WRIT",
    "number": "8444",
    "honors": false,
    "writing": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)\n\nprereq: Doctoral student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "002603",
    "code": "WRIT8505",
    "subject": "WRIT",
    "number": "8505",
    "honors": false,
    "writing": false,
    "name": "Professional Practice",
    "fullname": "Professional Practice",
    "info": "This course is designed to provide a class structure to assist graduate students in completing writing requirements and oral presentations associated with professional projects -- research, scientific writing, and associated reports -- as part of their graduate programs. Learning outcomes include the following: to foster advanced skills in writing and editing scientific and/or technical documents for various audiences; to design and develop research reports and related documents for graduate programs in scientific and technical communication and other technical disciplines; to understand and apply theoretical and research perspectives in scientific and technical communication to professional practice projects; to expand use of online tools for project development and management and data analysis; to enhance skills in oral presentation of scientific and/or technical research information; and to identify and reflect on the culture and value of professional practice from a disciplinary perspective.",
    "prereq": {}
  },
  {
    "uid": "002608",
    "code": "WRIT8510",
    "subject": "WRIT",
    "number": "8510",
    "honors": false,
    "writing": false,
    "name": "Seminar in Rhetoric",
    "fullname": "Seminar in Rhetoric",
    "info": "Topics may include theories, history, criticism, major figures, movements, visual or material rhetoric. Topics vary. See the Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "002610",
    "code": "WRIT8520",
    "subject": "WRIT",
    "number": "8520",
    "honors": false,
    "writing": false,
    "name": "Seminar Sci and Tech Com",
    "fullname": "Seminar in Scientific and Technical Communication",
    "info": "Topics may include theories, landmark studies, history, gender, ethics. Topics vary. See the Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "002612",
    "code": "WRIT8530",
    "subject": "WRIT",
    "number": "8530",
    "honors": false,
    "writing": false,
    "name": "Topic Fem Theory STC",
    "fullname": "Topics in Feminist Theory in Science, Technology, and Communication",
    "info": "Doctoral seminar on interaction of gender with science/technology. Topics vary. See Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "002613",
    "code": "WRIT8540",
    "subject": "WRIT",
    "number": "8540",
    "honors": false,
    "writing": false,
    "name": "Sem in tech com &comp pedagogy",
    "fullname": "Seminar in Technical Communication and Composition Pedagogies",
    "info": "Topics may include theories of pedagogy or research studies that inform the classroom or workplace, social and ethical concerns, landmark studies, current controversies. Topics vary. See the Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "007516",
    "code": "WRIT8550",
    "subject": "WRIT",
    "number": "8550",
    "honors": false,
    "writing": false,
    "name": "Seminar Tech Culture & Comm",
    "fullname": "Seminar in Technology, Culture, and Communication",
    "info": "Topics may include computer-mediated communication, democracy/technology, controversies over digital communication, privacy/ethical issues, feminist theory and interactions of gender with science and technology, communication in legal or medical settings. Topics vary. See the Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "803746",
    "code": "WRIT8560",
    "subject": "WRIT",
    "number": "8560",
    "honors": false,
    "writing": false,
    "name": "Seminar in Writing Studies",
    "fullname": "Seminar in Writing Studies",
    "info": "Topics may include literacy, genre, history of writing, narrative theory and practice, writing as textual practice. Topics vary. See the Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "788519",
    "code": "WRIT8666",
    "subject": "WRIT",
    "number": "8666",
    "honors": false,
    "writing": false,
    "name": "Doct Pre-Thesis Cr",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "Doctoral Pre-Thesis Credits\n\nprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": {}
  },
  {
    "uid": "002721",
    "code": "WRIT8775",
    "subject": "WRIT",
    "number": "8775",
    "honors": false,
    "writing": false,
    "name": "Rhetorical Theory",
    "fullname": "Classical Rhetorical Theory",
    "info": "Aristotle's \"Rhetoric\" in context of its times and of Aristotle's other works, especially \"The Ethics\" and \"The Politics.\"",
    "prereq": {}
  },
  {
    "uid": "788653",
    "code": "WRIT8777",
    "subject": "WRIT",
    "number": "8777",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": {}
  },
  {
    "uid": "798434",
    "code": "WRIT8792",
    "subject": "WRIT",
    "number": "8792",
    "honors": false,
    "writing": false,
    "name": "Ind Stud, Read, Research",
    "fullname": "Independent Study, Reading, and Research",
    "info": "Supervised study, reading, or research on projects not covered in regularly scheduled offerings.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "798435",
    "code": "WRIT8794",
    "subject": "WRIT",
    "number": "8794",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "Supervised research project.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "787927",
    "code": "WRIT8888",
    "subject": "WRIT",
    "number": "8888",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": {}
  },
  {
    "uid": "002620",
    "code": "WRIT8995",
    "subject": "WRIT",
    "number": "8995",
    "honors": false,
    "writing": false,
    "name": "Spec Prob in RSTC",
    "fullname": "Special Problems in Rhetoric and Scientific and Technical Communication",
    "info": "Research and readings on special problems or projects.",
    "prereq": {}
  }
]