[
  {
    "uid": "797905",
    "code": "YOST1001",
    "subject": "YOST",
    "number": "1001",
    "honors": false,
    "writing": false,
    "name": "Youth: Media & Scholarship",
    "fullname": "Seeing Youth, Thinking Youth: Media, Popular Media, and Scholarship",
    "info": "This course is an invitation to meet and engage with the field of Youth Studies. This is an introductory course to a subject you already know about – you’ve lived its content; thought about it; you may even written poems, made a video or posted a meme about this life-moment. Since you know this so well, why take a university course on it? You will leave this course better able to notice the young people around you; wonder about them and their lives; name, describe and analyze what you see and hear and read about youth. This course is about all young people. This means that we are attentive to including material about youth from diverse backgrounds, many ethnic/racial, social class, linguistic, and geographic locations or those who have a variety of physical and mental capacities, those who are “normal” and “typical” and those who are “not”. Together, we will examine myths and stereotypes about youth, where they come from, and how to deconstruct them using a variety of lenses-- social, popular and news media, young adult novels, academic articles, biographies, and more. We will do this through engaging class discussions and activities. You will learn how to use critical ethnography “in the field” where you will observe and write about youth in a variety of settings including malls, sporting events, busses, coffee shops, and music venues. We believe that an introductory college course is a space and time to reflect, analyze, and learn about what matters to you, about who you are and about the work others have done and what you want to do. In these ways, this course introduces ways of being an engaged and thoughtful student, citizen and professional, all of which require critical thinking skills and an ability to work across difference and diversity. In this course, students will develop skills in assessment, reflection/reflexivity, deconstruction, empathy and judgement; all precursors for professional decision-making in careers like youth work, policy, public health, education, communications, and other fields. We hope this course may lead to reflecting on your occupational future and vocational call.",
    "prereq": {}
  },
  {
    "uid": "816034",
    "code": "YOST1366",
    "subject": "YOST",
    "number": "1366",
    "honors": false,
    "writing": false,
    "name": "Stories of Resistance & Change",
    "fullname": "Stories of Resistance & Change: Youth, Race, Power & Privilege in the U.S.",
    "info": "This course imagines literature as an opportunity to complement other understandings of youth, and to help those who work with children and adolescents to better understand their lived experiences. We will read classic and contemporary literary texts that respond to the needs, wants, and existential questions that surround young people’s lives, and makes them visible to learners in the class who want to better understand children and adolescents in diverse settings across the United States. Youth Studies at the University of Minnesota, prepares students to work towards understanding and helping to improve the everyday lives of diverse youth. By being in this class, reading our course texts carefully, and by engaging in learning activities with classmates, students have the chance to take away new understandings from powerful stories about youth. In fact, the texts in this course contain important descriptions of how oppression looks and feels to young people as they navigate institutions and see the impacts of structural inequality on themselves, communities, families, and friends. The young people in these texts show tremendous agency, and show meaningful examples of resistance on large and small scales. We will work together with course texts about how young people challenge and are challenged by their surroundings, and take away new meanings about how young people have promoted social justice and change. \n\nLearning activities in this class will include reading, writing, quizzes and exams and a course project. In class learning activities include discussion, presentations, activities, and a high level of participation is expected. Why literature? Literature can be thought of as one way of knowing about the daily lives of youth. Because literature offers a rich detailed framework of meaning showing the diverse contexts of lives of children, teenagers and young adults, youth workers can use the tools of literature to make youth work meanings from literature in which young people are primary to the text. Literature can make up a new lens through which learners can understand the daily and everyday lives of youth, and can complement the important social science lenses you may already bring to the class. Students are encouraged to develop a new set of questions about youth as they use the formal tools of literature to read literary texts that represent a range of styles, formats, themes, and choices. Diversity and Social Justice Literature that centers on young people from multicultural settings offers an opportunity to think about what it is that students already know about youth from diverse backgrounds, and to question whether their understanding is correct or if there are gaps in knowledge. In other words, a course goal will be to identify epistemological gaps between what we think we know about youth, race, gender, and power and privilege, and how that is confirmed and/or made more complicated by a larger body of knowledge about social constructions of power and privilege. This course calls on our literary texts to challenge and deconstruct dominant narratives about youth and their communities. Learners in this course enter into an ongoing conversation about what social justice for youth means in the context of unequal distribution of power and constructions of privilege and oppression.",
    "prereq": {}
  },
  {
    "uid": "816283",
    "code": "YOST1368W",
    "subject": "YOST",
    "number": "1368",
    "honors": false,
    "writing": true,
    "name": "Youth Global Perspectives",
    "fullname": "Youth Global Perspectives",
    "info": "This course uses literature by a diverse array of global authors as a window into youth experience and representation. We identify dominant narratives constructed through education, culture, religion, and media, and examine how authors and readers offer counternarratives. We work within social justice and decolonizing frameworks to understand how global power relations and our own perspectives are shaped by U.S. and European imperialism. We embrace the liberatory and expressive possibilities of narrative, while also recognizing the constraints exercised by the publishing industry and English language dominance. Literature opens up conversations about the lived experiences of youth. It invites us to empathize with experiences beyond our own, and provides an opportunity to highlight how cultural contexts shape interpretation. Together we will read, reflect, and analyze global texts by, for, and about youth. Accountability for readings takes the form of quizzes and reading responses. Students build skills of critical analysis through writing assignments, examining the array of choices authors make and the impact they have on audiences. Class is structured as a collaborative and interactive experience, with an emphasis on small group activities and participation.",
    "prereq": {}
  },
  {
    "uid": "004912",
    "code": "YOST2001",
    "subject": "YOST",
    "number": "2001",
    "honors": false,
    "writing": false,
    "name": "The Everyday Lives of Youth",
    "fullname": "The Everyday Lives of Youth",
    "info": "Introduction to everyday lived experience of youth. Ways of knowing youth. Social/cultural foundations of youthwork. How to \"read\" life-worlds of young people. At least 15 hours of service learning required.",
    "prereq": {}
  },
  {
    "uid": "790636",
    "code": "YOST2002W",
    "subject": "YOST",
    "number": "2002",
    "honors": false,
    "writing": true,
    "name": "Intro YoSt Minor",
    "fullname": "Introduction to Youth Studies: Understanding Youth, Young People, Youthood, and Youth Work",
    "info": "Introduces youth studies minor. Prepares students for more in-depth departmental offerings and for continued scholarship or later work with youth, directly or on their behalf.",
    "prereq": {}
  },
  {
    "uid": "797892",
    "code": "YOST2101",
    "subject": "YOST",
    "number": "2101",
    "honors": false,
    "writing": false,
    "name": "Urban Youth and Youth Issues",
    "fullname": "Urban Youth and Youth Issues",
    "info": "This course explores issues faced by youth, especially those who live in or are characterized by our understanding of urban areas. We might begin by asking questions like “why aren’t youth in racially segregated and economically privileged urban areas of Minneapolis labeled “urban”, while poor immigrant youth in the suburban housing projects of Paris are,” “how did city planners and urban housing policy act to segregate and problematize some geographies and people” or “how are urban communities policed and what are the consequences of this policing”?\n\nWe will critically examine what the term “urban youth” means, how it has evolved over time and place and its use as a code word with implicit association and within this context how urban youth have been studied, problematized and worked with. Using a critical Youth Studies framework, which engages with the role of historical, social, cultural, geographical and political contexts, we seek to understand how each of these axes of power-relations influence the opportunities and struggles of young people, their interaction with institutions and the construction of their identities in particular places. We then seek to rethink new directions in research and practice and understand what this means for youth as citizens.",
    "prereq": {}
  },
  {
    "uid": "797904",
    "code": "YOST2241",
    "subject": "YOST",
    "number": "2241",
    "honors": false,
    "writing": false,
    "name": "Experiential Learning",
    "fullname": "Experiential Learning",
    "info": "Youth work is often described as \"highly experiential\" and transformative. But what does that mean? Youth workers understand, sometimes intuitively, that \"learning by doing\" makes sense, but why? Is all experience equally valid, moral, and educative? What makes an experience educative or mis-educative? What is the difference between experiential education and experiential learning? This course will explore a range of definitions given to experiential learning and will lay a sound theoretical foundation for understanding it, particularly in the context of youth work. \n\nThis class is interactive and uses hands-on and in-the-field learning in its instruction. In any given class, students may hike, rock climb, practice meditation, engage in animal therapy, canoe, visit gardens, outdoor STEM classrooms, or simply go on the lawn outside of the classroom in order to engage in youth-work “icebreakers” and “games.” The intention in this is to learn by doing and to learn about by simultaneously learning how to! Through experience, you will learn about the importance of place and history in experiential education; multiple theories and practices of experiential education, including the Learning Cycle Theory and educative and mis-educative experiences; methods of reflection and assessment, group facilitation, leadership skill development in youth; and values curiosity and the outdoors. ",
    "prereq": {}
  },
  {
    "uid": "788388",
    "code": "YOST3001",
    "subject": "YOST",
    "number": "3001",
    "honors": false,
    "writing": false,
    "name": "Intro Hist & Phil of Youthwork",
    "fullname": "Introduction to History & Philosophy of Youthwork",
    "info": "This course exposes students to a depth of perspectives on young people and youth work. Exploring various historic and philosophical origins of “normal” childhood, we unveil the way our modern understandings of child, youth, and adolescent draw upon a rich history of sexist, colonialist, and racist science. To do so we explore Indigenous, early European, Middle-Class, and W.E.I.R.D. (Western, Educated, Industrialized, Rich, Democratic) notions of childhood. We explore how these ideas are operationalized into practices on youth/youth work. We explore how contemporary organizations of American youth work and youth development, then took up and applied these ideas thus naturalizing modern norms and expectations of child and youth. This course covers the philosophical and historical foundations of youth work in a critical and interactive way through a review of youth, youth work, and youth organizations set in the context of the past 500 years. \n\nThe course is designed to encourage students to examine their familial histories, timelines, and geographies and through collaborative and interactive learning, begin to explore how these histories, combined with others, helped to shape the ways that we think about youth and how this thinking collectively shapes youth policy, practice, and the institutions within which we meet and work with young people. All of this with the goal of becoming more effective and thoughtful when working with young people in youth-work settings. Whether you choose to work in youth-work settings or in other human service organization or agency, developing a sense of cultural humility and skills to understand historical data, philosophical frames, and current practices will be critical to your success in professional arenas. \n\nPrior completion of YOST 2xxx is highly recommended.",
    "prereq": {}
  },
  {
    "uid": "788389",
    "code": "YOST3002",
    "subject": "YOST",
    "number": "3002",
    "honors": false,
    "writing": false,
    "name": "Observ Lab: Yth Develop Ythwrk",
    "fullname": "Observation Lab: Youth, Youth Development, and Youth Work",
    "info": "Field observation of young people. Field visits to youth programs.",
    "prereq": {}
  },
  {
    "uid": "788390",
    "code": "YOST3003",
    "subject": "YOST",
    "number": "3003",
    "honors": false,
    "writing": false,
    "name": "Theor Res Pract Observ Yth",
    "fullname": "Bridging Theories, Research, Practices, and Observations about Youth Development and Youth Work",
    "info": "Reflective seminar to carry out, at beginning level, guided reflection of one's/others' ideas, experiences, feelings about courses, self, youth work.",
    "prereq": {}
  },
  {
    "uid": "788391",
    "code": "YOST3004",
    "subject": "YOST",
    "number": "3004",
    "honors": false,
    "writing": false,
    "name": "Youth in Community Context",
    "fullname": "Youth in Community Context: Home, School, Neighborhood, Geography, Programs, Policies",
    "info": "Introduces community, sociocultural context of \"growing up,\" \"coming of age\" as primary site for healthy youth development. Community introduced also as home to youth agencies/programs along intervention continuum. How community-based cultural identity, social expectations of young people frame young people's roles in school, work, neighborhoods.",
    "prereq": {}
  },
  {
    "uid": "788549",
    "code": "YOST3005",
    "subject": "YOST",
    "number": "3005",
    "honors": false,
    "writing": false,
    "name": "Youth Work Field Experience",
    "fullname": "Youth Work Field Experience",
    "info": "Beginning fieldwork in student's field of interest (e.g., juvenile justice, adolescent pregnancy, outdoor learning). Beginning \"youth work.\" Includes eight hours per week of supervised direct work with youth in a community youth-serving organization.",
    "prereq": {}
  },
  {
    "uid": "788550",
    "code": "YOST3006",
    "subject": "YOST",
    "number": "3006",
    "honors": false,
    "writing": false,
    "name": "Field Seminar",
    "fullname": "Fieldwork Seminar: Youth, Youthworker, Context, Programs, Organizations, Place",
    "info": "Beginning youth work, youth agency, program, organization, service as found in students' youth work field experience.",
    "prereq": {}
  },
  {
    "uid": "788551",
    "code": "YOST3007",
    "subject": "YOST",
    "number": "3007",
    "honors": false,
    "writing": false,
    "name": "Integrative Seminar",
    "fullname": "Integrative Seminar: Analysis, Experience, Reflection on Youth Studies and Youth Work",
    "info": "Students integrate their two years of observation, analysis, experiences, and reflections about youth, youth work, youth programs. Work/career paths for beginning/advanced youth workers.",
    "prereq": {}
  },
  {
    "uid": "817714",
    "code": "YOST3011",
    "subject": "YOST",
    "number": "3011",
    "honors": false,
    "writing": false,
    "name": "Youth Social Change: Croatia",
    "fullname": "Young Voices: The Fight for Social Change in Croatia",
    "info": "This international immersion course explores the history, struggles, accomplishments, and experiences of Croatian young people who have engaged in social change efforts. Our focus will be on young people's involvement in a diverse range of social change movements and how these emerged, how they worked, and what caused them to decline.",
    "prereq": {}
  },
  {
    "uid": "797906",
    "code": "YOST3031",
    "subject": "YOST",
    "number": "3031",
    "honors": false,
    "writing": false,
    "name": "International Youthwork",
    "fullname": "International Youthwork",
    "info": "The purpose of this course is to introduce you to the lives of young people living outside of the US, foreign young people living here (immigrants and refugees), and work with both groups, directly and on their behalf. This course is part of our larger effort to include international content in our curriculum, both to prepare you for such work and as another way to reflect on practice in the U.S. Every effort will be made to focus classwork and course assignments on your interests.\n\nIt is commonplace to write or say that we live now in a global world, a globalized, interconnected economy, of instant audio, visual and electronic communication. This is true for many worldwide, while there are also enormous numbers of people living their everyday lives outside of, or on the margins of, this instant, interconnected and interdependent world. Many of these are young people, ages 12-22 (or older depending on local definitions of youth and adult).\n\nOur concern will be on these youth populations worldwide, and include analysis and reflection of the effects of these and related socioeconomic and cultural structures on the everyday lives of young people, as this varies by age, social class, race/ethnicity, sex, geography, language, capacity, sexual orientation and the like.\n\nBasic to our orientation is the belief that one cannot understand the everyday lives of young people, indeed individual young persons, without grasping their social, cultural, economic and political embeddedness in their local youth and adult worlds. Every individual lives somewhere at some time and this “hereness and thereness” have a history, meanings and understandings, which are sources of the unique individual: Each person is social and cultural, as well as psychological. Given this basic orientation, how might we go about understanding young people and their everyday lives if we don’t know their actual, everyday-life worlds?\n\nprereq: 2xxx or instr consent",
    "prereq": {}
  },
  {
    "uid": "797891",
    "code": "YOST3032",
    "subject": "YOST",
    "number": "3032",
    "honors": false,
    "writing": false,
    "name": "Adoles & Yth Dev for Ythwkers",
    "fullname": "Adolescent and Youth Development for Youth workers",
    "info": "In this course, we will explore the multitude of theories that have been proposed to describe, understand, and even explain young people in the second decade of life and beyond. Indeed, we will be studying development theories that have been used to explain your own life and experience. This gives us a unique perspective in the class. You have first-hand experience that can be used to interrogate the theories and often illustrate both the strengths and weaknesses of each. Over the course of the semester, we describe, discuss, and critique six theories of adolescent and youth development, including: Social Justice Youth Development, Participatory Youth Development, Community Youth Development, Positive Youth Development, Adolescent Development, and Recapitulation. We begin with the most recent theory and then using academic archeology, dig back through time to understand not only the individual theories but also how they connect and join to each other. Along the way, we also discuss the social and cultural events and situations that influenced each theory’s development and often demise. A major goal of this class is to better understand where these theories come from, what they are connected to, and often how they are used to both support and marginalize young people. \n\nClass will be interactive, using both small and large group discussion, experiential learning activities, and guest lecturers. The major assignment for the class is a grant writing project, where students will collaborate with a youth-serving organizing to develop a grant proposal that addresses the organization’s needs. This project will be used to deepen understanding of how to apply the theories we learn in class, as well as to develop skills around writing strong grant proposals for youth-serving organizations. \n\nPrior completion of YOST 1001 is highly recommended.",
    "prereq": {}
  },
  {
    "uid": "004282",
    "code": "YOST3101",
    "subject": "YOST",
    "number": "3101",
    "honors": false,
    "writing": false,
    "name": "Ythwk: Orientat's & Approaches",
    "fullname": "Youthwork: Orientations and Approaches",
    "info": "Within the U.S. there is an ongoing conversation about what values, knowledge, skills, and practice are basic to the field of youth work.  The occupational title, youth worker, is not widely recognized with a set of knowledge, skills, and attitudes that distinguish it from other occupations that work with young people (teacher, coach, social worker). Often youth worker is taken to signify those who “work with youth.” In recent years, there have been attempts to clarify and specify what a youth worker does, whom a youth worker should be, and how one should be educated for this type of work. These debates now occur within international and national movements to “professionalize” youth work.  In this course, we enter this conversation by considering the multiple ways of becoming, being a youth worker, and doing youth work.  Toward the end of the course, we will also explore how context—agency, street, and neighborhood—can have consequences on all three of these.\n\nTo be knowledgeable participants in these conversations you must know the possible answers to at least four questions. Who are young people? What is youth work?  Who are youth workers? Where is the location of the work? For each of these questions, we explore the diverse answers, given by scholars and practitioner, here in the United States and internationally. How one chooses to answer any one of these questions has consequences for the other three.\n\nAttention is also given to how you and I choose to answer these questions given our own experience of being a young person and our current interactions with young people. At the end of this course, you will be able to participate at a beginning level in the conversations that are of concern to youth work and enhance your direct work with, on behalf of, and/or for young people. In the process, you will have begun constructing and articulating a personal philosophy of youth work.\n\nprereq: YOST 3032",
    "prereq": {
      "and": [
        "797891"
      ]
    }
  },
  {
    "uid": "797908",
    "code": "YOST3234",
    "subject": "YOST",
    "number": "3234",
    "honors": false,
    "writing": false,
    "name": "Yo Agen Org Serv Sy",
    "fullname": "Youth Agencies, Organizations, and Youth Service Systems",
    "info": "Communities/governmental responses to young people as potential problems through agencies, programs, and other organizational forms. Purpose, structure, and activities of such forms. How the forms are/are not integrated into youth service systems.\n\nprereq: [Two soc/anth courses, work experience in youth [agency or org]] or instr consent",
    "prereq": {}
  },
  {
    "uid": "797792",
    "code": "YOST3235",
    "subject": "YOST",
    "number": "3235",
    "honors": false,
    "writing": false,
    "name": "Community Bldg & Civic Ythwk",
    "fullname": "Community Building, Civic Engagement, and Civic Youthwork",
    "info": "Young people are often described in polarizing ways: As “our future” or as dangerous and out of control.  Scholarship and practitioners have shown that these powerful social constructions depoliticize, disconnect, and disenfranchise young people from political process and spaces. Even today, few formal opportunities and pathways exist for young people to participate in civic and political activity, even with advanced practice understanding and programmatic models that can be replicated and “scaled down” to work in communities across the globe, from rural to urban.\n\nYet, young people have always been politically active.  Clear stories and scholarship documents the multitude of ways young people have been at the forefront of social change and social justice, and often led revolutions and social movements throughout the world. In the U.S. teenagers historically and currently make up a large percentage of activists on the streets and social change makers in the community.\n\nYoung people have a strong history of finding ways to express their voice on public issues that matter to them and participate in actions they believe will rectify wrongs and promote a more just and equitable future. Participating in these activities is not always seen as age appropriate activity. We are more comfortable seeing young people as “citizens-in-the-making,” and become increasingly uncomfortable when they\nbegin to think and act like citizens now!\n\nThis has not stopped young people from participating and youth workers from finding ways to support their political involvement and create opportunities for their civic and political action. This course introduces civic youth work as a form of community-based youthwork, to locate it in two frames – community-building for healthy youth development and youth civic engagement (citizenship), and show\nthe relations among the two.  Over the semester you will explore both underlying theories that support social change and participation as well as programmatic models that invite and sustain young people’s involvement in civic engagement and social change.\n\nprereq: [One basic course in Pol, one basic course in Soc] or instr consent",
    "prereq": {}
  },
  {
    "uid": "798189",
    "code": "YOST3240",
    "subject": "YOST",
    "number": "3240",
    "honors": false,
    "writing": false,
    "name": "Special Topics Youth Studies",
    "fullname": "Special Topics in Youth Studies",
    "info": "In-depth investigation of one area of youth studies. Teaching procedure/approach determined by specific topic and student needs. Topic announced in advance.",
    "prereq": {}
  },
  {
    "uid": "798583",
    "code": "YOST3291",
    "subject": "YOST",
    "number": "3291",
    "honors": false,
    "writing": false,
    "name": "Ind Study YoSt",
    "fullname": "Independent Study in Youth Studies",
    "info": "Independent reading or research under faculty supervision.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "809482",
    "code": "YOST3325W",
    "subject": "YOST",
    "number": "3325",
    "honors": false,
    "writing": true,
    "name": "Project-Based Writing",
    "fullname": "Project-Based Writing For Education and Human Development Majors",
    "info": "Designed for those CEHD learners who seek to fulfill the upper level writing intensive requirement in a way that is relevant to their major and field of study, this course will support you as you manage a larger writing project. Learners in this course will form a community of writers, as each grapples with the challenges of a major project focusing on a meaningful problem or issue in your field of study. Some of the most important and most challenging work you face as you near graduation in your major is the work of bringing your academic training to bear on current issues in your field of study. By focusing on project-based writing, this course supports undergraduate learners in the endeavor to delve into and contribute to the work being done in your field to address a particular problem. You will propose a project, identify an audience, tailor your work to address your audience’s needs, gather relevant information through primary and secondary research, and create a product that engages others and furthers the real-world work of solving problems. Collaborative activities and assignments will support you through the process. The course structure is flexible and designed to be responsive to individual needs and a variety of disciplinary contexts, so that students can receive feedback and guidance during different stages of capstone or thesis writing, or community engagement projects. Thus, you can anticipate that the majority of the work will focus on a project that you will propose based on your interests, needs, or connections to your writing work in your major. Course goals are to develop a writing process, understand the habits of writings, work through a larger research project, develop skill in the APA format, learn to use the University libraries, consider audience needs. In class work include: peer review, active learning activities designed around writing skill development, discussion, lecture, and presentation. Learners are expected to actively engage in the course material, participate in class, and give and receive feedback about writing. \n\nprereq: jr or sr level",
    "prereq": {}
  },
  {
    "uid": "790637",
    "code": "YOST4002W",
    "subject": "YOST",
    "number": "4002",
    "honors": false,
    "writing": true,
    "name": "Constr Pers Models of Yth",
    "fullname": "Constructing Personal Models of Youth Scholarship and Youth Work",
    "info": "Integrates/ends University-wide undergraduate youth studies minor. Students analyze/reflect on youth studies minor course content, especially those models, theories, and concepts presented in 2002. Youth, young people, youthhood, youth work. Models, personal responds to youth. Occupational/vocational callings. Class discussion, written assignments.",
    "prereq": {}
  },
  {
    "uid": "800655",
    "code": "YOST4196",
    "subject": "YOST",
    "number": "4196",
    "honors": false,
    "writing": false,
    "name": "Youthwork Internship",
    "fullname": "Youthwork Internship",
    "info": "This introduces students to the practice of youthwork and supports their professional development as a youth worker.  The goal is to explore how we can become reflexive and critical practitioners.  This is the required course for the Youth Studies major but is also open to students from other majors who want to explore the field of youthwork. Students can opt to pursue placement at a site already approved by the department or they can negotiate with the instructor to pursue an independent site. Using the University policy on undergraduate workload, the course hours are divided between seminar and in-site placement hours (requirements will not go beyond that of a typical 4 credit course). \n\nThe course requires students to participate in BOTH a weekly seminar and a supervised youthwork internship.  The focus in the seminar is on integrating knowledge and youthwork skills for entry-level professional work with young people including topics such as professional ethics, identities and current issues in youthwork practice.  The focus of the supervised fieldwork is on the experience of doing youthwork with real youth contextually and professionally teaches us about affecting change in the lives of young people.  \n\nThe Youth Studies program takes an interdisciplinary approach to youth work and youth development.  Students will integrate different ways of understanding youth into their direct practice.  The program also focuses on human rights and social justice.  This means accounting for and responding to the many ways discursive and institutional power operates to silence young people.  This includes the ways in which power structures what opportunities are available to young people of different genders, sexual orientation, ethnicities, race, classes, geographical locations, etc.  Our approach to understanding and responding to these issues is to attend to young people’s everyday lives and the idea of “youth-in-the-world.” The Youth Studies program expects students to be self-reflexive and engage in an analysis of power and privilege from a micro/personal perspective and a macro/ policy perspective.  Students will begin to craft responses to lessening these structures on the young people’s everyday lived experiences.  \n\nprereq: Declaration of youth studies major, or instr consent",
    "prereq": {}
  },
  {
    "uid": "811710",
    "code": "YOST4201",
    "subject": "YOST",
    "number": "4201",
    "honors": false,
    "writing": false,
    "name": "Facilitating Outdoor Exp's",
    "fullname": "Facilitating Outdoor Experiences",
    "info": "This course will explore the theory and practice of leading outdoor recreation experiences for young people. It is particularly focused on technical outdoor living skills, judgement and decision making, risk management/site management, instructional strategies in the outdoor classroom, and the application of the Experiential Education model. \n\nNOTE: Student will not receive credit if they have previously taken Rec 3321 or YoSt 3321.",
    "prereq": {}
  },
  {
    "uid": "811711",
    "code": "YOST4202",
    "subject": "YOST",
    "number": "4202",
    "honors": false,
    "writing": false,
    "name": "Facilit'ing Outdoor Exp-Winter",
    "fullname": "Facilitating Outdoor Experiences - Winter",
    "info": "This course will explore the theory and practice of leading outdoor recreation experiences for young people. It is particularly focused on technical outdoor living skills both general and specific to winter, judgement and decision making, risk management/site management, instructional strategies in the outdoor classroom, and the application of the Experiential Education model. \n\nNOTE: Student will not receive credit if they have previously taken Rec 3322 or YoSt 3322.",
    "prereq": {}
  },
  {
    "uid": "798584",
    "code": "YOST4301",
    "subject": "YOST",
    "number": "4301",
    "honors": false,
    "writing": false,
    "name": "Comm Adolescent Sexuality",
    "fullname": "Communicating with Adolescents About Sexuality",
    "info": "This course will provide participants with increased knowledge and practical skills to communicate sensitively and effectively with young people and their concerned persons about sexuality. Participants will explore a variety of adolescent sexual issues with a focus on healthy adolescent relationships, sexual development, gender, sexual orientation, and diversity. With this perspective as a base, other topics will include body image, laws regarding teens, sexual health and disease, dating and sexual violence, sexuality and cyberspace, and professional and ethical boundaries in working with youth. We will often analyze all of these issues through the lens of the various community/cultural, scientific and political debates that surround the issue of sexual health education here in the United States and abroad. Pertinent theory, research, strategies, and experience will be reviewed using readings, video, online resources, interactive web sites, and participant interaction in a safe, sensitive, and even fun atmosphere.",
    "prereq": {}
  },
  {
    "uid": "800583",
    "code": "YOST4314",
    "subject": "YOST",
    "number": "4314",
    "honors": false,
    "writing": false,
    "name": "Theatre Activities",
    "fullname": "Theater Activities in Youthwork and Education",
    "info": "Empowering methods of personal/creative development using experiential learning and theater activities to enhance creativity/imagination. Approaches to working with youth in school and youth agency settings. Experiential learning, improvisational theater theory/practice.\n\nprereq: 1001 or 2101",
    "prereq": {
      "or": [
        "797905",
        "797892"
      ]
    }
  },
  {
    "uid": "797909",
    "code": "YOST4315",
    "subject": "YOST",
    "number": "4315",
    "honors": false,
    "writing": false,
    "name": "Youthwork in Schools",
    "fullname": "Youthwork in Schools",
    "info": "Most young people (12-18 years) in the U.S. spend at least 6 hours per day for at least 6 years in a school building, doing “school work.” There, they are students, and participate in adult-designed classes, in co-curricular activities such as clubs and teams and in youth-formed worlds and social groups. Typically, educators learn some about adolescent development and psychology, about what is typical and common of young people in middle and high school. Professional staff learn to read and understand these youth primarily as students and less so as full, complex, individuals. This course intends to enrich the knowledge of school professionals in two ways: \nOne contribution will be centered on young people and their life-worlds, in school, outside and between the two, e.g. family, work lives, play lives, spiritual lives, friendship lives, etc. The second is a focus on youthwork as a craft orientation and occupation. In this view, most professional educators can approach some of their work as youthworkers, and they can work with designated youthworkers from the school and community agencies to reimagine the relationship and power dynamics between young people and adults in schools. The goals are more effective partnership with young people through deeper understanding of them as human beings and not just students. \n\nPrior completion of into course in education or youth studies is highly recommended.",
    "prereq": {}
  },
  {
    "uid": "800656",
    "code": "YOST4316",
    "subject": "YOST",
    "number": "4316",
    "honors": false,
    "writing": false,
    "name": "Media and Youth",
    "fullname": "Media and Youth: Learning, Teaching, and Doing",
    "info": "This interactive course will introduce interested youth workers to media as a tool for working with youth. It will review the theory and contemporary context of youth media practice. It will showcase exemplar youth media organizations from diverse communities and will introduce and provide hands-on practice with various forms of youth media.\n\nThis class will focus on a theoretical framework of critical media literacy (CML). CML equips young people with opportunities and resources necessary for them to critically analyze, use, and produce various forms of media. Like traditional notions of literacy, critical media literacy depends on two interdependent components: analysis and production. \n\nIn terms of analysis, media literacy is the ability to sift through and analyze the messages that inform, entertain, and sell to youth every day. It is the ability to bring critical thinking skills to bear on all aspects of media— from online news outlets and podcasts to Facebook algorithms and the  shrinking ownership of mass media. In terms of production, the course will provide exposure to and an an opportunity to engage technical skills, artistic expression, contribute to public dialogue, and to experience how young people are contributing to their worlds through youth media projects like: murals, graffiti, spoken word, music, documentaries, magazines, public service announcements, and digital storytelling.\n\nPrior completion of YOST 1001 is highly recommended.",
    "prereq": {}
  },
  {
    "uid": "800657",
    "code": "YOST4317",
    "subject": "YOST",
    "number": "4317",
    "honors": false,
    "writing": false,
    "name": "Youth Work in Contested Spaces",
    "fullname": "Youth Work in Contested Spaces",
    "info": "How does youth work change in contested spaces?  Do youth workers require different competencies to work in a “world that has been made strange through the desolating experience of violence and loss?”  This course continually revisits these questions as we read about, research within, and talk to others who have worked in contested spaces. The course ends by describing and developing an understanding of youth work in current and post-violently divided societies internationally, such as Northern Ireland, Palestine, South Africa, and India. Veena Das’ work in India around social suffering will be used to frame the work and understand the overall aims and goals of community-based youth work in such places. Indeed, youth work in contested spaces began in these worlds marked by suffering, loss, and a legacy of violence.  One purpose of the course is to explore youth work practice in contexts marked by suffering, loss, and violence.\n\nDuring the first two thirds of the course, we begin to understand how contested spaces exist all around us, some that we are well aware of because we also experience and are shaped by them, and others that exist only slightly further away from our own personal experience. To gain a deeper understanding of what it is like to work in contested space, students and faculty will talk with and visit different organizations and people working in different “contested spaces.”  Over two weeks we will talk with community members and young people to gain insight into how contested spaces provides background and context for growing up, what major issues young people face living and growing up in this space, and what work is currently going on to address the contested nature of the community.\n\nThe course also supports an autobiographical turn, asking students to begin to reflect on, and understand the contested spaces that they too were a part of, either as victim or instigator. We end the course by analyzing the data we have collected on the neighborhood, our own personal experience of contested spaces, and searching for themes and touchstones to guide youth work in such spaces. ",
    "prereq": {}
  },
  {
    "uid": "797793",
    "code": "YOST4319",
    "subject": "YOST",
    "number": "4319",
    "honors": false,
    "writing": false,
    "name": "Youth Subcultures",
    "fullname": "Understanding Youth Subcultures",
    "info": "The purpose of this course is to introduce the ideas of youth subculture(s), youth worlds and youth lifestyles and to show how these can be useful in thinking about and developing youth policy, youth programs and services, and in direct youth work, as well as in research about youth and young people. All are crucial frames for understanding youth who typically act, dress, talk, and otherwise do their everyday lives in ways which disclose membership in groups and larger worlds. To understand young people is to understand their everyday worlds, and (sub)culture and world are approaches to both.\n\n(Sub)culture and world are powerful frames for understanding the very idea of youth and the related ideas of being and doing youth as a young person. This is so even though subculture as a frame is under intense academic scrutiny. These ideas are also useful for understanding youth populations, small groups of youth and individual young persons. It complements and broadens psychological and developmental perspectives by giving these context, while helping locate youth-ness in a world beyond the self. The self is cultural, as much as social and psychological, spiritual (and philosophical). So too is identity.\n\t\nThe focus of much youth policy, program(s) and service(s) is the individual or small groups of youth, i.e. a group of individuals. An alternate angle and focus is youth subculture(s) and worlds, e.g. gang subculture, sports subcultures, drug subcultures, “street” subcultures, and the like, where the group of individuals is seen in a context of culture – a social group living a ‘way of life,’ thinking, talking, dressing, playing and making sense in more or less common ways. Middle and senior high schools are cultural worlds where “hicks,” “geeks,” “preps,” “skaters,” “jocks,” “emos,” and the like are ways of action, dress, speech, and relationships which correlate, even predict, school performance, pregnancy and drug use rates, drop-outs and the like. How is this knowledge used to enhance healthy youth development, and, if not so used, why not? For example, consider co-creating a deviant world in a high school made up of non-drug users, or alternate pathways for peer recognition outside of sports; or co-create a “sanctuary” in a world of tension and fear. Would we come to these alternatives if we did not understand the notions of youth world, youth life-styles, youth subcultures?\n\nDuring times of deep economic and political, institutional and structural change, as now, youth emerge as one population who can symbolize our despair, as well as our hope. Often youth are treated as a blank screen upon which adults project their fears and anxieties about their own changing worlds. During such times of socioeconomic and sociopolitical changes, there are also “moral panics,” and in these, youth are often seen as “folk devils” and demonized. To them is attributed much that is wrong with society. Indeed, they can be called a (the) source of “our problems.” We are now in such a period of tumultuous social change and moral panic, with its predictable calls for “old values,” “family values,” “patriotism,” “community,” and the like. Subcultures, worlds, and lifestyles help us to understand the timing, compelling need for, and the content of these calls and to anticipate the consequences of proposed actions on conceptions of youth and on actual young people. The absence of youth political groups and subcultures in the United States may suggest why youth continue to be vulnerable to these calls for more adult control over how and where this chronological age is lived.\n\nThis is a course about all young people – all social classes, races/ethnicities, genders, sexual orientations, abilities, and places. This is not negotiable.",
    "prereq": {}
  },
  {
    "uid": "798585",
    "code": "YOST4321",
    "subject": "YOST",
    "number": "4321",
    "honors": false,
    "writing": false,
    "name": "Converse & Relate with Youth",
    "fullname": "Conversational and Relational Practices with Young People",
    "info": "This course is organized as a conversation lab where students “try on”—in class in person, in real time, with other students as conversational partners—specific conversational practices that are rooted in an ethic of relational care and dialogical approaches to youth work.  \n\nThis course is designed to give students concepts and practices for doing youth work in a wide range of settings with individual youth. The focus will be on cultivating and expanding students’ capacities for working with youth from an ethic of relational engagement and cultural responsiveness. This ethic is a relational stance that youth workers take, whether they are mentoring a youth in a Big Brother/Big Sister program, providing medical case management to HIV+ youth, doing programming at a community center, facilitating outdoor activities, leading arts-based youth programs, leading camp activities, or passing out condoms and toothbrushes as a street outreach worker.\n\nEmphasis is on taking up a reflexive practice that considers multiple perspectives; that accounts for the influence of prevailing cultural discourses that influence youth, youth workers, and their relationships; and that commits to the generating of multiple possibilities. We will approach youth work as a political act that requires workers to articulate an ethical stance when engaging with young people. \n\nPrior completion of YOST 1001 or 2101 is highly recommended.",
    "prereq": {}
  },
  {
    "uid": "798586",
    "code": "YOST4322",
    "subject": "YOST",
    "number": "4322",
    "honors": false,
    "writing": false,
    "name": "Work with Youth: Families",
    "fullname": "Work with Youth: Families",
    "info": "Young people develop in moments and interactions (Krueger, 1998). Many of their moments occur within families, and families come in a wide variety of forms. The American Academy of Family Physicians locates family as, “a group of individuals with a continuing legal, genetic, and/or emotional relationship. Society relies on the family group to provide for the economic and protective needs of individuals, especially children and the elderly (1984, 2003). The stories, behaviors, dynamics, attitudes, and habits of families shape the identity and experience of young people. To understand and respect young people, and to participate in the creation of environments for healthy youth development, youth workers must learn how to understand and respect the role their families play in their everyday lives. \n\nThis course introduces students to the social construct of “family” as it intersects with traditional notions of adolescent development, their own experience, public policy, and youth work practice. Care is taken to honor the rich diversity of family structures found in the United States today, and to notice the impact cultural identity, economic status, education, ethnicity, gender, geography, and other important factors have on the nature of families and the experience of young people inside them. \n\nPrior completion of YOST 1001 or 2101 is highly recommended.",
    "prereq": {}
  },
  {
    "uid": "798587",
    "code": "YOST4323",
    "subject": "YOST",
    "number": "4323",
    "honors": false,
    "writing": false,
    "name": "Work with Youth - Groups",
    "fullname": "Work with Youth: Groups",
    "info": "Humans are social creatures.  Throughout the evolution of the human species, the “group” has been instrumental in survival and the transmission of culture between generations.  It is generally accepted that the “group” is a key building block of the human experience and it has been argued that the “individual” only knows itself in relation to the “group”.\n\nBecause of its fundamental nature in human existence, the group has been a popular topic of study.  Until recently, attempts to chronicle the phenomena of groups have been hampered by a “reductionistic” framework.  This attempt to reduce complex phenomena into small measurable parts to be studied has inhibited the ability to capture the “systemic” nature of groups.  The power of the group is the dynamic interaction and interrelation of its component parts.  Advances in general systems and chaos theory have increased our ability to fully grasp the essence of a group.\n\nThere is a difference between group process and group work.  Group processes are naturally occurring phenomena present when a collection of individuals form around a purpose.  Group work is the purposeful and intentional effort on the part of a practitioner to use group process to achieve a goal.  This demands that the practitioner develop a working understanding of group process and develop the skills to effect group functioning.\n\nNumerous group work models have been developed to describe group process and subsequently prescribe the role of the practitioner as facilitator. Although group work’s heritage is tied to the field of Social Work, the preponderance of these models are based upon a therapeutic framework.  Currently, the field of Youth Development is utilizing a solution-oriented participant centered perspective.  This perspective is more in line with the early understanding of group work and is proving to be effective in helping youth develop the skills, knowledge, and attitudes to be successful.\n\nThere are a number of challenges for the practitioner serious about developing their group work ability when working with youth:\n1. Whereas developing an understanding of group process may be obtained in a classroom setting, facilitation skills are best learned and honed through experience in real life settings.  Group work is both a science and an art.\n2. Not only must a practitioner develop a working understanding of groups, they must also have a working understanding of individuals because of the dynamic interplay between individual needs and group phenomena.\n3. The developmental needs of youth dictate that the practitioner's role in working with groups of youth is different than if they were working with adults. \n4. It is virtually impossible to be objective in working with people: a practitioner's own \\\"life history\\\" acts as a lens and filter that influences their interpretation of and strategies for interacting with the group.  This is especially true in youth work where the practitioner, through interaction with youth, is confronted with their own adolescence.\n\nprereq: [1001, 4321 or 4322] or instr consent",
    "prereq": {
      "or": [
        "797905",
        "798585",
        "798586"
      ]
    }
  },
  {
    "uid": "800584",
    "code": "YOST4324",
    "subject": "YOST",
    "number": "4324",
    "honors": false,
    "writing": false,
    "name": "Peer Helping",
    "fullname": "Peer Helping: The Theory and Practice of Youth Helping Youth",
    "info": "Experientially-based course. Starting/improving a peer helping program in schools or community-based organizations. Basic theory/concepts, program organizational issues, experiential student training, adult leadership skills.",
    "prereq": {}
  },
  {
    "uid": "800667",
    "code": "YOST4325",
    "subject": "YOST",
    "number": "4325",
    "honors": false,
    "writing": false,
    "name": "Practical Program Evaluation",
    "fullname": "Improving Everyday Youthwork: Practical Program Evaluation",
    "info": "Program evaluation can enable youth workers to improve the work they do with young people, to financially sustain their work, to communicate with colleagues in a community of practice with the intention of strengthening the youth work field, and to influence youth policy, program design, and practice.\n\nMany people who invest time or money in youth programs request program evaluation. As the emphasis on quality continues, youth workers will be expected to support evaluation, at minimum, and may also be asked to manage evaluation projects, either working with an internal or external evaluator, or doing evaluation as part of their job. Youth work positions now typically include these roles, regardless of settings. Evaluation can support ongoing professional development for youth workers. This course emphasizes how evaluation and applied research supports professional development and strengthens overall quality in youth programs. Evaluation and applied research provide frameworks and tools that support youth workers to describe, analyze, synthesize, and better understand how they can create high quality programs and support high quality practice for all young people. Evaluation is considered as both a tool—and a site for—critically examining issues of equity and social justice. The course includes readings and discussion on the social justice implications of evaluation and explores culturally responsive evaluation frameworks. During the feedback process for each stage of evaluation, a social justice lens is used to examine and critique the stage’s process and outcomes. \n\nThis course offers an introduction to evaluation and applied research for youth workers, through introducing evaluation and applied research concepts, terms, orientations, methods, and tools and their application. During the course, students (individually and in small and large groups) will design, carry-out, and report on an evaluation study. Students will both learn about evaluation and applied research as well as do it! By course conclusion, students will have the knowledge and skills to design and conduct beginning level evaluation and applied research, for their own practice or other youth programs. ",
    "prereq": {}
  },
  {
    "uid": "797795",
    "code": "YOST4401W",
    "subject": "YOST",
    "number": "4401",
    "honors": false,
    "writing": true,
    "name": "Spirituality & Youth Work",
    "fullname": "Young People's Spirituality and Youth Work: An Introduction",
    "info": "The purpose of this course is to explore the topic of spirituality and its importance to youth work practice. Spirituality has typically been thought to be the province of religious instruction or faith-based youth work. The premise of our inquiry is that humans are quite naturally spiritual, and that human development in young people includes spiritual development. Spiritual (sometimes called “religious”) traditions and practices seek to give shape, language, and expression to human-spiritual life. It is helpful for youth workers to have knowledge of the traditions that young people are part of. We will take time to learn from one another about the diversity of traditions among us and our experiences. Yet our focus will be on common human experience and development that people increasingly recognize as “spiritual.”\n\nIn recent decades, researchers have begun to focus on spirituality among adolescents. This conversation across disciplines in the academy raises important issues for practitioners. How will new research findings confirm or challenge their experience? How will new research impact everyday practice? This course enters the spaces of social, political, cultural, and religious institutions and practices, illuminating issues, topics, problems, and concerns for those who work with youth directly and or on their behalf. We will consider what youth work practices are most respectful of, and best able to facilitate spiritual development of young people in their everyday lives. \n\nAs an undergraduate writing intensive course, all undergraduate students will be expected to write frequently and use a variety of writing styles: autobiographical, journal/book critique, essay, field mapping/observation notes, and research in APA style. Students will be given feedback on each assignment, and regular class time will be devoted to writing skills and basic grammar.  ",
    "prereq": {}
  },
  {
    "uid": "797796",
    "code": "YOST4402",
    "subject": "YOST",
    "number": "4402",
    "honors": false,
    "writing": false,
    "name": "Youth Policy",
    "fullname": "Youth Policy: Enhancing Healthy Development in Everyday Life",
    "info": "Youth policy as formulated in response to youth issues, problems, and community/public concerns. Policy as political response to youth panics, as indirect youthwork, and as a community's moral compact with its young people. Perspectives explored are specific to student interests.\n\nprereq: [1001, 2002W] or instr consent",
    "prereq": {
      "and": [
        "797905",
        "790636"
      ]
    }
  },
  {
    "uid": "800658",
    "code": "YOST4403",
    "subject": "YOST",
    "number": "4403",
    "honors": false,
    "writing": false,
    "name": "Indirect Youthwork",
    "fullname": "Indirect Youthwork: Working on Behalf of Young People",
    "info": "Program development/management, policy, and social/community action, all directed at enhancing status of young people. Examining/advocating for particular sociopolitical, economic, and cultural definitions/understandings of young people.\n\nprereq: [[1001 or 2101], 3234] or instr consent",
    "prereq": {
      "and": [
        {
          "or": [
            "797905",
            "797892"
          ]
        },
        "797908"
      ]
    }
  },
  {
    "uid": "797893",
    "code": "YOST4411",
    "subject": "YOST",
    "number": "4411",
    "honors": false,
    "writing": false,
    "name": "Youth Research & Yth Prog Eval",
    "fullname": "Youth Research and Youth Program Evaluation",
    "info": "This course starts with the idea that research should be conducted inside and outside the walls of academia. At a basic level, youth workers conduct research everyday – even if they don’t consider it “formal” research. We all have questions about what is going on in the everyday lives of young people – and we all seek deeper understanding. Given that, there may be an ethical requirement to carefully consider the data used to understand young people. Historically and currently, research with young people is being “done to” and “not with” young people. And often, that data is used to both shape our perceptions of what it is to be a young person and the policies that affect their daily lives. For example, consider what data on emotional regulation is commonly used and how that has shaped suspension policies in schools? Youth workers are often advocates for youth, but they may not consider research about young people as places for action and resistance. \n\nStudents will begin class by exploring the purpose, definitions and methods of research most commonly used in youth work, with an emphasis on qualitative research as a process highly relevant to daily practice. Students will review a variety of perspectives on research that encourage a more critical eye on subjectivity, the social/political contexts around data, and the acknowledgement from indigenous research methods that a researcher must articulate their relationship to the research question. This course will then move students through a full research experience from a problem to questions, from purpose to methods, towards data collection, analysis, writing, and presentation, as a beginning researcher. Quite a challenge, so expect it to be imperfect and messy. \n\nBy the end of the semester, students are not expected to complete a flawless research design and report but to gain a deeper understanding of the research process, how to conduct and critique the process, and how to engage others to create potential change based on data. In practical terms, most students will work in a small group to determine research questions, develop a process for gathering data about the questions, analyze the data, and create a report based on the findings. The process will be supported by readings, activities during class time, and through highly focused consultations with research groups with faculty. ",
    "prereq": {}
  },
  {
    "uid": "817673",
    "code": "YOST5011",
    "subject": "YOST",
    "number": "5011",
    "honors": false,
    "writing": false,
    "name": "Youth Social Change: Croatia",
    "fullname": "Youth Voices: The Fight for Social Change in Croatia",
    "info": "This international immersion course explores the history, struggles, accomplishments, and experiences of Croatian young people who have engaged in social change efforts. Our focus will be on young people's involvement in a diverse range of social change movements and how these emerged, how they worked, and what caused them to decline.",
    "prereq": {}
  },
  {
    "uid": "817716",
    "code": "YOST5030",
    "subject": "YOST",
    "number": "5030",
    "honors": false,
    "writing": false,
    "name": "Youth Social Change: Croatia",
    "fullname": "Youth Voices: The Fight for Social Change in Croatia",
    "info": "This international immersion course explores the history, struggles, accomplishments, and experiences of Croatian young people who have engaged in social change efforts. Our focus will be on young people's involvement in a diverse range of social change movements and how these emerged, how they worked, and what caused them to decline.",
    "prereq": {}
  },
  {
    "uid": "004918",
    "code": "YOST5031",
    "subject": "YOST",
    "number": "5031",
    "honors": false,
    "writing": false,
    "name": "International Youthwork",
    "fullname": "International Youthwork",
    "info": "Lives of young people living outside the United States and of immigrants/refugees now resident in this country. Working with and on behalf of such groups. Socio-political analysis of globalization. Its impact on young people, youthwork, and youth policy worldwide.\n\nprereq: 2xxx or instr consent",
    "prereq": {}
  },
  {
    "uid": "005381",
    "code": "YOST5032",
    "subject": "YOST",
    "number": "5032",
    "honors": false,
    "writing": false,
    "name": "Adoles & Yth Dev for Ythwkers",
    "fullname": "Adolescent and Youth Development for Youthworkers",
    "info": "In this course, we will explore the multitude of theories that have been proposed to describe, understand, and even explain young people in the second decade of life and beyond. Indeed, we will be studying development theories that have been used to explain your own life and experience. This gives us a unique perspective in the class. You have first-hand experience that can be used to interrogate the theories and often illustrate both the strengths and weaknesses of each. Over the course of the semester, we describe, discuss, and critique six theories of adolescent and youth development, including: Social Justice Youth Development, Participatory Youth Development, Community Youth Development, Positive Youth Development, Adolescent Development, and Recapitulation. We begin with the most recent theory and then using academic archeology, dig back through time to understand not only the individual theories but also how they connect and join to each other. Along the way, we also discuss the social and cultural events and situations that influenced each theory’s development and often demise. A major goal of this class is to better understand where these theories come from, what they are connected to, and often how they are used to both support and marginalize young people. \n\nClass will be interactive, using both small and large group discussion, experiential learning activities, and guest lecturers. The major assignment for the class is a grant writing project, where students will collaborate with a youth-serving organizing to develop a grant proposal that addresses the organization’s needs. This project will be used to deepen understanding of how to apply the theories we learn in class, as well as to develop skills around writing strong grant proposals for youth-serving organizations.\n\nPrior completion of YOST 1001 is highly recommended.",
    "prereq": {}
  },
  {
    "uid": "004998",
    "code": "YOST5101",
    "subject": "YOST",
    "number": "5101",
    "honors": false,
    "writing": false,
    "name": "Youthwork Prac I",
    "fullname": "Youth Work Practice I: Internship",
    "info": "First course of a sequential internship that includes 15 hours per week working with youth in a community youth-serving organization. Develop and enhance competence and identity as a youth worker, and reflect on and integrate knowledge about youth with on-going experience in youth work.",
    "prereq": {}
  },
  {
    "uid": "005000",
    "code": "YOST5102",
    "subject": "YOST",
    "number": "5102",
    "honors": false,
    "writing": false,
    "name": "Youthwork Prac II",
    "fullname": "Youth Work Practice II: Internship",
    "info": "Second course of a sequential internship that includes 15 hours per week of work with youth in a community youth-serving organization. Develop and enhance competence and identity as a youth worker, and reflect on and integrate knowledge about youth with ongoing experience in youth work.",
    "prereq": {}
  },
  {
    "uid": "004914",
    "code": "YOST5111",
    "subject": "YOST",
    "number": "5111",
    "honors": false,
    "writing": false,
    "name": "Youthwork Methods I",
    "fullname": "Youth Work Methods I: Seminar",
    "info": "Weekly discussion seminar taken concurrently with 5101 to integrate theory and praxis with youth work experience. Written and experiential assignments to increase knowledge, competency, and skills related to working with youth.",
    "prereq": {}
  },
  {
    "uid": "004916",
    "code": "YOST5112",
    "subject": "YOST",
    "number": "5112",
    "honors": false,
    "writing": false,
    "name": "Youthwork Meth II",
    "fullname": "Youth Work Methods II: Seminar",
    "info": "Weekly discussion seminar taken concurrently with 5102 to integrate theory and praxis with youth work experience. Written and experiential assignments to increase knowledge, competency, and skills related to working with youth.",
    "prereq": {}
  },
  {
    "uid": "005404",
    "code": "YOST5234",
    "subject": "YOST",
    "number": "5234",
    "honors": false,
    "writing": false,
    "name": "Youth Agencies Orgs & Serv Sys",
    "fullname": "Youth Agencies, Organizations, and Youth Service System",
    "info": "Communities and governmental responses to young people as potential problems through agencies and programs and other organizational forms. Purpose, structure, and activities of such forms. How forms are/are not integrated into youth service systems.\n\nprereq: [Two soc/anth courses, work experience in [youth agency or org]] or instr consent",
    "prereq": {}
  },
  {
    "uid": "005180",
    "code": "YOST5235",
    "subject": "YOST",
    "number": "5235",
    "honors": false,
    "writing": false,
    "name": "Comm Bldg & Civic Youthwork",
    "fullname": "Community Building, Civic Engagement, and Civic Youthwork",
    "info": "Reciprocities between youth development and community development brought about by young people's civic engagement. Individual, social, and political change by/for young people and their community.\n\nprereq: [2001, one basic course in Pol, one basic course in Soc] or instr consent",
    "prereq": {
      "and": [
        "004912"
      ]
    }
  },
  {
    "uid": "004992",
    "code": "YOST5240",
    "subject": "YOST",
    "number": "5240",
    "honors": false,
    "writing": false,
    "name": "Spec Topics Youth Studies",
    "fullname": "Special Topics in Youth Studies",
    "info": "In-depth investigation of one area of youth studies. Teaching procedure and approach determined by specific topic and student needs. Topic announced in advance.\n\nprereq: Two social sci courses, exper working with youth or instr consent",
    "prereq": {}
  },
  {
    "uid": "004993",
    "code": "YOST5241",
    "subject": "YOST",
    "number": "5241",
    "honors": false,
    "writing": false,
    "name": "Experiential Lrng",
    "fullname": "Experiential Learning",
    "info": "History/theory of experiential learning, its application in youthwork. Observation, reflection, program design, and evaluation skills grounded in experiential learning theory.  15 hours of field observation required.",
    "prereq": {}
  },
  {
    "uid": "014383",
    "code": "YOST5291",
    "subject": "YOST",
    "number": "5291",
    "honors": false,
    "writing": false,
    "name": "Ind Study in Youth Studies",
    "fullname": "Independent Study in Youth Studies",
    "info": "Independent reading and/or research under faculty supervision.",
    "prereq": {}
  },
  {
    "uid": "005423",
    "code": "YOST5301",
    "subject": "YOST",
    "number": "5301",
    "honors": false,
    "writing": false,
    "name": "Comm Adolescents & Sexuality",
    "fullname": "Communicating With Adolescents About Sexuality",
    "info": "The course will provide participants with increased knowledge and practical skills to communicate sensitively and effectively with adolescents and their concerned persons about sexuality. Participants will explore a variety of adolescent sexual issues with a focus on healthy adolescent relationships, sexual development, gender, sexual orientation, and diversity. With this perspective as a base, other topics will include laws regarding teens, disease concerns, dating and sexual violence, and professional and ethical boundaries in working with youth. We will often analyze all of these issues through the lens of the various community/cultural, scientific and political debates that surround the issue of sexual health education here in the United States and abroad. Pertinent theory, research, strategies, and experience will be reviewed using readings, video, online resources, interactive web sites, and participant interaction in a safe, sensitive and even fun atmosphere.\n\nprereq: graduate student",
    "prereq": {}
  },
  {
    "uid": "005181",
    "code": "YOST5313",
    "subject": "YOST",
    "number": "5313",
    "honors": false,
    "writing": false,
    "name": "Dir Wrk Adolecents",
    "fullname": "Direct Work with Adolescents",
    "info": "Designed to give an understanding of direct work with troubled and at-risk adolescents in a wide range of settings where youth workers or social workers are typically involved. Emphasis on young people in groups in the \"lifespace\" in everyday life, rather than in one-to-one office-based interactions.",
    "prereq": {}
  },
  {
    "uid": "800668",
    "code": "YOST5314",
    "subject": "YOST",
    "number": "5314",
    "honors": false,
    "writing": false,
    "name": "Theatre Activities in Youthwrk",
    "fullname": "Theatre Activities in Youthwork and Education",
    "info": "Using experiential learning and theater activities to enhance creativity and imagination of youth workers and educators. Approaches to working with youth in school and agency settings. Application of experiential learning and improvisational theater theory/praxis.\n\nprereq: 1001 or 2101",
    "prereq": {
      "or": [
        "797905",
        "797892"
      ]
    }
  },
  {
    "uid": "797910",
    "code": "YOST5315",
    "subject": "YOST",
    "number": "5315",
    "honors": false,
    "writing": false,
    "name": "Youthwork in Schools",
    "fullname": "Youthwork in Schools",
    "info": "Most young people (12-18 years) in the U.S. spend at least 6 hours per day for at least 6 years in a school building, doing “school work.” There, they are students, and participate in adult designed classes, in co-curricular activities such as clubs and teams and in youth-formed worlds and social groups. Typically, educators learn about adolescent development and psychology, about what is typical and common of young people in middle and high school. Professional staff learn to read and understand these youth primarily as students and less so as full, complex, individuals. This course intends to enrich the knowledge of school professionals in two ways: \n\nOne contribution will be centered on young people and their life-worlds, in school, outside and between the two, e.g. family, work lives, play lives, spiritual lives, friendship lives, etc. The second is a focus on youthwork as a craft orientation and occupation. In this view, most professional educators can approach some of their work as youthworkers, and they can work with designated youthworkers from the school and community agencies to reimagine the relationship and power dynamics between young people and adults in schools. The goals are more effective partnership with young people through deeper understanding of them as human beings and not just students. \n\nPrior completion of into course in education or youth studies is highly recommended.",
    "prereq": {}
  },
  {
    "uid": "805790",
    "code": "YOST5316",
    "subject": "YOST",
    "number": "5316",
    "honors": false,
    "writing": false,
    "name": "Media & Youth",
    "fullname": "Media & Youth: Learning, Teaching, and Doing",
    "info": "This interactive course will introduce interested youth workers to media as a tool for working with youth. It will review the theory and contemporary context of youth media practice. It will showcase exemplar youth media organizations from diverse communities and will introduce and provide hands-on practice with various forms of youth media.\n\nThis class will focus on a theoretical framework of critical media literacy (CML). CML equips young people with opportunities and resources necessary for them to critically analyze, use, and produce various forms of media. Like traditional notions of literacy, critical media literacy depends on two interdependent components: analysis and production. \n\nIn terms of analysis, media literacy is the ability to sift through and analyze the messages that inform, entertain, and sell to youth every day. It is the ability to bring critical thinking skills to bear on all aspects of media, from online news outlets and podcasts to Facebook algorithms and the  shrinking ownership of mass media. In terms of production, the course will provide exposure to and an an opportunity to engage technical skills, artistic expression, contribute to public dialogue, and to experience how young people are contributing to their worlds through youth media projects like: murals, graffiti, spoken word, music, documentaries, magazines, public service announcements, and digital storytelling.\n\nPrior completion of YOST 1001 is highly recommended.",
    "prereq": {}
  },
  {
    "uid": "797794",
    "code": "YOST5319",
    "subject": "YOST",
    "number": "5319",
    "honors": false,
    "writing": false,
    "name": "Understandng Youth Subcultures",
    "fullname": "Understanding Youth Subcultures",
    "info": "The purpose of this course is to introduce the ideas of youth subculture(s), youth worlds and youth lifestyles and to show how these can be useful in thinking about and developing youth policy, youth programs and services, and in direct youth work, as well as in research about youth and young people. All are crucial frames for understanding youth who typically act, dress, talk and otherwise do their everyday lives in ways which disclose membership in groups and larger worlds. To understand young people is to understand their everyday worlds, and (sub)culture and world are approaches to both.\n\n(Sub)culture and world are powerful frames for understanding the very idea of youth and the related ideas of being and doing youth as a young person. This is so even though subculture as a frame is under intense academic scrutiny. These ideas are also useful for understanding youth populations, small groups of youth, and individual young persons. It complements and broadens psychological and developmental perspectives by giving these contexts, while helping locate youth-ness in a world beyond the self. The self is cultural, as much as social, psychological, and spiritual (and philosophical). So too is identity.\n\t\nThe focus of much youth policy, program(s) and service(s) is the individual or small groups of youth, i.e. a group of individuals. An alternate angle and focus is youth subculture(s) and worlds, e.g. gang subculture, sports subcultures, drug subcultures, “street” subcultures, and the like, where the group of individuals is seen in a context of culture – a social group living a ‘way of life,’ thinking, talking, dressing, playing, and making sense in more or less common ways. Middle and senior high schools are cultural worlds where “hicks,” “geeks,” “preps,” “skaters,” “jocks,” “emos,” and the like are ways of action, dress, speech, and relationships which correlate, even predict, school performance, pregnancy and drug use rates, drop-outs, and the like. How is this knowledge used to enhance healthy youth development, and, if not so used, why not? For example, consider co-creating a deviant world in a high school made up of non-drug users, or alternate pathways for peer recognition outside of sports; or co-create a “sanctuary” in a world of tension and fear. Would we come to these alternatives if we did not understand the notions of youth world, youth life-styles, and youth subcultures?\n\nDuring times of deep economic and political, institutional and structural change, as now, youth emerge as one population who can symbolize our despair, as well as our hope. Often youth are treated as a blank screen upon which adults project their fears and anxieties about their own changing worlds. During such times of socioeconomic and sociopolitical changes, there are also “moral panics,” and in these, youth are often seen as “folk devils” and demonized. To them is attributed much that is wrong with society. Indeed, they can be called a (the) source of “our problems.”  We are now in such a period of tumultuous social change and moral panic, with its predictable calls for “old values,” “family values,” “patriotism,” “community,” and the like. Subcultures, worlds, and lifestyles help us to understand the timing, compelling need for and the content of these calls and to anticipate the consequences of proposed actions on conceptions of youth and on actual young people. The absence of youth political groups and subcultures in the United States may suggest why youth continue to be vulnerable to these calls for more adult control over how and where this chronological age is lived.\n\nThis is a course about all young people – all social classes, races/ethnicities, genders, sexual orientations, abilities, and places. This is not negotiable.\n\nprereq: graduate student",
    "prereq": {}
  },
  {
    "uid": "005174",
    "code": "YOST5321",
    "subject": "YOST",
    "number": "5321",
    "honors": false,
    "writing": false,
    "name": "Converse & Relate w/Youth",
    "fullname": "Conversational and Relational Practices with Young People",
    "info": "This course is organized as a conversation lab where students “try on”—in class in person, in real time, with other students as conversational partners—specific conversational practices that are rooted in an ethic of relational care and dialogical approaches to youth work.  \n\nThis course is designed to give students concepts and practices for doing youthwork in a wide range of settings. The focus will be on cultivating and expanding students’ capacities for working with youth from an ethic of relational engagement and cultural responsiveness.  This ethic is a relational stance that youth workers take, whether they are mentoring a youth in a Big Brother/Big Sister program, providing medical case management to HIV+ youth, doing programming at a community center, facilitating outdoor activities, leading arts-based youth programs, leading camp activities, or passing out condoms and toothbrushes as a street outreach worker.\n\nEmphasis is on taking up a reflexive practice that considers multiple perspectives; that accounts for the influence of prevailing cultural discourses that influence youth, youth workers, and their relationships; and that commits to the generating of multiple possibilities.  We will approach youthwork as a political act that requires workers to articulate an ethical stance when engaging with young people.\n\nprereq: 1001 or 2101",
    "prereq": {
      "or": [
        "797905",
        "797892"
      ]
    }
  },
  {
    "uid": "005176",
    "code": "YOST5322",
    "subject": "YOST",
    "number": "5322",
    "honors": false,
    "writing": false,
    "name": "Work with Youth: Families",
    "fullname": "Work with Youth: Families",
    "info": "Young people develop in moments and interactions (Krueger, 1998). Many of their moments occur within families and families come in a wide variety of forms. The American Academy of Family Physicians locates family as, “a group of individuals with a continuing legal, genetic and/or emotional relationship. Society relies on the family group to provide for the economic and protective needs of individuals, especially children and the elderly (1984, 2003). The stories, behaviors, dynamics, attitudes, and habits of families shape the identity and experience of young people. To understand and respect young people and to participate in the creation of environments for healthy youth development, youth workers must learn how to understand and respect the role their families play in their everyday lives.\n\nThis course introduces students to the social construct of “family” as it intersects with traditional notions of adolescent development, their own experience, public policy, and youth work practice. Care is taken to honor the rich diversity of family structures found in the United States today and to notice the impact cultural identity, economic status, education, ethnicity, gender, geography, and other important factors have on the nature of families and the experience of young people inside them.\n\nprereq: Graduate student",
    "prereq": {}
  },
  {
    "uid": "005179",
    "code": "YOST5323",
    "subject": "YOST",
    "number": "5323",
    "honors": false,
    "writing": false,
    "name": "Work with Youth: Groups",
    "fullname": "Work with Youth: Groups",
    "info": "Social group work. Adolescent group needs and associations. Group process. Working with diverse groups of youth in community, in group living situations, and in group therapy.\n\nprereq: 1001 or 2002W or instr consent",
    "prereq": {
      "or": [
        "797905",
        "790636"
      ]
    }
  },
  {
    "uid": "793187",
    "code": "YOST5401",
    "subject": "YOST",
    "number": "5401",
    "honors": false,
    "writing": false,
    "name": "Spirituality & Youth work",
    "fullname": "Young People's Spirituality and Youth work: An Introduction",
    "info": "The purpose of this course is to explore the topic of spirituality and its importance to youth work practice. Spirituality has typically been thought to be the province of religious instruction or faith-based youth work. The premise of our inquiry is that humans are quite naturally spiritual, and that human development in young people includes spiritual development. Spiritual (sometimes called “religious”) traditions and practices seek to give shape, language, and expression to human-spiritual life. It is helpful for youth workers to have knowledge of the traditions that young people are part of. We will take time to learn from one another about the diversity of traditions among us and our experiences. Yet our focus will be on common human experience and development that people increasingly recognize as “spiritual.”\n\nIn recent decades, researchers have begun to focus on spirituality among adolescents. This conversation across disciplines in the academy raises important issues for practitioners. How will new research findings confirm or challenge their experience? How will new research impact everyday practice? This course enters the spaces of social, political, cultural, and religious institutions and practices, illuminating issues, topics, problems, and concerns for those who work with youth directly and or on their behalf. We will consider what youth work practices are most respectful of and best able to facilitate spiritual development of young people in their everyday lives. \n\nAs an undergraduate writing intensive course, all undergraduate students will be expected to write frequently and use a variety of writing styles: autobiographical, journal/book critique, essay, field mapping/observation notes, and research in APA style.  Students will be given feedback on each assignment, and regular class time will be devoted to writing skills and basic grammar.  \n\nprereq: graduate student",
    "prereq": {}
  },
  {
    "uid": "004995",
    "code": "YOST5402",
    "subject": "YOST",
    "number": "5402",
    "honors": false,
    "writing": false,
    "name": "Youth Policy",
    "fullname": "Youth Policy: Enhancing Healthy Development in Everyday Life",
    "info": "Youth policy as formulated in response to youth issues, problems, and community and public concerns. Policy as political response to youth panics, as indirect youthwork, and as a community's moral compact with its young people. Perspectives are explored specific to student interests.\n\nprereq: [2001, one course each in [FSoS, PolSci, Soc]] or instr consent",
    "prereq": {
      "and": [
        "004912"
      ]
    }
  },
  {
    "uid": "817260",
    "code": "YOST5951",
    "subject": "YOST",
    "number": "5951",
    "honors": false,
    "writing": false,
    "name": "Ways of Knowing in YDL",
    "fullname": "Ways of Knowing in Youth Development Leadership:  Using Research and Evlauation to Support Community",
    "info": "This course aims to stimulate students to think critically about youth development and youth work through exploring different ways of knowing. These paradigms each construct different understandings of young people and offer evidence to support diverse youth development practice and programs. Students will leave with a broad perspective of how youth development and youth work empirical evidence is constructed and used to support healthy youth development.  \nPreviously offered as YoSt 5950. ",
    "prereq": {}
  },
  {
    "uid": "003183",
    "code": "YOST5952",
    "subject": "YOST",
    "number": "5952",
    "honors": false,
    "writing": false,
    "name": "Everyday Lives of Youth",
    "fullname": "Everyday Lives of Youth",
    "info": "Youth as idea/lived-reality in scholarship, public discourse, and professional practice. Building practice of work with or on behalf of youth.",
    "prereq": {}
  },
  {
    "uid": "797090",
    "code": "YOST5954",
    "subject": "YOST",
    "number": "5954",
    "honors": false,
    "writing": false,
    "name": "Experiential Learning:Pedagogy",
    "fullname": "Experiential Learning: Pedagogy for Community and Classroom",
    "info": "Relationship between experience and learning in community and school settings. Emphasizes intentional application of experiential learning theory/practice to educational program development.",
    "prereq": {}
  },
  {
    "uid": "003186",
    "code": "YOST5956",
    "subject": "YOST",
    "number": "5956",
    "honors": false,
    "writing": false,
    "name": "Org. Approaches to Youth Dev.",
    "fullname": "Organizational Approaches to Youth Development",
    "info": "Historical contexts, theoretical frameworks, organizational practices, and public policies that shape nonformal educational experiences of youth in community-based or school-linked settings.",
    "prereq": {}
  },
  {
    "uid": "003196",
    "code": "YOST5958",
    "subject": "YOST",
    "number": "5958",
    "honors": false,
    "writing": false,
    "name": "Community: Context for YDL",
    "fullname": "Community: Context for Youth Development Leadership",
    "info": "Issues/policies in family, school, and community that drive the professional practice of community-based youth work. Practical projects explore what it means to be local, to build social capital for youth, and to involve youth in community change.",
    "prereq": {}
  },
  {
    "uid": "003199",
    "code": "YOST5960",
    "subject": "YOST",
    "number": "5960",
    "honors": false,
    "writing": false,
    "name": "Seminar Youth Dvlpmnt Ldrshp",
    "fullname": "Seminar in Youth Development Leadership",
    "info": "Group study of topics/issues. Course proposal, educational program development. Students participate in co-created learning experience with a group of peers. Four-course sequence.\n\nprereq: YDL student or instr consent",
    "prereq": {}
  },
  {
    "uid": "005032",
    "code": "YOST5962",
    "subject": "YOST",
    "number": "5962",
    "honors": false,
    "writing": false,
    "name": "Leadership Field Exp:Youth Dev",
    "fullname": "Leadership Field Experience: Youth Development",
    "info": "Demonstration of leadership in practice. Project on youth, experiential pedagogy, and community/program settings. Focuses on public policy, advocacy, evaluation, pedagogical issues, program design, curriculum development, or applied research.\n\nprereq: YDL student",
    "prereq": {}
  },
  {
    "uid": "798000",
    "code": "YOST5972",
    "subject": "YOST",
    "number": "5972",
    "honors": false,
    "writing": false,
    "name": "Education in the Community",
    "fullname": "Education in the Community",
    "info": "Models of community/education, their intersections. Twentieth century practice of education in the community in the U.S. Examples from other cultures/times.",
    "prereq": {}
  },
  {
    "uid": "798001",
    "code": "YOST5974",
    "subject": "YOST",
    "number": "5974",
    "honors": false,
    "writing": false,
    "name": "Democratic Learning Community",
    "fullname": "The Democratic Learning Community",
    "info": "Historical/theoretical development of how leading thinkers have conceptualized education centered in the community. Colonial, Native American, transcendentalist, progressive, experiential, critical, and feminist perspectives.",
    "prereq": {}
  }
]